Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x103d (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x26eec): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xd9ca2): ../Core/Src/SecondMain.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xd6e34): /home/anivia/STM32CubeIDE/workspace_1.8.0/UJIMotorsport/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x6d8e9): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x3fff5): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xb2db5): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xd2099): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x86a7b): __int32_t
    <62>   DW_AT_decl_file   : 2
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x11fa7): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8b406): __uint32_t
    <75>   DW_AT_decl_file   : 2
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x53a7e): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x639dd): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x2e0e4): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x11501): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x3fff7): uint8_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x9fae4): uint16_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x86a7d): int32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 44
    <c3>   DW_AT_decl_column : 19
    <c4>   DW_AT_type        : <0x5d>
 <1><c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xb828c): uint32_t
    <d2>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x70>
 <1><d9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 7 (DW_TAG_variable)
    <df>   DW_AT_name        : (indirect string, offset: 0x47ff): ITM_RxBuffer
    <e3>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 2052
    <e6>   DW_AT_decl_column : 25
    <e7>   DW_AT_type        : <0xc8>
    <eb>   DW_AT_external    : 1
    <eb>   DW_AT_declaration : 1
 <1><eb>: Abbrev Number: 8 (DW_TAG_variable)
    <ec>   DW_AT_name        : (indirect string, offset: 0xa5123): SystemCoreClock
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 74
    <f2>   DW_AT_decl_column : 17
    <f3>   DW_AT_type        : <0xcd>
    <f7>   DW_AT_external    : 1
    <f7>   DW_AT_declaration : 1
 <1><f7>: Abbrev Number: 9 (DW_TAG_array_type)
    <f8>   DW_AT_type        : <0xab>
    <fc>   DW_AT_sibling     : <0x107>
 <2><100>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <101>   DW_AT_type        : <0x98>
    <105>   DW_AT_upper_bound : 15
 <2><106>: Abbrev Number: 0
 <1><107>: Abbrev Number: 5 (DW_TAG_const_type)
    <108>   DW_AT_type        : <0xf7>
 <1><10c>: Abbrev Number: 8 (DW_TAG_variable)
    <10d>   DW_AT_name        : (indirect string, offset: 0xc6b48): AHBPrescTable
    <111>   DW_AT_decl_file   : 5
    <112>   DW_AT_decl_line   : 76
    <113>   DW_AT_decl_column : 23
    <114>   DW_AT_type        : <0x107>
    <118>   DW_AT_external    : 1
    <118>   DW_AT_declaration : 1
 <1><118>: Abbrev Number: 9 (DW_TAG_array_type)
    <119>   DW_AT_type        : <0xab>
    <11d>   DW_AT_sibling     : <0x128>
 <2><121>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <122>   DW_AT_type        : <0x98>
    <126>   DW_AT_upper_bound : 7
 <2><127>: Abbrev Number: 0
 <1><128>: Abbrev Number: 5 (DW_TAG_const_type)
    <129>   DW_AT_type        : <0x118>
 <1><12d>: Abbrev Number: 8 (DW_TAG_variable)
    <12e>   DW_AT_name        : (indirect string, offset: 0x8c180): APBPrescTable
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 77
    <134>   DW_AT_decl_column : 23
    <135>   DW_AT_type        : <0x128>
    <139>   DW_AT_external    : 1
    <139>   DW_AT_declaration : 1
 <1><139>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13a>   DW_AT_byte_size   : 56
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 293
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x206>
 <2><143>: Abbrev Number: 12 (DW_TAG_member)
    <144>   DW_AT_name        : CR
    <147>   DW_AT_decl_file   : 6
    <148>   DW_AT_decl_line   : 295
    <14a>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xd9>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 13 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x76d4d): SWTRIGR
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 296
    <158>   DW_AT_decl_column : 17
    <159>   DW_AT_type        : <0xd9>
    <15d>   DW_AT_data_member_location: 4
 <2><15e>: Abbrev Number: 13 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x2e6ec): DHR12R1
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 297
    <166>   DW_AT_decl_column : 17
    <167>   DW_AT_type        : <0xd9>
    <16b>   DW_AT_data_member_location: 8
 <2><16c>: Abbrev Number: 13 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0xb22e0): DHR12L1
    <171>   DW_AT_decl_file   : 6
    <172>   DW_AT_decl_line   : 298
    <174>   DW_AT_decl_column : 17
    <175>   DW_AT_type        : <0xd9>
    <179>   DW_AT_data_member_location: 12
 <2><17a>: Abbrev Number: 13 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x7d6f7): DHR8R1
    <17f>   DW_AT_decl_file   : 6
    <180>   DW_AT_decl_line   : 299
    <182>   DW_AT_decl_column : 17
    <183>   DW_AT_type        : <0xd9>
    <187>   DW_AT_data_member_location: 16
 <2><188>: Abbrev Number: 13 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0xb4dbe): DHR12R2
    <18d>   DW_AT_decl_file   : 6
    <18e>   DW_AT_decl_line   : 300
    <190>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xd9>
    <195>   DW_AT_data_member_location: 20
 <2><196>: Abbrev Number: 13 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0xb22e8): DHR12L2
    <19b>   DW_AT_decl_file   : 6
    <19c>   DW_AT_decl_line   : 301
    <19e>   DW_AT_decl_column : 17
    <19f>   DW_AT_type        : <0xd9>
    <1a3>   DW_AT_data_member_location: 24
 <2><1a4>: Abbrev Number: 13 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x7d6fe): DHR8R2
    <1a9>   DW_AT_decl_file   : 6
    <1aa>   DW_AT_decl_line   : 302
    <1ac>   DW_AT_decl_column : 17
    <1ad>   DW_AT_type        : <0xd9>
    <1b1>   DW_AT_data_member_location: 28
 <2><1b2>: Abbrev Number: 13 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xb4ee0): DHR12RD
    <1b7>   DW_AT_decl_file   : 6
    <1b8>   DW_AT_decl_line   : 303
    <1ba>   DW_AT_decl_column : 17
    <1bb>   DW_AT_type        : <0xd9>
    <1bf>   DW_AT_data_member_location: 32
 <2><1c0>: Abbrev Number: 13 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0xb2531): DHR12LD
    <1c5>   DW_AT_decl_file   : 6
    <1c6>   DW_AT_decl_line   : 304
    <1c8>   DW_AT_decl_column : 17
    <1c9>   DW_AT_type        : <0xd9>
    <1cd>   DW_AT_data_member_location: 36
 <2><1ce>: Abbrev Number: 13 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x7d8cc): DHR8RD
    <1d3>   DW_AT_decl_file   : 6
    <1d4>   DW_AT_decl_line   : 305
    <1d6>   DW_AT_decl_column : 17
    <1d7>   DW_AT_type        : <0xd9>
    <1db>   DW_AT_data_member_location: 40
 <2><1dc>: Abbrev Number: 13 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x92d8): DOR1
    <1e1>   DW_AT_decl_file   : 6
    <1e2>   DW_AT_decl_line   : 306
    <1e4>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xd9>
    <1e9>   DW_AT_data_member_location: 44
 <2><1ea>: Abbrev Number: 13 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x92dd): DOR2
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 307
    <1f2>   DW_AT_decl_column : 17
    <1f3>   DW_AT_type        : <0xd9>
    <1f7>   DW_AT_data_member_location: 48
 <2><1f8>: Abbrev Number: 12 (DW_TAG_member)
    <1f9>   DW_AT_name        : SR
    <1fc>   DW_AT_decl_file   : 6
    <1fd>   DW_AT_decl_line   : 308
    <1ff>   DW_AT_decl_column : 17
    <200>   DW_AT_type        : <0xd9>
    <204>   DW_AT_data_member_location: 52
 <2><205>: Abbrev Number: 0
 <1><206>: Abbrev Number: 14 (DW_TAG_typedef)
    <207>   DW_AT_name        : (indirect string, offset: 0x4c9fb): DAC_TypeDef
    <20b>   DW_AT_decl_file   : 6
    <20c>   DW_AT_decl_line   : 309
    <20e>   DW_AT_decl_column : 3
    <20f>   DW_AT_type        : <0x139>
 <1><213>: Abbrev Number: 11 (DW_TAG_structure_type)
    <214>   DW_AT_byte_size   : 24
    <215>   DW_AT_decl_file   : 6
    <216>   DW_AT_decl_line   : 346
    <218>   DW_AT_decl_column : 9
    <219>   DW_AT_sibling     : <0x271>
 <2><21d>: Abbrev Number: 12 (DW_TAG_member)
    <21e>   DW_AT_name        : CR
    <221>   DW_AT_decl_file   : 6
    <222>   DW_AT_decl_line   : 348
    <224>   DW_AT_decl_column : 17
    <225>   DW_AT_type        : <0xd9>
    <229>   DW_AT_data_member_location: 0
 <2><22a>: Abbrev Number: 13 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x53262): NDTR
    <22f>   DW_AT_decl_file   : 6
    <230>   DW_AT_decl_line   : 349
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xd9>
    <237>   DW_AT_data_member_location: 4
 <2><238>: Abbrev Number: 12 (DW_TAG_member)
    <239>   DW_AT_name        : PAR
    <23d>   DW_AT_decl_file   : 6
    <23e>   DW_AT_decl_line   : 350
    <240>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xd9>
    <245>   DW_AT_data_member_location: 8
 <2><246>: Abbrev Number: 13 (DW_TAG_member)
    <247>   DW_AT_name        : (indirect string, offset: 0x5abcf): M0AR
    <24b>   DW_AT_decl_file   : 6
    <24c>   DW_AT_decl_line   : 351
    <24e>   DW_AT_decl_column : 17
    <24f>   DW_AT_type        : <0xd9>
    <253>   DW_AT_data_member_location: 12
 <2><254>: Abbrev Number: 13 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x78fd0): M1AR
    <259>   DW_AT_decl_file   : 6
    <25a>   DW_AT_decl_line   : 352
    <25c>   DW_AT_decl_column : 17
    <25d>   DW_AT_type        : <0xd9>
    <261>   DW_AT_data_member_location: 16
 <2><262>: Abbrev Number: 12 (DW_TAG_member)
    <263>   DW_AT_name        : FCR
    <267>   DW_AT_decl_file   : 6
    <268>   DW_AT_decl_line   : 353
    <26a>   DW_AT_decl_column : 17
    <26b>   DW_AT_type        : <0xd9>
    <26f>   DW_AT_data_member_location: 20
 <2><270>: Abbrev Number: 0
 <1><271>: Abbrev Number: 14 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0xc6de4): DMA_Stream_TypeDef
    <276>   DW_AT_decl_file   : 6
    <277>   DW_AT_decl_line   : 354
    <279>   DW_AT_decl_column : 3
    <27a>   DW_AT_type        : <0x213>
 <1><27e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <27f>   DW_AT_byte_size   : 40
    <280>   DW_AT_decl_file   : 6
    <281>   DW_AT_decl_line   : 527
    <283>   DW_AT_decl_column : 9
    <284>   DW_AT_sibling     : <0x307>
 <2><288>: Abbrev Number: 13 (DW_TAG_member)
    <289>   DW_AT_name        : (indirect string, offset: 0x8e051): MODER
    <28d>   DW_AT_decl_file   : 6
    <28e>   DW_AT_decl_line   : 529
    <290>   DW_AT_decl_column : 17
    <291>   DW_AT_type        : <0xd9>
    <295>   DW_AT_data_member_location: 0
 <2><296>: Abbrev Number: 13 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xa9a3d): OTYPER
    <29b>   DW_AT_decl_file   : 6
    <29c>   DW_AT_decl_line   : 530
    <29e>   DW_AT_decl_column : 17
    <29f>   DW_AT_type        : <0xd9>
    <2a3>   DW_AT_data_member_location: 4
 <2><2a4>: Abbrev Number: 13 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xbe9e7): OSPEEDR
    <2a9>   DW_AT_decl_file   : 6
    <2aa>   DW_AT_decl_line   : 531
    <2ac>   DW_AT_decl_column : 17
    <2ad>   DW_AT_type        : <0xd9>
    <2b1>   DW_AT_data_member_location: 8
 <2><2b2>: Abbrev Number: 13 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x7e592): PUPDR
    <2b7>   DW_AT_decl_file   : 6
    <2b8>   DW_AT_decl_line   : 532
    <2ba>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0xd9>
    <2bf>   DW_AT_data_member_location: 12
 <2><2c0>: Abbrev Number: 12 (DW_TAG_member)
    <2c1>   DW_AT_name        : IDR
    <2c5>   DW_AT_decl_file   : 6
    <2c6>   DW_AT_decl_line   : 533
    <2c8>   DW_AT_decl_column : 17
    <2c9>   DW_AT_type        : <0xd9>
    <2cd>   DW_AT_data_member_location: 16
 <2><2ce>: Abbrev Number: 12 (DW_TAG_member)
    <2cf>   DW_AT_name        : ODR
    <2d3>   DW_AT_decl_file   : 6
    <2d4>   DW_AT_decl_line   : 534
    <2d6>   DW_AT_decl_column : 17
    <2d7>   DW_AT_type        : <0xd9>
    <2db>   DW_AT_data_member_location: 20
 <2><2dc>: Abbrev Number: 13 (DW_TAG_member)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x31d82): BSRR
    <2e1>   DW_AT_decl_file   : 6
    <2e2>   DW_AT_decl_line   : 535
    <2e4>   DW_AT_decl_column : 17
    <2e5>   DW_AT_type        : <0xd9>
    <2e9>   DW_AT_data_member_location: 24
 <2><2ea>: Abbrev Number: 13 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0xbbbac): LCKR
    <2ef>   DW_AT_decl_file   : 6
    <2f0>   DW_AT_decl_line   : 536
    <2f2>   DW_AT_decl_column : 17
    <2f3>   DW_AT_type        : <0xd9>
    <2f7>   DW_AT_data_member_location: 28
 <2><2f8>: Abbrev Number: 12 (DW_TAG_member)
    <2f9>   DW_AT_name        : AFR
    <2fd>   DW_AT_decl_file   : 6
    <2fe>   DW_AT_decl_line   : 537
    <300>   DW_AT_decl_column : 17
    <301>   DW_AT_type        : <0x317>
    <305>   DW_AT_data_member_location: 32
 <2><306>: Abbrev Number: 0
 <1><307>: Abbrev Number: 9 (DW_TAG_array_type)
    <308>   DW_AT_type        : <0xd9>
    <30c>   DW_AT_sibling     : <0x317>
 <2><310>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <311>   DW_AT_type        : <0x98>
    <315>   DW_AT_upper_bound : 1
 <2><316>: Abbrev Number: 0
 <1><317>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <318>   DW_AT_type        : <0x307>
 <1><31c>: Abbrev Number: 14 (DW_TAG_typedef)
    <31d>   DW_AT_name        : (indirect string, offset: 0xd4f2a): GPIO_TypeDef
    <321>   DW_AT_decl_file   : 6
    <322>   DW_AT_decl_line   : 538
    <324>   DW_AT_decl_column : 3
    <325>   DW_AT_type        : <0x27e>
 <1><329>: Abbrev Number: 2 (DW_TAG_base_type)
    <32a>   DW_AT_byte_size   : 8
    <32b>   DW_AT_encoding    : 4	(float)
    <32c>   DW_AT_name        : (indirect string, offset: 0x28837): long double
 <1><330>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <331>   DW_AT_encoding    : 7	(unsigned)
    <332>   DW_AT_byte_size   : 1
    <333>   DW_AT_type        : <0x3c>
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 51
    <339>   DW_AT_decl_column : 1
    <33a>   DW_AT_sibling     : <0x34b>
 <2><33e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <33f>   DW_AT_name        : (indirect string, offset: 0xa20b7): HAL_UNLOCKED
    <343>   DW_AT_const_value : 0
 <2><344>: Abbrev Number: 16 (DW_TAG_enumerator)
    <345>   DW_AT_name        : (indirect string, offset: 0xdb207): HAL_LOCKED
    <349>   DW_AT_const_value : 1
 <2><34a>: Abbrev Number: 0
 <1><34b>: Abbrev Number: 3 (DW_TAG_typedef)
    <34c>   DW_AT_name        : (indirect string, offset: 0x8114c): HAL_LockTypeDef
    <350>   DW_AT_decl_file   : 7
    <351>   DW_AT_decl_line   : 54
    <352>   DW_AT_decl_column : 3
    <353>   DW_AT_type        : <0x330>
 <1><357>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <358>   DW_AT_prototyped  : 1
 <1><358>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <359>   DW_AT_byte_size   : 4
    <35a>   DW_AT_type        : <0x357>
 <1><35e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <35f>   DW_AT_byte_size   : 48
    <360>   DW_AT_decl_file   : 8
    <361>   DW_AT_decl_line   : 49
    <362>   DW_AT_decl_column : 9
    <363>   DW_AT_sibling     : <0x404>
 <2><367>: Abbrev Number: 20 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xdcd53): Channel
    <36c>   DW_AT_decl_file   : 8
    <36d>   DW_AT_decl_line   : 51
    <36e>   DW_AT_decl_column : 12
    <36f>   DW_AT_type        : <0xcd>
    <373>   DW_AT_data_member_location: 0
 <2><374>: Abbrev Number: 20 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x51560): Direction
    <379>   DW_AT_decl_file   : 8
    <37a>   DW_AT_decl_line   : 54
    <37b>   DW_AT_decl_column : 12
    <37c>   DW_AT_type        : <0xcd>
    <380>   DW_AT_data_member_location: 4
 <2><381>: Abbrev Number: 20 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0xe031): PeriphInc
    <386>   DW_AT_decl_file   : 8
    <387>   DW_AT_decl_line   : 58
    <388>   DW_AT_decl_column : 12
    <389>   DW_AT_type        : <0xcd>
    <38d>   DW_AT_data_member_location: 8
 <2><38e>: Abbrev Number: 20 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x22716): MemInc
    <393>   DW_AT_decl_file   : 8
    <394>   DW_AT_decl_line   : 61
    <395>   DW_AT_decl_column : 12
    <396>   DW_AT_type        : <0xcd>
    <39a>   DW_AT_data_member_location: 12
 <2><39b>: Abbrev Number: 20 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x6cb6d): PeriphDataAlignment
    <3a0>   DW_AT_decl_file   : 8
    <3a1>   DW_AT_decl_line   : 64
    <3a2>   DW_AT_decl_column : 12
    <3a3>   DW_AT_type        : <0xcd>
    <3a7>   DW_AT_data_member_location: 16
 <2><3a8>: Abbrev Number: 20 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xc5e58): MemDataAlignment
    <3ad>   DW_AT_decl_file   : 8
    <3ae>   DW_AT_decl_line   : 67
    <3af>   DW_AT_decl_column : 12
    <3b0>   DW_AT_type        : <0xcd>
    <3b4>   DW_AT_data_member_location: 20
 <2><3b5>: Abbrev Number: 20 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xe3022): Mode
    <3ba>   DW_AT_decl_file   : 8
    <3bb>   DW_AT_decl_line   : 70
    <3bc>   DW_AT_decl_column : 12
    <3bd>   DW_AT_type        : <0xcd>
    <3c1>   DW_AT_data_member_location: 24
 <2><3c2>: Abbrev Number: 20 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0xe1d5d): Priority
    <3c7>   DW_AT_decl_file   : 8
    <3c8>   DW_AT_decl_line   : 75
    <3c9>   DW_AT_decl_column : 12
    <3ca>   DW_AT_type        : <0xcd>
    <3ce>   DW_AT_data_member_location: 28
 <2><3cf>: Abbrev Number: 20 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x5e1ba): FIFOMode
    <3d4>   DW_AT_decl_file   : 8
    <3d5>   DW_AT_decl_line   : 78
    <3d6>   DW_AT_decl_column : 12
    <3d7>   DW_AT_type        : <0xcd>
    <3db>   DW_AT_data_member_location: 32
 <2><3dc>: Abbrev Number: 20 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0xa6c76): FIFOThreshold
    <3e1>   DW_AT_decl_file   : 8
    <3e2>   DW_AT_decl_line   : 83
    <3e3>   DW_AT_decl_column : 12
    <3e4>   DW_AT_type        : <0xcd>
    <3e8>   DW_AT_data_member_location: 36
 <2><3e9>: Abbrev Number: 20 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xa4a8c): MemBurst
    <3ee>   DW_AT_decl_file   : 8
    <3ef>   DW_AT_decl_line   : 86
    <3f0>   DW_AT_decl_column : 12
    <3f1>   DW_AT_type        : <0xcd>
    <3f5>   DW_AT_data_member_location: 40
 <2><3f6>: Abbrev Number: 20 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x4b2fc): PeriphBurst
    <3fb>   DW_AT_decl_file   : 8
    <3fc>   DW_AT_decl_line   : 92
    <3fd>   DW_AT_decl_column : 12
    <3fe>   DW_AT_type        : <0xcd>
    <402>   DW_AT_data_member_location: 44
 <2><403>: Abbrev Number: 0
 <1><404>: Abbrev Number: 3 (DW_TAG_typedef)
    <405>   DW_AT_name        : (indirect string, offset: 0x3b3de): DMA_InitTypeDef
    <409>   DW_AT_decl_file   : 8
    <40a>   DW_AT_decl_line   : 97
    <40b>   DW_AT_decl_column : 2
    <40c>   DW_AT_type        : <0x35e>
 <1><410>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <411>   DW_AT_encoding    : 7	(unsigned)
    <412>   DW_AT_byte_size   : 1
    <413>   DW_AT_type        : <0x3c>
    <417>   DW_AT_decl_file   : 8
    <418>   DW_AT_decl_line   : 104
    <419>   DW_AT_decl_column : 1
    <41a>   DW_AT_sibling     : <0x443>
 <2><41e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <41f>   DW_AT_name        : (indirect string, offset: 0xdb55): HAL_DMA_STATE_RESET
    <423>   DW_AT_const_value : 0
 <2><424>: Abbrev Number: 16 (DW_TAG_enumerator)
    <425>   DW_AT_name        : (indirect string, offset: 0x3c8be): HAL_DMA_STATE_READY
    <429>   DW_AT_const_value : 1
 <2><42a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <42b>   DW_AT_name        : (indirect string, offset: 0x9706a): HAL_DMA_STATE_BUSY
    <42f>   DW_AT_const_value : 2
 <2><430>: Abbrev Number: 16 (DW_TAG_enumerator)
    <431>   DW_AT_name        : (indirect string, offset: 0xd7a86): HAL_DMA_STATE_TIMEOUT
    <435>   DW_AT_const_value : 3
 <2><436>: Abbrev Number: 16 (DW_TAG_enumerator)
    <437>   DW_AT_name        : (indirect string, offset: 0xa667d): HAL_DMA_STATE_ERROR
    <43b>   DW_AT_const_value : 4
 <2><43c>: Abbrev Number: 16 (DW_TAG_enumerator)
    <43d>   DW_AT_name        : (indirect string, offset: 0x556f6): HAL_DMA_STATE_ABORT
    <441>   DW_AT_const_value : 5
 <2><442>: Abbrev Number: 0
 <1><443>: Abbrev Number: 3 (DW_TAG_typedef)
    <444>   DW_AT_name        : (indirect string, offset: 0x789cc): HAL_DMA_StateTypeDef
    <448>   DW_AT_decl_file   : 8
    <449>   DW_AT_decl_line   : 111
    <44a>   DW_AT_decl_column : 2
    <44b>   DW_AT_type        : <0x410>
 <1><44f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <450>   DW_AT_type        : <0x443>
 <1><454>: Abbrev Number: 21 (DW_TAG_structure_type)
    <455>   DW_AT_name        : (indirect string, offset: 0xba669): __DMA_HandleTypeDef
    <459>   DW_AT_byte_size   : 96
    <45a>   DW_AT_decl_file   : 8
    <45b>   DW_AT_decl_line   : 139
    <45c>   DW_AT_decl_column : 16
    <45d>   DW_AT_sibling     : <0x518>
 <2><461>: Abbrev Number: 20 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0xd3fe5): Instance
    <466>   DW_AT_decl_file   : 8
    <467>   DW_AT_decl_line   : 141
    <468>   DW_AT_decl_column : 31
    <469>   DW_AT_type        : <0x518>
    <46d>   DW_AT_data_member_location: 0
 <2><46e>: Abbrev Number: 20 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0xdc88c): Init
    <473>   DW_AT_decl_file   : 8
    <474>   DW_AT_decl_line   : 143
    <475>   DW_AT_decl_column : 30
    <476>   DW_AT_type        : <0x404>
    <47a>   DW_AT_data_member_location: 4
 <2><47b>: Abbrev Number: 20 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x9bd45): Lock
    <480>   DW_AT_decl_file   : 8
    <481>   DW_AT_decl_line   : 145
    <482>   DW_AT_decl_column : 30
    <483>   DW_AT_type        : <0x34b>
    <487>   DW_AT_data_member_location: 52
 <2><488>: Abbrev Number: 20 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0xdd2ec): State
    <48d>   DW_AT_decl_file   : 8
    <48e>   DW_AT_decl_line   : 147
    <48f>   DW_AT_decl_column : 30
    <490>   DW_AT_type        : <0x44f>
    <494>   DW_AT_data_member_location: 53
 <2><495>: Abbrev Number: 20 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0xd062e): Parent
    <49a>   DW_AT_decl_file   : 8
    <49b>   DW_AT_decl_line   : 149
    <49c>   DW_AT_decl_column : 31
    <49d>   DW_AT_type        : <0x51e>
    <4a1>   DW_AT_data_member_location: 56
 <2><4a2>: Abbrev Number: 20 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0xda4f1): XferCpltCallback
    <4a7>   DW_AT_decl_file   : 8
    <4a8>   DW_AT_decl_line   : 151
    <4a9>   DW_AT_decl_column : 33
    <4aa>   DW_AT_type        : <0x531>
    <4ae>   DW_AT_data_member_location: 60
 <2><4af>: Abbrev Number: 20 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0xaa6c7): XferHalfCpltCallback
    <4b4>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 153
    <4b6>   DW_AT_decl_column : 33
    <4b7>   DW_AT_type        : <0x531>
    <4bb>   DW_AT_data_member_location: 64
 <2><4bc>: Abbrev Number: 20 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x80658): XferM1CpltCallback
    <4c1>   DW_AT_decl_file   : 8
    <4c2>   DW_AT_decl_line   : 155
    <4c3>   DW_AT_decl_column : 33
    <4c4>   DW_AT_type        : <0x531>
    <4c8>   DW_AT_data_member_location: 68
 <2><4c9>: Abbrev Number: 20 (DW_TAG_member)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x69490): XferM1HalfCpltCallback
    <4ce>   DW_AT_decl_file   : 8
    <4cf>   DW_AT_decl_line   : 157
    <4d0>   DW_AT_decl_column : 33
    <4d1>   DW_AT_type        : <0x531>
    <4d5>   DW_AT_data_member_location: 72
 <2><4d6>: Abbrev Number: 20 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x1f9c4): XferErrorCallback
    <4db>   DW_AT_decl_file   : 8
    <4dc>   DW_AT_decl_line   : 159
    <4dd>   DW_AT_decl_column : 33
    <4de>   DW_AT_type        : <0x531>
    <4e2>   DW_AT_data_member_location: 76
 <2><4e3>: Abbrev Number: 20 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xcc789): XferAbortCallback
    <4e8>   DW_AT_decl_file   : 8
    <4e9>   DW_AT_decl_line   : 161
    <4ea>   DW_AT_decl_column : 33
    <4eb>   DW_AT_type        : <0x531>
    <4ef>   DW_AT_data_member_location: 80
 <2><4f0>: Abbrev Number: 20 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0xd6595): ErrorCode
    <4f5>   DW_AT_decl_file   : 8
    <4f6>   DW_AT_decl_line   : 163
    <4f7>   DW_AT_decl_column : 30
    <4f8>   DW_AT_type        : <0xd9>
    <4fc>   DW_AT_data_member_location: 84
 <2><4fd>: Abbrev Number: 20 (DW_TAG_member)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x619ad): StreamBaseAddress
    <502>   DW_AT_decl_file   : 8
    <503>   DW_AT_decl_line   : 165
    <504>   DW_AT_decl_column : 30
    <505>   DW_AT_type        : <0xcd>
    <509>   DW_AT_data_member_location: 88
 <2><50a>: Abbrev Number: 20 (DW_TAG_member)
    <50b>   DW_AT_name        : (indirect string, offset: 0xb826a): StreamIndex
    <50f>   DW_AT_decl_file   : 8
    <510>   DW_AT_decl_line   : 167
    <511>   DW_AT_decl_column : 30
    <512>   DW_AT_type        : <0xcd>
    <516>   DW_AT_data_member_location: 92
 <2><517>: Abbrev Number: 0
 <1><518>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <519>   DW_AT_byte_size   : 4
    <51a>   DW_AT_type        : <0x271>
 <1><51e>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <51f>   DW_AT_byte_size   : 4
 <1><520>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <521>   DW_AT_prototyped  : 1
    <521>   DW_AT_sibling     : <0x52b>
 <2><525>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <526>   DW_AT_type        : <0x52b>
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <52c>   DW_AT_byte_size   : 4
    <52d>   DW_AT_type        : <0x454>
 <1><531>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <532>   DW_AT_byte_size   : 4
    <533>   DW_AT_type        : <0x520>
 <1><537>: Abbrev Number: 3 (DW_TAG_typedef)
    <538>   DW_AT_name        : (indirect string, offset: 0xba66b): DMA_HandleTypeDef
    <53c>   DW_AT_decl_file   : 8
    <53d>   DW_AT_decl_line   : 169
    <53e>   DW_AT_decl_column : 2
    <53f>   DW_AT_type        : <0x454>
 <1><543>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <544>   DW_AT_byte_size   : 4
    <545>   DW_AT_type        : <0x537>
 <1><549>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <54a>   DW_AT_encoding    : 7	(unsigned)
    <54b>   DW_AT_byte_size   : 1
    <54c>   DW_AT_type        : <0x3c>
    <550>   DW_AT_decl_file   : 9
    <551>   DW_AT_decl_line   : 51
    <552>   DW_AT_decl_column : 1
    <553>   DW_AT_sibling     : <0x576>
 <2><557>: Abbrev Number: 16 (DW_TAG_enumerator)
    <558>   DW_AT_name        : (indirect string, offset: 0x1f304): HAL_DAC_STATE_RESET
    <55c>   DW_AT_const_value : 0
 <2><55d>: Abbrev Number: 16 (DW_TAG_enumerator)
    <55e>   DW_AT_name        : (indirect string, offset: 0x1044a): HAL_DAC_STATE_READY
    <562>   DW_AT_const_value : 1
 <2><563>: Abbrev Number: 16 (DW_TAG_enumerator)
    <564>   DW_AT_name        : (indirect string, offset: 0xa0bb8): HAL_DAC_STATE_BUSY
    <568>   DW_AT_const_value : 2
 <2><569>: Abbrev Number: 16 (DW_TAG_enumerator)
    <56a>   DW_AT_name        : (indirect string, offset: 0xc6085): HAL_DAC_STATE_TIMEOUT
    <56e>   DW_AT_const_value : 3
 <2><56f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <570>   DW_AT_name        : (indirect string, offset: 0x37825): HAL_DAC_STATE_ERROR
    <574>   DW_AT_const_value : 4
 <2><575>: Abbrev Number: 0
 <1><576>: Abbrev Number: 3 (DW_TAG_typedef)
    <577>   DW_AT_name        : (indirect string, offset: 0xa388d): HAL_DAC_StateTypeDef
    <57b>   DW_AT_decl_file   : 9
    <57c>   DW_AT_decl_line   : 58
    <57d>   DW_AT_decl_column : 3
    <57e>   DW_AT_type        : <0x549>
 <1><582>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <583>   DW_AT_type        : <0x576>
 <1><587>: Abbrev Number: 19 (DW_TAG_structure_type)
    <588>   DW_AT_byte_size   : 20
    <589>   DW_AT_decl_file   : 9
    <58a>   DW_AT_decl_line   : 66
    <58b>   DW_AT_decl_column : 9
    <58c>   DW_AT_sibling     : <0x5df>
 <2><590>: Abbrev Number: 20 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0xd3fe5): Instance
    <595>   DW_AT_decl_file   : 9
    <596>   DW_AT_decl_line   : 69
    <597>   DW_AT_decl_column : 32
    <598>   DW_AT_type        : <0x5df>
    <59c>   DW_AT_data_member_location: 0
 <2><59d>: Abbrev Number: 20 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0xdd2ec): State
    <5a2>   DW_AT_decl_file   : 9
    <5a3>   DW_AT_decl_line   : 71
    <5a4>   DW_AT_decl_column : 31
    <5a5>   DW_AT_type        : <0x582>
    <5a9>   DW_AT_data_member_location: 4
 <2><5aa>: Abbrev Number: 20 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x9bd45): Lock
    <5af>   DW_AT_decl_file   : 9
    <5b0>   DW_AT_decl_line   : 73
    <5b1>   DW_AT_decl_column : 31
    <5b2>   DW_AT_type        : <0x34b>
    <5b6>   DW_AT_data_member_location: 5
 <2><5b7>: Abbrev Number: 20 (DW_TAG_member)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x64784): DMA_Handle1
    <5bc>   DW_AT_decl_file   : 9
    <5bd>   DW_AT_decl_line   : 75
    <5be>   DW_AT_decl_column : 32
    <5bf>   DW_AT_type        : <0x543>
    <5c3>   DW_AT_data_member_location: 8
 <2><5c4>: Abbrev Number: 20 (DW_TAG_member)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x64790): DMA_Handle2
    <5c9>   DW_AT_decl_file   : 9
    <5ca>   DW_AT_decl_line   : 77
    <5cb>   DW_AT_decl_column : 32
    <5cc>   DW_AT_type        : <0x543>
    <5d0>   DW_AT_data_member_location: 12
 <2><5d1>: Abbrev Number: 20 (DW_TAG_member)
    <5d2>   DW_AT_name        : (indirect string, offset: 0xd6595): ErrorCode
    <5d6>   DW_AT_decl_file   : 9
    <5d7>   DW_AT_decl_line   : 79
    <5d8>   DW_AT_decl_column : 31
    <5d9>   DW_AT_type        : <0xd9>
    <5dd>   DW_AT_data_member_location: 16
 <2><5de>: Abbrev Number: 0
 <1><5df>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <5e0>   DW_AT_byte_size   : 4
    <5e1>   DW_AT_type        : <0x206>
 <1><5e5>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x77a72): DAC_HandleTypeDef
    <5ea>   DW_AT_decl_file   : 9
    <5eb>   DW_AT_decl_line   : 97
    <5ec>   DW_AT_decl_column : 3
    <5ed>   DW_AT_type        : <0x587>
 <1><5f1>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <5f2>   DW_AT_encoding    : 7	(unsigned)
    <5f3>   DW_AT_byte_size   : 1
    <5f4>   DW_AT_type        : <0x3c>
    <5f8>   DW_AT_decl_file   : 10
    <5f9>   DW_AT_decl_line   : 51
    <5fa>   DW_AT_decl_column : 1
    <5fb>   DW_AT_sibling     : <0x618>
 <2><5ff>: Abbrev Number: 16 (DW_TAG_enumerator)
    <600>   DW_AT_name        : (indirect string, offset: 0x70338): HAL_TICK_FREQ_10HZ
    <604>   DW_AT_const_value : 100
 <2><605>: Abbrev Number: 16 (DW_TAG_enumerator)
    <606>   DW_AT_name        : (indirect string, offset: 0x514c6): HAL_TICK_FREQ_100HZ
    <60a>   DW_AT_const_value : 10
 <2><60b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <60c>   DW_AT_name        : (indirect string, offset: 0x660aa): HAL_TICK_FREQ_1KHZ
    <610>   DW_AT_const_value : 1
 <2><611>: Abbrev Number: 16 (DW_TAG_enumerator)
    <612>   DW_AT_name        : (indirect string, offset: 0x4ef68): HAL_TICK_FREQ_DEFAULT
    <616>   DW_AT_const_value : 1
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 3 (DW_TAG_typedef)
    <619>   DW_AT_name        : (indirect string, offset: 0xacb93): HAL_TickFreqTypeDef
    <61d>   DW_AT_decl_file   : 10
    <61e>   DW_AT_decl_line   : 56
    <61f>   DW_AT_decl_column : 3
    <620>   DW_AT_type        : <0x5f1>
 <1><624>: Abbrev Number: 8 (DW_TAG_variable)
    <625>   DW_AT_name        : (indirect string, offset: 0x331e8): uwTick
    <629>   DW_AT_decl_file   : 10
    <62a>   DW_AT_decl_line   : 205
    <62b>   DW_AT_decl_column : 22
    <62c>   DW_AT_type        : <0xd9>
    <630>   DW_AT_external    : 1
    <630>   DW_AT_declaration : 1
 <1><630>: Abbrev Number: 8 (DW_TAG_variable)
    <631>   DW_AT_name        : (indirect string, offset: 0x8bf61): uwTickPrio
    <635>   DW_AT_decl_file   : 10
    <636>   DW_AT_decl_line   : 206
    <637>   DW_AT_decl_column : 17
    <638>   DW_AT_type        : <0xcd>
    <63c>   DW_AT_external    : 1
    <63c>   DW_AT_declaration : 1
 <1><63c>: Abbrev Number: 8 (DW_TAG_variable)
    <63d>   DW_AT_name        : (indirect string, offset: 0xce6dc): uwTickFreq
    <641>   DW_AT_decl_file   : 10
    <642>   DW_AT_decl_line   : 207
    <643>   DW_AT_decl_column : 28
    <644>   DW_AT_type        : <0x618>
    <648>   DW_AT_external    : 1
    <648>   DW_AT_declaration : 1
 <1><648>: Abbrev Number: 14 (DW_TAG_typedef)
    <649>   DW_AT_name        : (indirect string, offset: 0x38f9a): wint_t
    <64d>   DW_AT_decl_file   : 11
    <64e>   DW_AT_decl_line   : 350
    <650>   DW_AT_decl_column : 23
    <651>   DW_AT_type        : <0x98>
 <1><655>: Abbrev Number: 3 (DW_TAG_typedef)
    <656>   DW_AT_name        : (indirect string, offset: 0xc6bb6): _off_t
    <65a>   DW_AT_decl_file   : 12
    <65b>   DW_AT_decl_line   : 46
    <65c>   DW_AT_decl_column : 14
    <65d>   DW_AT_type        : <0x69>
 <1><661>: Abbrev Number: 3 (DW_TAG_typedef)
    <662>   DW_AT_name        : (indirect string, offset: 0x31138): _fpos_t
    <666>   DW_AT_decl_file   : 12
    <667>   DW_AT_decl_line   : 116
    <668>   DW_AT_decl_column : 14
    <669>   DW_AT_type        : <0x69>
 <1><66d>: Abbrev Number: 25 (DW_TAG_union_type)
    <66e>   DW_AT_byte_size   : 4
    <66f>   DW_AT_decl_file   : 12
    <670>   DW_AT_decl_line   : 165
    <671>   DW_AT_decl_column : 3
    <672>   DW_AT_sibling     : <0x68f>
 <2><676>: Abbrev Number: 26 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0xa7ea7): __wch
    <67b>   DW_AT_decl_file   : 12
    <67c>   DW_AT_decl_line   : 167
    <67d>   DW_AT_decl_column : 12
    <67e>   DW_AT_type        : <0x648>
 <2><682>: Abbrev Number: 26 (DW_TAG_member)
    <683>   DW_AT_name        : (indirect string, offset: 0x708d0): __wchb
    <687>   DW_AT_decl_file   : 12
    <688>   DW_AT_decl_line   : 168
    <689>   DW_AT_decl_column : 19
    <68a>   DW_AT_type        : <0x68f>
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 9 (DW_TAG_array_type)
    <690>   DW_AT_type        : <0x3c>
    <694>   DW_AT_sibling     : <0x69f>
 <2><698>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <699>   DW_AT_type        : <0x98>
    <69d>   DW_AT_upper_bound : 3
 <2><69e>: Abbrev Number: 0
 <1><69f>: Abbrev Number: 19 (DW_TAG_structure_type)
    <6a0>   DW_AT_byte_size   : 8
    <6a1>   DW_AT_decl_file   : 12
    <6a2>   DW_AT_decl_line   : 162
    <6a3>   DW_AT_decl_column : 9
    <6a4>   DW_AT_sibling     : <0x6c3>
 <2><6a8>: Abbrev Number: 20 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x3de00): __count
    <6ad>   DW_AT_decl_file   : 12
    <6ae>   DW_AT_decl_line   : 164
    <6af>   DW_AT_decl_column : 7
    <6b0>   DW_AT_type        : <0x91>
    <6b4>   DW_AT_data_member_location: 0
 <2><6b5>: Abbrev Number: 20 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x7d16f): __value
    <6ba>   DW_AT_decl_file   : 12
    <6bb>   DW_AT_decl_line   : 169
    <6bc>   DW_AT_decl_column : 5
    <6bd>   DW_AT_type        : <0x66d>
    <6c1>   DW_AT_data_member_location: 4
 <2><6c2>: Abbrev Number: 0
 <1><6c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x725ba): _mbstate_t
    <6c8>   DW_AT_decl_file   : 12
    <6c9>   DW_AT_decl_line   : 170
    <6ca>   DW_AT_decl_column : 3
    <6cb>   DW_AT_type        : <0x69f>
 <1><6cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x7650d): __ULong
    <6d4>   DW_AT_decl_file   : 13
    <6d5>   DW_AT_decl_line   : 22
    <6d6>   DW_AT_decl_column : 25
    <6d7>   DW_AT_type        : <0x7c>
 <1><6db>: Abbrev Number: 3 (DW_TAG_typedef)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x790ee): _LOCK_T
    <6e0>   DW_AT_decl_file   : 14
    <6e1>   DW_AT_decl_line   : 34
    <6e2>   DW_AT_decl_column : 25
    <6e3>   DW_AT_type        : <0x6e7>
 <1><6e7>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <6e8>   DW_AT_byte_size   : 4
    <6e9>   DW_AT_type        : <0x6ed>
 <1><6ed>: Abbrev Number: 27 (DW_TAG_structure_type)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x1bf11): __lock
    <6f2>   DW_AT_declaration : 1
 <1><6f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x6be6a): _flock_t
    <6f7>   DW_AT_decl_file   : 13
    <6f8>   DW_AT_decl_line   : 35
    <6f9>   DW_AT_decl_column : 27
    <6fa>   DW_AT_type        : <0x6db>
 <1><6fe>: Abbrev Number: 21 (DW_TAG_structure_type)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x4c952): _Bigint
    <703>   DW_AT_byte_size   : 24
    <704>   DW_AT_decl_file   : 13
    <705>   DW_AT_decl_line   : 52
    <706>   DW_AT_decl_column : 8
    <707>   DW_AT_sibling     : <0x758>
 <2><70b>: Abbrev Number: 20 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x821eb): _next
    <710>   DW_AT_decl_file   : 13
    <711>   DW_AT_decl_line   : 54
    <712>   DW_AT_decl_column : 19
    <713>   DW_AT_type        : <0x758>
    <717>   DW_AT_data_member_location: 0
 <2><718>: Abbrev Number: 28 (DW_TAG_member)
    <719>   DW_AT_name        : _k
    <71c>   DW_AT_decl_file   : 13
    <71d>   DW_AT_decl_line   : 55
    <71e>   DW_AT_decl_column : 7
    <71f>   DW_AT_type        : <0x91>
    <723>   DW_AT_data_member_location: 4
 <2><724>: Abbrev Number: 20 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0x9ca1b): _maxwds
    <729>   DW_AT_decl_file   : 13
    <72a>   DW_AT_decl_line   : 55
    <72b>   DW_AT_decl_column : 11
    <72c>   DW_AT_type        : <0x91>
    <730>   DW_AT_data_member_location: 8
 <2><731>: Abbrev Number: 20 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x745b7): _sign
    <736>   DW_AT_decl_file   : 13
    <737>   DW_AT_decl_line   : 55
    <738>   DW_AT_decl_column : 20
    <739>   DW_AT_type        : <0x91>
    <73d>   DW_AT_data_member_location: 12
 <2><73e>: Abbrev Number: 20 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x73fd6): _wds
    <743>   DW_AT_decl_file   : 13
    <744>   DW_AT_decl_line   : 55
    <745>   DW_AT_decl_column : 27
    <746>   DW_AT_type        : <0x91>
    <74a>   DW_AT_data_member_location: 16
 <2><74b>: Abbrev Number: 28 (DW_TAG_member)
    <74c>   DW_AT_name        : _x
    <74f>   DW_AT_decl_file   : 13
    <750>   DW_AT_decl_line   : 56
    <751>   DW_AT_decl_column : 11
    <752>   DW_AT_type        : <0x75e>
    <756>   DW_AT_data_member_location: 20
 <2><757>: Abbrev Number: 0
 <1><758>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <759>   DW_AT_byte_size   : 4
    <75a>   DW_AT_type        : <0x6fe>
 <1><75e>: Abbrev Number: 9 (DW_TAG_array_type)
    <75f>   DW_AT_type        : <0x6cf>
    <763>   DW_AT_sibling     : <0x76e>
 <2><767>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <768>   DW_AT_type        : <0x98>
    <76c>   DW_AT_upper_bound : 0
 <2><76d>: Abbrev Number: 0
 <1><76e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <76f>   DW_AT_name        : (indirect string, offset: 0x3c3af): __tm
    <773>   DW_AT_byte_size   : 36
    <774>   DW_AT_decl_file   : 13
    <775>   DW_AT_decl_line   : 60
    <776>   DW_AT_decl_column : 8
    <777>   DW_AT_sibling     : <0x7f1>
 <2><77b>: Abbrev Number: 20 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xb34c5): __tm_sec
    <780>   DW_AT_decl_file   : 13
    <781>   DW_AT_decl_line   : 62
    <782>   DW_AT_decl_column : 9
    <783>   DW_AT_type        : <0x91>
    <787>   DW_AT_data_member_location: 0
 <2><788>: Abbrev Number: 20 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0xe2f): __tm_min
    <78d>   DW_AT_decl_file   : 13
    <78e>   DW_AT_decl_line   : 63
    <78f>   DW_AT_decl_column : 9
    <790>   DW_AT_type        : <0x91>
    <794>   DW_AT_data_member_location: 4
 <2><795>: Abbrev Number: 20 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x2f165): __tm_hour
    <79a>   DW_AT_decl_file   : 13
    <79b>   DW_AT_decl_line   : 64
    <79c>   DW_AT_decl_column : 9
    <79d>   DW_AT_type        : <0x91>
    <7a1>   DW_AT_data_member_location: 8
 <2><7a2>: Abbrev Number: 20 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x80017): __tm_mday
    <7a7>   DW_AT_decl_file   : 13
    <7a8>   DW_AT_decl_line   : 65
    <7a9>   DW_AT_decl_column : 9
    <7aa>   DW_AT_type        : <0x91>
    <7ae>   DW_AT_data_member_location: 12
 <2><7af>: Abbrev Number: 20 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x3a56): __tm_mon
    <7b4>   DW_AT_decl_file   : 13
    <7b5>   DW_AT_decl_line   : 66
    <7b6>   DW_AT_decl_column : 9
    <7b7>   DW_AT_type        : <0x91>
    <7bb>   DW_AT_data_member_location: 16
 <2><7bc>: Abbrev Number: 20 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xcbd74): __tm_year
    <7c1>   DW_AT_decl_file   : 13
    <7c2>   DW_AT_decl_line   : 67
    <7c3>   DW_AT_decl_column : 9
    <7c4>   DW_AT_type        : <0x91>
    <7c8>   DW_AT_data_member_location: 20
 <2><7c9>: Abbrev Number: 20 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x5c21f): __tm_wday
    <7ce>   DW_AT_decl_file   : 13
    <7cf>   DW_AT_decl_line   : 68
    <7d0>   DW_AT_decl_column : 9
    <7d1>   DW_AT_type        : <0x91>
    <7d5>   DW_AT_data_member_location: 24
 <2><7d6>: Abbrev Number: 20 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xad6a3): __tm_yday
    <7db>   DW_AT_decl_file   : 13
    <7dc>   DW_AT_decl_line   : 69
    <7dd>   DW_AT_decl_column : 9
    <7de>   DW_AT_type        : <0x91>
    <7e2>   DW_AT_data_member_location: 28
 <2><7e3>: Abbrev Number: 20 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xc5122): __tm_isdst
    <7e8>   DW_AT_decl_file   : 13
    <7e9>   DW_AT_decl_line   : 70
    <7ea>   DW_AT_decl_column : 9
    <7eb>   DW_AT_type        : <0x91>
    <7ef>   DW_AT_data_member_location: 32
 <2><7f0>: Abbrev Number: 0
 <1><7f1>: Abbrev Number: 29 (DW_TAG_structure_type)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x810d6): _on_exit_args
    <7f6>   DW_AT_byte_size   : 264
    <7f8>   DW_AT_decl_file   : 13
    <7f9>   DW_AT_decl_line   : 79
    <7fa>   DW_AT_decl_column : 8
    <7fb>   DW_AT_sibling     : <0x836>
 <2><7ff>: Abbrev Number: 20 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0xc2d8d): _fnargs
    <804>   DW_AT_decl_file   : 13
    <805>   DW_AT_decl_line   : 80
    <806>   DW_AT_decl_column : 10
    <807>   DW_AT_type        : <0x836>
    <80b>   DW_AT_data_member_location: 0
 <2><80c>: Abbrev Number: 20 (DW_TAG_member)
    <80d>   DW_AT_name        : (indirect string, offset: 0xb6f4b): _dso_handle
    <811>   DW_AT_decl_file   : 13
    <812>   DW_AT_decl_line   : 81
    <813>   DW_AT_decl_column : 9
    <814>   DW_AT_type        : <0x836>
    <818>   DW_AT_data_member_location: 128
 <2><819>: Abbrev Number: 30 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x98484): _fntypes
    <81e>   DW_AT_decl_file   : 13
    <81f>   DW_AT_decl_line   : 83
    <820>   DW_AT_decl_column : 10
    <821>   DW_AT_type        : <0x6cf>
    <825>   DW_AT_data_member_location: 256
 <2><827>: Abbrev Number: 30 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x5a143): _is_cxa
    <82c>   DW_AT_decl_file   : 13
    <82d>   DW_AT_decl_line   : 86
    <82e>   DW_AT_decl_column : 10
    <82f>   DW_AT_type        : <0x6cf>
    <833>   DW_AT_data_member_location: 260
 <2><835>: Abbrev Number: 0
 <1><836>: Abbrev Number: 9 (DW_TAG_array_type)
    <837>   DW_AT_type        : <0x51e>
    <83b>   DW_AT_sibling     : <0x846>
 <2><83f>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <840>   DW_AT_type        : <0x98>
    <844>   DW_AT_upper_bound : 31
 <2><845>: Abbrev Number: 0
 <1><846>: Abbrev Number: 21 (DW_TAG_structure_type)
    <847>   DW_AT_name        : (indirect string, offset: 0x3de5): _atexit
    <84b>   DW_AT_byte_size   : 140
    <84c>   DW_AT_decl_file   : 13
    <84d>   DW_AT_decl_line   : 90
    <84e>   DW_AT_decl_column : 8
    <84f>   DW_AT_sibling     : <0x888>
 <2><853>: Abbrev Number: 20 (DW_TAG_member)
    <854>   DW_AT_name        : (indirect string, offset: 0x821eb): _next
    <858>   DW_AT_decl_file   : 13
    <859>   DW_AT_decl_line   : 91
    <85a>   DW_AT_decl_column : 18
    <85b>   DW_AT_type        : <0x888>
    <85f>   DW_AT_data_member_location: 0
 <2><860>: Abbrev Number: 20 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0x8a624): _ind
    <865>   DW_AT_decl_file   : 13
    <866>   DW_AT_decl_line   : 92
    <867>   DW_AT_decl_column : 6
    <868>   DW_AT_type        : <0x91>
    <86c>   DW_AT_data_member_location: 4
 <2><86d>: Abbrev Number: 20 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0x30e2a): _fns
    <872>   DW_AT_decl_file   : 13
    <873>   DW_AT_decl_line   : 93
    <874>   DW_AT_decl_column : 9
    <875>   DW_AT_type        : <0x88e>
    <879>   DW_AT_data_member_location: 8
 <2><87a>: Abbrev Number: 20 (DW_TAG_member)
    <87b>   DW_AT_name        : (indirect string, offset: 0xb03e9): _on_exit_args_ptr
    <87f>   DW_AT_decl_file   : 13
    <880>   DW_AT_decl_line   : 94
    <881>   DW_AT_decl_column : 32
    <882>   DW_AT_type        : <0x89e>
    <886>   DW_AT_data_member_location: 136
 <2><887>: Abbrev Number: 0
 <1><888>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <889>   DW_AT_byte_size   : 4
    <88a>   DW_AT_type        : <0x846>
 <1><88e>: Abbrev Number: 9 (DW_TAG_array_type)
    <88f>   DW_AT_type        : <0x358>
    <893>   DW_AT_sibling     : <0x89e>
 <2><897>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <898>   DW_AT_type        : <0x98>
    <89c>   DW_AT_upper_bound : 31
 <2><89d>: Abbrev Number: 0
 <1><89e>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <89f>   DW_AT_byte_size   : 4
    <8a0>   DW_AT_type        : <0x7f1>
 <1><8a4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8a5>   DW_AT_name        : (indirect string, offset: 0x91c68): __sbuf
    <8a9>   DW_AT_byte_size   : 8
    <8aa>   DW_AT_decl_file   : 13
    <8ab>   DW_AT_decl_line   : 122
    <8ac>   DW_AT_decl_column : 8
    <8ad>   DW_AT_sibling     : <0x8cc>
 <2><8b1>: Abbrev Number: 20 (DW_TAG_member)
    <8b2>   DW_AT_name        : (indirect string, offset: 0xd9d98): _base
    <8b6>   DW_AT_decl_file   : 13
    <8b7>   DW_AT_decl_line   : 123
    <8b8>   DW_AT_decl_column : 17
    <8b9>   DW_AT_type        : <0x8cc>
    <8bd>   DW_AT_data_member_location: 0
 <2><8be>: Abbrev Number: 20 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x67d5d): _size
    <8c3>   DW_AT_decl_file   : 13
    <8c4>   DW_AT_decl_line   : 124
    <8c5>   DW_AT_decl_column : 6
    <8c6>   DW_AT_type        : <0x91>
    <8ca>   DW_AT_data_member_location: 4
 <2><8cb>: Abbrev Number: 0
 <1><8cc>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <8cd>   DW_AT_byte_size   : 4
    <8ce>   DW_AT_type        : <0x3c>
 <1><8d2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x2928c): __sFILE_fake
    <8d7>   DW_AT_byte_size   : 32
    <8d8>   DW_AT_decl_file   : 13
    <8d9>   DW_AT_decl_line   : 158
    <8da>   DW_AT_decl_column : 8
    <8db>   DW_AT_sibling     : <0x945>
 <2><8df>: Abbrev Number: 28 (DW_TAG_member)
    <8e0>   DW_AT_name        : _p
    <8e3>   DW_AT_decl_file   : 13
    <8e4>   DW_AT_decl_line   : 159
    <8e5>   DW_AT_decl_column : 18
    <8e6>   DW_AT_type        : <0x8cc>
    <8ea>   DW_AT_data_member_location: 0
 <2><8eb>: Abbrev Number: 28 (DW_TAG_member)
    <8ec>   DW_AT_name        : _r
    <8ef>   DW_AT_decl_file   : 13
    <8f0>   DW_AT_decl_line   : 160
    <8f1>   DW_AT_decl_column : 7
    <8f2>   DW_AT_type        : <0x91>
    <8f6>   DW_AT_data_member_location: 4
 <2><8f7>: Abbrev Number: 28 (DW_TAG_member)
    <8f8>   DW_AT_name        : _w
    <8fb>   DW_AT_decl_file   : 13
    <8fc>   DW_AT_decl_line   : 161
    <8fd>   DW_AT_decl_column : 7
    <8fe>   DW_AT_type        : <0x91>
    <902>   DW_AT_data_member_location: 8
 <2><903>: Abbrev Number: 20 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0x63b11): _flags
    <908>   DW_AT_decl_file   : 13
    <909>   DW_AT_decl_line   : 162
    <90a>   DW_AT_decl_column : 9
    <90b>   DW_AT_type        : <0x43>
    <90f>   DW_AT_data_member_location: 12
 <2><910>: Abbrev Number: 20 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0x2141a): _file
    <915>   DW_AT_decl_file   : 13
    <916>   DW_AT_decl_line   : 163
    <917>   DW_AT_decl_column : 9
    <918>   DW_AT_type        : <0x43>
    <91c>   DW_AT_data_member_location: 14
 <2><91d>: Abbrev Number: 28 (DW_TAG_member)
    <91e>   DW_AT_name        : _bf
    <922>   DW_AT_decl_file   : 13
    <923>   DW_AT_decl_line   : 164
    <924>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x8a4>
    <929>   DW_AT_data_member_location: 16
 <2><92a>: Abbrev Number: 20 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x640e8): _lbfsize
    <92f>   DW_AT_decl_file   : 13
    <930>   DW_AT_decl_line   : 165
    <931>   DW_AT_decl_column : 7
    <932>   DW_AT_type        : <0x91>
    <936>   DW_AT_data_member_location: 24
 <2><937>: Abbrev Number: 20 (DW_TAG_member)
    <938>   DW_AT_name        : (indirect string, offset: 0xe0b8c): _data
    <93c>   DW_AT_decl_file   : 13
    <93d>   DW_AT_decl_line   : 167
    <93e>   DW_AT_decl_column : 18
    <93f>   DW_AT_type        : <0xa8d>
    <943>   DW_AT_data_member_location: 28
 <2><944>: Abbrev Number: 0
 <1><945>: Abbrev Number: 5 (DW_TAG_const_type)
    <946>   DW_AT_type        : <0x8d2>
 <1><94a>: Abbrev Number: 31 (DW_TAG_structure_type)
    <94b>   DW_AT_name        : (indirect string, offset: 0xe5f6f): _reent
    <94f>   DW_AT_byte_size   : 96
    <950>   DW_AT_decl_file   : 13
    <951>   DW_AT_decl_line   : 377
    <953>   DW_AT_decl_column : 8
    <954>   DW_AT_sibling     : <0xa8d>
 <2><958>: Abbrev Number: 13 (DW_TAG_member)
    <959>   DW_AT_name        : (indirect string, offset: 0x63438): _errno
    <95d>   DW_AT_decl_file   : 13
    <95e>   DW_AT_decl_line   : 381
    <960>   DW_AT_decl_column : 7
    <961>   DW_AT_type        : <0x91>
    <965>   DW_AT_data_member_location: 0
 <2><966>: Abbrev Number: 13 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0x686f3): _stdin
    <96b>   DW_AT_decl_file   : 13
    <96c>   DW_AT_decl_line   : 386
    <96e>   DW_AT_decl_column : 11
    <96f>   DW_AT_type        : <0xce5>
    <973>   DW_AT_data_member_location: 4
 <2><974>: Abbrev Number: 13 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x502d0): _stdout
    <979>   DW_AT_decl_file   : 13
    <97a>   DW_AT_decl_line   : 386
    <97c>   DW_AT_decl_column : 20
    <97d>   DW_AT_type        : <0xce5>
    <981>   DW_AT_data_member_location: 8
 <2><982>: Abbrev Number: 13 (DW_TAG_member)
    <983>   DW_AT_name        : (indirect string, offset: 0xd9788): _stderr
    <987>   DW_AT_decl_file   : 13
    <988>   DW_AT_decl_line   : 386
    <98a>   DW_AT_decl_column : 30
    <98b>   DW_AT_type        : <0xce5>
    <98f>   DW_AT_data_member_location: 12
 <2><990>: Abbrev Number: 13 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x8a61f): _inc
    <995>   DW_AT_decl_file   : 13
    <996>   DW_AT_decl_line   : 388
    <998>   DW_AT_decl_column : 8
    <999>   DW_AT_type        : <0x91>
    <99d>   DW_AT_data_member_location: 16
 <2><99e>: Abbrev Number: 13 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0xace58): _emergency
    <9a3>   DW_AT_decl_file   : 13
    <9a4>   DW_AT_decl_line   : 390
    <9a6>   DW_AT_decl_column : 9
    <9a7>   DW_AT_type        : <0xbf9>
    <9ab>   DW_AT_data_member_location: 20
 <2><9ac>: Abbrev Number: 13 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x5e8d3): __sdidinit
    <9b1>   DW_AT_decl_file   : 13
    <9b2>   DW_AT_decl_line   : 392
    <9b4>   DW_AT_decl_column : 7
    <9b5>   DW_AT_type        : <0x91>
    <9b9>   DW_AT_data_member_location: 24
 <2><9ba>: Abbrev Number: 13 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x130ec): _unspecified_locale_info
    <9bf>   DW_AT_decl_file   : 13
    <9c0>   DW_AT_decl_line   : 394
    <9c2>   DW_AT_decl_column : 7
    <9c3>   DW_AT_type        : <0x91>
    <9c7>   DW_AT_data_member_location: 28
 <2><9c8>: Abbrev Number: 13 (DW_TAG_member)
    <9c9>   DW_AT_name        : (indirect string, offset: 0xc23c2): _locale
    <9cd>   DW_AT_decl_file   : 13
    <9ce>   DW_AT_decl_line   : 395
    <9d0>   DW_AT_decl_column : 22
    <9d1>   DW_AT_type        : <0xe4d>
    <9d5>   DW_AT_data_member_location: 32
 <2><9d6>: Abbrev Number: 12 (DW_TAG_member)
    <9d7>   DW_AT_name        : _mp
    <9db>   DW_AT_decl_file   : 13
    <9dc>   DW_AT_decl_line   : 397
    <9de>   DW_AT_decl_column : 18
    <9df>   DW_AT_type        : <0xe53>
    <9e3>   DW_AT_data_member_location: 36
 <2><9e4>: Abbrev Number: 13 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x22079): __cleanup
    <9e9>   DW_AT_decl_file   : 13
    <9ea>   DW_AT_decl_line   : 399
    <9ec>   DW_AT_decl_column : 10
    <9ed>   DW_AT_type        : <0xe64>
    <9f1>   DW_AT_data_member_location: 40
 <2><9f2>: Abbrev Number: 13 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x86f62): _gamma_signgam
    <9f7>   DW_AT_decl_file   : 13
    <9f8>   DW_AT_decl_line   : 401
    <9fa>   DW_AT_decl_column : 7
    <9fb>   DW_AT_type        : <0x91>
    <9ff>   DW_AT_data_member_location: 44
 <2><a00>: Abbrev Number: 13 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0xa0e47): _cvtlen
    <a05>   DW_AT_decl_file   : 13
    <a06>   DW_AT_decl_line   : 404
    <a08>   DW_AT_decl_column : 7
    <a09>   DW_AT_type        : <0x91>
    <a0d>   DW_AT_data_member_location: 48
 <2><a0e>: Abbrev Number: 13 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x64cbd): _cvtbuf
    <a13>   DW_AT_decl_file   : 13
    <a14>   DW_AT_decl_line   : 405
    <a16>   DW_AT_decl_column : 9
    <a17>   DW_AT_type        : <0xbf9>
    <a1b>   DW_AT_data_member_location: 52
 <2><a1c>: Abbrev Number: 13 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0xa3bb0): _r48
    <a21>   DW_AT_decl_file   : 13
    <a22>   DW_AT_decl_line   : 407
    <a24>   DW_AT_decl_column : 19
    <a25>   DW_AT_type        : <0xe6a>
    <a29>   DW_AT_data_member_location: 56
 <2><a2a>: Abbrev Number: 13 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0xb6092): _localtime_buf
    <a2f>   DW_AT_decl_file   : 13
    <a30>   DW_AT_decl_line   : 408
    <a32>   DW_AT_decl_column : 16
    <a33>   DW_AT_type        : <0xe70>
    <a37>   DW_AT_data_member_location: 60
 <2><a38>: Abbrev Number: 13 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0x3443d): _asctime_buf
    <a3d>   DW_AT_decl_file   : 13
    <a3e>   DW_AT_decl_line   : 409
    <a40>   DW_AT_decl_column : 9
    <a41>   DW_AT_type        : <0xbf9>
    <a45>   DW_AT_data_member_location: 64
 <2><a46>: Abbrev Number: 13 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0xb3ab2): _sig_func
    <a4b>   DW_AT_decl_file   : 13
    <a4c>   DW_AT_decl_line   : 412
    <a4e>   DW_AT_decl_column : 12
    <a4f>   DW_AT_type        : <0xe81>
    <a53>   DW_AT_data_member_location: 68
 <2><a54>: Abbrev Number: 13 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x9c7f3): __sglue
    <a59>   DW_AT_decl_file   : 13
    <a5a>   DW_AT_decl_line   : 420
    <a5c>   DW_AT_decl_column : 16
    <a5d>   DW_AT_type        : <0xca6>
    <a61>   DW_AT_data_member_location: 72
 <2><a62>: Abbrev Number: 13 (DW_TAG_member)
    <a63>   DW_AT_name        : (indirect string, offset: 0x3bab4): __sf
    <a67>   DW_AT_decl_file   : 13
    <a68>   DW_AT_decl_line   : 421
    <a6a>   DW_AT_decl_column : 11
    <a6b>   DW_AT_type        : <0xce5>
    <a6f>   DW_AT_data_member_location: 84
 <2><a70>: Abbrev Number: 13 (DW_TAG_member)
    <a71>   DW_AT_name        : (indirect string, offset: 0x628fb): _misc
    <a75>   DW_AT_decl_file   : 13
    <a76>   DW_AT_decl_line   : 422
    <a78>   DW_AT_decl_column : 23
    <a79>   DW_AT_type        : <0xe8d>
    <a7d>   DW_AT_data_member_location: 88
 <2><a7e>: Abbrev Number: 13 (DW_TAG_member)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x88520): _signal_buf
    <a83>   DW_AT_decl_file   : 13
    <a84>   DW_AT_decl_line   : 423
    <a86>   DW_AT_decl_column : 9
    <a87>   DW_AT_type        : <0xbf9>
    <a8b>   DW_AT_data_member_location: 92
 <2><a8c>: Abbrev Number: 0
 <1><a8d>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <a8e>   DW_AT_byte_size   : 4
    <a8f>   DW_AT_type        : <0x94a>
 <1><a93>: Abbrev Number: 5 (DW_TAG_const_type)
    <a94>   DW_AT_type        : <0xa8d>
 <1><a98>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a99>   DW_AT_name        : (indirect string, offset: 0xa7b45): __sFILE
    <a9d>   DW_AT_byte_size   : 104
    <a9e>   DW_AT_decl_file   : 13
    <a9f>   DW_AT_decl_line   : 186
    <aa0>   DW_AT_decl_column : 8
    <aa1>   DW_AT_sibling     : <0xbdb>
 <2><aa5>: Abbrev Number: 28 (DW_TAG_member)
    <aa6>   DW_AT_name        : _p
    <aa9>   DW_AT_decl_file   : 13
    <aaa>   DW_AT_decl_line   : 187
    <aab>   DW_AT_decl_column : 18
    <aac>   DW_AT_type        : <0x8cc>
    <ab0>   DW_AT_data_member_location: 0
 <2><ab1>: Abbrev Number: 28 (DW_TAG_member)
    <ab2>   DW_AT_name        : _r
    <ab5>   DW_AT_decl_file   : 13
    <ab6>   DW_AT_decl_line   : 188
    <ab7>   DW_AT_decl_column : 7
    <ab8>   DW_AT_type        : <0x91>
    <abc>   DW_AT_data_member_location: 4
 <2><abd>: Abbrev Number: 28 (DW_TAG_member)
    <abe>   DW_AT_name        : _w
    <ac1>   DW_AT_decl_file   : 13
    <ac2>   DW_AT_decl_line   : 189
    <ac3>   DW_AT_decl_column : 7
    <ac4>   DW_AT_type        : <0x91>
    <ac8>   DW_AT_data_member_location: 8
 <2><ac9>: Abbrev Number: 20 (DW_TAG_member)
    <aca>   DW_AT_name        : (indirect string, offset: 0x63b11): _flags
    <ace>   DW_AT_decl_file   : 13
    <acf>   DW_AT_decl_line   : 190
    <ad0>   DW_AT_decl_column : 9
    <ad1>   DW_AT_type        : <0x43>
    <ad5>   DW_AT_data_member_location: 12
 <2><ad6>: Abbrev Number: 20 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x2141a): _file
    <adb>   DW_AT_decl_file   : 13
    <adc>   DW_AT_decl_line   : 191
    <add>   DW_AT_decl_column : 9
    <ade>   DW_AT_type        : <0x43>
    <ae2>   DW_AT_data_member_location: 14
 <2><ae3>: Abbrev Number: 28 (DW_TAG_member)
    <ae4>   DW_AT_name        : _bf
    <ae8>   DW_AT_decl_file   : 13
    <ae9>   DW_AT_decl_line   : 192
    <aea>   DW_AT_decl_column : 17
    <aeb>   DW_AT_type        : <0x8a4>
    <aef>   DW_AT_data_member_location: 16
 <2><af0>: Abbrev Number: 20 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0x640e8): _lbfsize
    <af5>   DW_AT_decl_file   : 13
    <af6>   DW_AT_decl_line   : 193
    <af7>   DW_AT_decl_column : 7
    <af8>   DW_AT_type        : <0x91>
    <afc>   DW_AT_data_member_location: 24
 <2><afd>: Abbrev Number: 20 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0xe0b8c): _data
    <b02>   DW_AT_decl_file   : 13
    <b03>   DW_AT_decl_line   : 196
    <b04>   DW_AT_decl_column : 18
    <b05>   DW_AT_type        : <0xa8d>
    <b09>   DW_AT_data_member_location: 28
 <2><b0a>: Abbrev Number: 20 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x3a796): _cookie
    <b0f>   DW_AT_decl_file   : 13
    <b10>   DW_AT_decl_line   : 200
    <b11>   DW_AT_decl_column : 10
    <b12>   DW_AT_type        : <0x51e>
    <b16>   DW_AT_data_member_location: 32
 <2><b17>: Abbrev Number: 20 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0xaca9a): _read
    <b1c>   DW_AT_decl_file   : 13
    <b1d>   DW_AT_decl_line   : 202
    <b1e>   DW_AT_decl_column : 29
    <b1f>   DW_AT_type        : <0xc0b>
    <b23>   DW_AT_data_member_location: 36
 <2><b24>: Abbrev Number: 20 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x1bf47): _write
    <b29>   DW_AT_decl_file   : 13
    <b2a>   DW_AT_decl_line   : 204
    <b2b>   DW_AT_decl_column : 29
    <b2c>   DW_AT_type        : <0xc35>
    <b30>   DW_AT_data_member_location: 40
 <2><b31>: Abbrev Number: 20 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0xd7375): _seek
    <b36>   DW_AT_decl_file   : 13
    <b37>   DW_AT_decl_line   : 207
    <b38>   DW_AT_decl_column : 13
    <b39>   DW_AT_type        : <0xc59>
    <b3d>   DW_AT_data_member_location: 44
 <2><b3e>: Abbrev Number: 20 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0xdef0f): _close
    <b43>   DW_AT_decl_file   : 13
    <b44>   DW_AT_decl_line   : 208
    <b45>   DW_AT_decl_column : 9
    <b46>   DW_AT_type        : <0xc73>
    <b4a>   DW_AT_data_member_location: 48
 <2><b4b>: Abbrev Number: 28 (DW_TAG_member)
    <b4c>   DW_AT_name        : _ub
    <b50>   DW_AT_decl_file   : 13
    <b51>   DW_AT_decl_line   : 211
    <b52>   DW_AT_decl_column : 17
    <b53>   DW_AT_type        : <0x8a4>
    <b57>   DW_AT_data_member_location: 52
 <2><b58>: Abbrev Number: 28 (DW_TAG_member)
    <b59>   DW_AT_name        : _up
    <b5d>   DW_AT_decl_file   : 13
    <b5e>   DW_AT_decl_line   : 212
    <b5f>   DW_AT_decl_column : 18
    <b60>   DW_AT_type        : <0x8cc>
    <b64>   DW_AT_data_member_location: 60
 <2><b65>: Abbrev Number: 28 (DW_TAG_member)
    <b66>   DW_AT_name        : _ur
    <b6a>   DW_AT_decl_file   : 13
    <b6b>   DW_AT_decl_line   : 213
    <b6c>   DW_AT_decl_column : 7
    <b6d>   DW_AT_type        : <0x91>
    <b71>   DW_AT_data_member_location: 64
 <2><b72>: Abbrev Number: 20 (DW_TAG_member)
    <b73>   DW_AT_name        : (indirect string, offset: 0xd4efc): _ubuf
    <b77>   DW_AT_decl_file   : 13
    <b78>   DW_AT_decl_line   : 216
    <b79>   DW_AT_decl_column : 17
    <b7a>   DW_AT_type        : <0xc79>
    <b7e>   DW_AT_data_member_location: 68
 <2><b7f>: Abbrev Number: 20 (DW_TAG_member)
    <b80>   DW_AT_name        : (indirect string, offset: 0x94488): _nbuf
    <b84>   DW_AT_decl_file   : 13
    <b85>   DW_AT_decl_line   : 217
    <b86>   DW_AT_decl_column : 17
    <b87>   DW_AT_type        : <0xc89>
    <b8b>   DW_AT_data_member_location: 71
 <2><b8c>: Abbrev Number: 28 (DW_TAG_member)
    <b8d>   DW_AT_name        : _lb
    <b91>   DW_AT_decl_file   : 13
    <b92>   DW_AT_decl_line   : 220
    <b93>   DW_AT_decl_column : 17
    <b94>   DW_AT_type        : <0x8a4>
    <b98>   DW_AT_data_member_location: 72
 <2><b99>: Abbrev Number: 20 (DW_TAG_member)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x37d65): _blksize
    <b9e>   DW_AT_decl_file   : 13
    <b9f>   DW_AT_decl_line   : 223
    <ba0>   DW_AT_decl_column : 7
    <ba1>   DW_AT_type        : <0x91>
    <ba5>   DW_AT_data_member_location: 80
 <2><ba6>: Abbrev Number: 20 (DW_TAG_member)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x46c99): _offset
    <bab>   DW_AT_decl_file   : 13
    <bac>   DW_AT_decl_line   : 224
    <bad>   DW_AT_decl_column : 10
    <bae>   DW_AT_type        : <0x655>
    <bb2>   DW_AT_data_member_location: 84
 <2><bb3>: Abbrev Number: 20 (DW_TAG_member)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x1bf12): _lock
    <bb8>   DW_AT_decl_file   : 13
    <bb9>   DW_AT_decl_line   : 231
    <bba>   DW_AT_decl_column : 12
    <bbb>   DW_AT_type        : <0x6f2>
    <bbf>   DW_AT_data_member_location: 88
 <2><bc0>: Abbrev Number: 20 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x5f2b1): _mbstate
    <bc5>   DW_AT_decl_file   : 13
    <bc6>   DW_AT_decl_line   : 233
    <bc7>   DW_AT_decl_column : 14
    <bc8>   DW_AT_type        : <0x6c3>
    <bcc>   DW_AT_data_member_location: 92
 <2><bcd>: Abbrev Number: 20 (DW_TAG_member)
    <bce>   DW_AT_name        : (indirect string, offset: 0xb213c): _flags2
    <bd2>   DW_AT_decl_file   : 13
    <bd3>   DW_AT_decl_line   : 234
    <bd4>   DW_AT_decl_column : 9
    <bd5>   DW_AT_type        : <0x91>
    <bd9>   DW_AT_data_member_location: 100
 <2><bda>: Abbrev Number: 0
 <1><bdb>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <bdc>   DW_AT_prototyped  : 1
    <bdc>   DW_AT_type        : <0x91>
    <be0>   DW_AT_sibling     : <0xbf9>
 <2><be4>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <be5>   DW_AT_type        : <0xa8d>
 <2><be9>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bea>   DW_AT_type        : <0x51e>
 <2><bee>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bef>   DW_AT_type        : <0xbf9>
 <2><bf3>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <bf4>   DW_AT_type        : <0x91>
 <2><bf8>: Abbrev Number: 0
 <1><bf9>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <bfa>   DW_AT_byte_size   : 4
    <bfb>   DW_AT_type        : <0xbff>
 <1><bff>: Abbrev Number: 2 (DW_TAG_base_type)
    <c00>   DW_AT_byte_size   : 1
    <c01>   DW_AT_encoding    : 8	(unsigned char)
    <c02>   DW_AT_name        : (indirect string, offset: 0x470ab): char
 <1><c06>: Abbrev Number: 5 (DW_TAG_const_type)
    <c07>   DW_AT_type        : <0xbff>
 <1><c0b>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c0c>   DW_AT_byte_size   : 4
    <c0d>   DW_AT_type        : <0xbdb>
 <1><c11>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <c12>   DW_AT_prototyped  : 1
    <c12>   DW_AT_type        : <0x91>
    <c16>   DW_AT_sibling     : <0xc2f>
 <2><c1a>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c1b>   DW_AT_type        : <0xa8d>
 <2><c1f>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c20>   DW_AT_type        : <0x51e>
 <2><c24>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c25>   DW_AT_type        : <0xc2f>
 <2><c29>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c2a>   DW_AT_type        : <0x91>
 <2><c2e>: Abbrev Number: 0
 <1><c2f>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c30>   DW_AT_byte_size   : 4
    <c31>   DW_AT_type        : <0xc06>
 <1><c35>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c36>   DW_AT_byte_size   : 4
    <c37>   DW_AT_type        : <0xc11>
 <1><c3b>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <c3c>   DW_AT_prototyped  : 1
    <c3c>   DW_AT_type        : <0x661>
    <c40>   DW_AT_sibling     : <0xc59>
 <2><c44>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c45>   DW_AT_type        : <0xa8d>
 <2><c49>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c4a>   DW_AT_type        : <0x51e>
 <2><c4e>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c4f>   DW_AT_type        : <0x661>
 <2><c53>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c54>   DW_AT_type        : <0x91>
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c5a>   DW_AT_byte_size   : 4
    <c5b>   DW_AT_type        : <0xc3b>
 <1><c5f>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <c60>   DW_AT_prototyped  : 1
    <c60>   DW_AT_type        : <0x91>
    <c64>   DW_AT_sibling     : <0xc73>
 <2><c68>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c69>   DW_AT_type        : <0xa8d>
 <2><c6d>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <c6e>   DW_AT_type        : <0x51e>
 <2><c72>: Abbrev Number: 0
 <1><c73>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <c74>   DW_AT_byte_size   : 4
    <c75>   DW_AT_type        : <0xc5f>
 <1><c79>: Abbrev Number: 9 (DW_TAG_array_type)
    <c7a>   DW_AT_type        : <0x3c>
    <c7e>   DW_AT_sibling     : <0xc89>
 <2><c82>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c83>   DW_AT_type        : <0x98>
    <c87>   DW_AT_upper_bound : 2
 <2><c88>: Abbrev Number: 0
 <1><c89>: Abbrev Number: 9 (DW_TAG_array_type)
    <c8a>   DW_AT_type        : <0x3c>
    <c8e>   DW_AT_sibling     : <0xc99>
 <2><c92>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c93>   DW_AT_type        : <0x98>
    <c97>   DW_AT_upper_bound : 0
 <2><c98>: Abbrev Number: 0
 <1><c99>: Abbrev Number: 14 (DW_TAG_typedef)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xc1fa9): __FILE
    <c9e>   DW_AT_decl_file   : 13
    <c9f>   DW_AT_decl_line   : 292
    <ca1>   DW_AT_decl_column : 26
    <ca2>   DW_AT_type        : <0xa98>
 <1><ca6>: Abbrev Number: 31 (DW_TAG_structure_type)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xbbb48): _glue
    <cab>   DW_AT_byte_size   : 12
    <cac>   DW_AT_decl_file   : 13
    <cad>   DW_AT_decl_line   : 296
    <caf>   DW_AT_decl_column : 8
    <cb0>   DW_AT_sibling     : <0xcdf>
 <2><cb4>: Abbrev Number: 13 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x821eb): _next
    <cb9>   DW_AT_decl_file   : 13
    <cba>   DW_AT_decl_line   : 298
    <cbc>   DW_AT_decl_column : 17
    <cbd>   DW_AT_type        : <0xcdf>
    <cc1>   DW_AT_data_member_location: 0
 <2><cc2>: Abbrev Number: 13 (DW_TAG_member)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x52478): _niobs
    <cc7>   DW_AT_decl_file   : 13
    <cc8>   DW_AT_decl_line   : 299
    <cca>   DW_AT_decl_column : 7
    <ccb>   DW_AT_type        : <0x91>
    <ccf>   DW_AT_data_member_location: 4
 <2><cd0>: Abbrev Number: 13 (DW_TAG_member)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x6e75a): _iobs
    <cd5>   DW_AT_decl_file   : 13
    <cd6>   DW_AT_decl_line   : 300
    <cd8>   DW_AT_decl_column : 11
    <cd9>   DW_AT_type        : <0xce5>
    <cdd>   DW_AT_data_member_location: 8
 <2><cde>: Abbrev Number: 0
 <1><cdf>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <ce0>   DW_AT_byte_size   : 4
    <ce1>   DW_AT_type        : <0xca6>
 <1><ce5>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <ce6>   DW_AT_byte_size   : 4
    <ce7>   DW_AT_type        : <0xc99>
 <1><ceb>: Abbrev Number: 31 (DW_TAG_structure_type)
    <cec>   DW_AT_name        : (indirect string, offset: 0x4c5db): _rand48
    <cf0>   DW_AT_byte_size   : 24
    <cf1>   DW_AT_decl_file   : 13
    <cf2>   DW_AT_decl_line   : 324
    <cf4>   DW_AT_decl_column : 8
    <cf5>   DW_AT_sibling     : <0xd32>
 <2><cf9>: Abbrev Number: 13 (DW_TAG_member)
    <cfa>   DW_AT_name        : (indirect string, offset: 0xd72f4): _seed
    <cfe>   DW_AT_decl_file   : 13
    <cff>   DW_AT_decl_line   : 325
    <d01>   DW_AT_decl_column : 18
    <d02>   DW_AT_type        : <0xd32>
    <d06>   DW_AT_data_member_location: 0
 <2><d07>: Abbrev Number: 13 (DW_TAG_member)
    <d08>   DW_AT_name        : (indirect string, offset: 0xc86c3): _mult
    <d0c>   DW_AT_decl_file   : 13
    <d0d>   DW_AT_decl_line   : 326
    <d0f>   DW_AT_decl_column : 18
    <d10>   DW_AT_type        : <0xd32>
    <d14>   DW_AT_data_member_location: 6
 <2><d15>: Abbrev Number: 13 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0x709ae): _add
    <d1a>   DW_AT_decl_file   : 13
    <d1b>   DW_AT_decl_line   : 327
    <d1d>   DW_AT_decl_column : 18
    <d1e>   DW_AT_type        : <0x56>
    <d22>   DW_AT_data_member_location: 12
 <2><d23>: Abbrev Number: 13 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0x821e6): _rand_next
    <d28>   DW_AT_decl_file   : 13
    <d29>   DW_AT_decl_line   : 330
    <d2b>   DW_AT_decl_column : 36
    <d2c>   DW_AT_type        : <0x8a>
    <d30>   DW_AT_data_member_location: 16
 <2><d31>: Abbrev Number: 0
 <1><d32>: Abbrev Number: 9 (DW_TAG_array_type)
    <d33>   DW_AT_type        : <0x56>
    <d37>   DW_AT_sibling     : <0xd42>
 <2><d3b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d3c>   DW_AT_type        : <0x98>
    <d40>   DW_AT_upper_bound : 2
 <2><d41>: Abbrev Number: 0
 <1><d42>: Abbrev Number: 31 (DW_TAG_structure_type)
    <d43>   DW_AT_name        : (indirect string, offset: 0xa6c47): _mprec
    <d47>   DW_AT_byte_size   : 16
    <d48>   DW_AT_decl_file   : 13
    <d49>   DW_AT_decl_line   : 349
    <d4b>   DW_AT_decl_column : 8
    <d4c>   DW_AT_sibling     : <0xd89>
 <2><d50>: Abbrev Number: 13 (DW_TAG_member)
    <d51>   DW_AT_name        : (indirect string, offset: 0xdab1a): _result
    <d55>   DW_AT_decl_file   : 13
    <d56>   DW_AT_decl_line   : 352
    <d58>   DW_AT_decl_column : 19
    <d59>   DW_AT_type        : <0x758>
    <d5d>   DW_AT_data_member_location: 0
 <2><d5e>: Abbrev Number: 13 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x88545): _result_k
    <d63>   DW_AT_decl_file   : 13
    <d64>   DW_AT_decl_line   : 353
    <d66>   DW_AT_decl_column : 7
    <d67>   DW_AT_type        : <0x91>
    <d6b>   DW_AT_data_member_location: 4
 <2><d6c>: Abbrev Number: 13 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x67e47): _p5s
    <d71>   DW_AT_decl_file   : 13
    <d72>   DW_AT_decl_line   : 354
    <d74>   DW_AT_decl_column : 19
    <d75>   DW_AT_type        : <0x758>
    <d79>   DW_AT_data_member_location: 8
 <2><d7a>: Abbrev Number: 13 (DW_TAG_member)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x7e0c1): _freelist
    <d7f>   DW_AT_decl_file   : 13
    <d80>   DW_AT_decl_line   : 355
    <d82>   DW_AT_decl_column : 20
    <d83>   DW_AT_type        : <0xd89>
    <d87>   DW_AT_data_member_location: 12
 <2><d88>: Abbrev Number: 0
 <1><d89>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <d8a>   DW_AT_byte_size   : 4
    <d8b>   DW_AT_type        : <0x758>
 <1><d8f>: Abbrev Number: 31 (DW_TAG_structure_type)
    <d90>   DW_AT_name        : (indirect string, offset: 0x67deb): _misc_reent
    <d94>   DW_AT_byte_size   : 80
    <d95>   DW_AT_decl_file   : 13
    <d96>   DW_AT_decl_line   : 359
    <d98>   DW_AT_decl_column : 8
    <d99>   DW_AT_sibling     : <0xe38>
 <2><d9d>: Abbrev Number: 13 (DW_TAG_member)
    <d9e>   DW_AT_name        : (indirect string, offset: 0xc8328): _strtok_last
    <da2>   DW_AT_decl_file   : 13
    <da3>   DW_AT_decl_line   : 362
    <da5>   DW_AT_decl_column : 9
    <da6>   DW_AT_type        : <0xbf9>
    <daa>   DW_AT_data_member_location: 0
 <2><dab>: Abbrev Number: 13 (DW_TAG_member)
    <dac>   DW_AT_name        : (indirect string, offset: 0x5f024): _mblen_state
    <db0>   DW_AT_decl_file   : 13
    <db1>   DW_AT_decl_line   : 363
    <db3>   DW_AT_decl_column : 14
    <db4>   DW_AT_type        : <0x6c3>
    <db8>   DW_AT_data_member_location: 4
 <2><db9>: Abbrev Number: 13 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0xc8357): _wctomb_state
    <dbe>   DW_AT_decl_file   : 13
    <dbf>   DW_AT_decl_line   : 364
    <dc1>   DW_AT_decl_column : 14
    <dc2>   DW_AT_type        : <0x6c3>
    <dc6>   DW_AT_data_member_location: 12
 <2><dc7>: Abbrev Number: 13 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xbad7f): _mbtowc_state
    <dcc>   DW_AT_decl_file   : 13
    <dcd>   DW_AT_decl_line   : 365
    <dcf>   DW_AT_decl_column : 14
    <dd0>   DW_AT_type        : <0x6c3>
    <dd4>   DW_AT_data_member_location: 20
 <2><dd5>: Abbrev Number: 13 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0xc132c): _l64a_buf
    <dda>   DW_AT_decl_file   : 13
    <ddb>   DW_AT_decl_line   : 366
    <ddd>   DW_AT_decl_column : 8
    <dde>   DW_AT_type        : <0xe38>
    <de2>   DW_AT_data_member_location: 28
 <2><de3>: Abbrev Number: 13 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0xc6ba9): _getdate_err
    <de8>   DW_AT_decl_file   : 13
    <de9>   DW_AT_decl_line   : 367
    <deb>   DW_AT_decl_column : 7
    <dec>   DW_AT_type        : <0x91>
    <df0>   DW_AT_data_member_location: 36
 <2><df1>: Abbrev Number: 13 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x6977f): _mbrlen_state
    <df6>   DW_AT_decl_file   : 13
    <df7>   DW_AT_decl_line   : 368
    <df9>   DW_AT_decl_column : 14
    <dfa>   DW_AT_type        : <0x6c3>
    <dfe>   DW_AT_data_member_location: 40
 <2><dff>: Abbrev Number: 13 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0xc7184): _mbrtowc_state
    <e04>   DW_AT_decl_file   : 13
    <e05>   DW_AT_decl_line   : 369
    <e07>   DW_AT_decl_column : 14
    <e08>   DW_AT_type        : <0x6c3>
    <e0c>   DW_AT_data_member_location: 48
 <2><e0d>: Abbrev Number: 13 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x3e121): _mbsrtowcs_state
    <e12>   DW_AT_decl_file   : 13
    <e13>   DW_AT_decl_line   : 370
    <e15>   DW_AT_decl_column : 14
    <e16>   DW_AT_type        : <0x6c3>
    <e1a>   DW_AT_data_member_location: 56
 <2><e1b>: Abbrev Number: 13 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x43d3a): _wcrtomb_state
    <e20>   DW_AT_decl_file   : 13
    <e21>   DW_AT_decl_line   : 371
    <e23>   DW_AT_decl_column : 14
    <e24>   DW_AT_type        : <0x6c3>
    <e28>   DW_AT_data_member_location: 64
 <2><e29>: Abbrev Number: 13 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x7bf17): _wcsrtombs_state
    <e2e>   DW_AT_decl_file   : 13
    <e2f>   DW_AT_decl_line   : 372
    <e31>   DW_AT_decl_column : 14
    <e32>   DW_AT_type        : <0x6c3>
    <e36>   DW_AT_data_member_location: 72
 <2><e37>: Abbrev Number: 0
 <1><e38>: Abbrev Number: 9 (DW_TAG_array_type)
    <e39>   DW_AT_type        : <0xbff>
    <e3d>   DW_AT_sibling     : <0xe48>
 <2><e41>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e42>   DW_AT_type        : <0x98>
    <e46>   DW_AT_upper_bound : 7
 <2><e47>: Abbrev Number: 0
 <1><e48>: Abbrev Number: 27 (DW_TAG_structure_type)
    <e49>   DW_AT_name        : (indirect string, offset: 0xbbba1): __locale_t
    <e4d>   DW_AT_declaration : 1
 <1><e4d>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e4e>   DW_AT_byte_size   : 4
    <e4f>   DW_AT_type        : <0xe48>
 <1><e53>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e54>   DW_AT_byte_size   : 4
    <e55>   DW_AT_type        : <0xd42>
 <1><e59>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <e5a>   DW_AT_prototyped  : 1
    <e5a>   DW_AT_sibling     : <0xe64>
 <2><e5e>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <e5f>   DW_AT_type        : <0xa8d>
 <2><e63>: Abbrev Number: 0
 <1><e64>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e65>   DW_AT_byte_size   : 4
    <e66>   DW_AT_type        : <0xe59>
 <1><e6a>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e6b>   DW_AT_byte_size   : 4
    <e6c>   DW_AT_type        : <0xceb>
 <1><e70>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e71>   DW_AT_byte_size   : 4
    <e72>   DW_AT_type        : <0x76e>
 <1><e76>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <e77>   DW_AT_prototyped  : 1
    <e77>   DW_AT_sibling     : <0xe81>
 <2><e7b>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <e7c>   DW_AT_type        : <0x91>
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e82>   DW_AT_byte_size   : 4
    <e83>   DW_AT_type        : <0xe87>
 <1><e87>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e88>   DW_AT_byte_size   : 4
    <e89>   DW_AT_type        : <0xe76>
 <1><e8d>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8f>   DW_AT_type        : <0xd8f>
 <1><e93>: Abbrev Number: 7 (DW_TAG_variable)
    <e94>   DW_AT_name        : (indirect string, offset: 0x686ea): __sf_fake_stdin
    <e98>   DW_AT_decl_file   : 13
    <e99>   DW_AT_decl_line   : 463
    <e9b>   DW_AT_decl_column : 34
    <e9c>   DW_AT_type        : <0x945>
    <ea0>   DW_AT_external    : 1
    <ea0>   DW_AT_declaration : 1
 <1><ea0>: Abbrev Number: 7 (DW_TAG_variable)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x502c7): __sf_fake_stdout
    <ea5>   DW_AT_decl_file   : 13
    <ea6>   DW_AT_decl_line   : 464
    <ea8>   DW_AT_decl_column : 34
    <ea9>   DW_AT_type        : <0x945>
    <ead>   DW_AT_external    : 1
    <ead>   DW_AT_declaration : 1
 <1><ead>: Abbrev Number: 7 (DW_TAG_variable)
    <eae>   DW_AT_name        : (indirect string, offset: 0xd977f): __sf_fake_stderr
    <eb2>   DW_AT_decl_file   : 13
    <eb3>   DW_AT_decl_line   : 465
    <eb5>   DW_AT_decl_column : 34
    <eb6>   DW_AT_type        : <0x945>
    <eba>   DW_AT_external    : 1
    <eba>   DW_AT_declaration : 1
 <1><eba>: Abbrev Number: 7 (DW_TAG_variable)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x343ef): _impure_ptr
    <ebf>   DW_AT_decl_file   : 13
    <ec0>   DW_AT_decl_line   : 819
    <ec2>   DW_AT_decl_column : 23
    <ec3>   DW_AT_type        : <0xa8d>
    <ec7>   DW_AT_external    : 1
    <ec7>   DW_AT_declaration : 1
 <1><ec7>: Abbrev Number: 7 (DW_TAG_variable)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xb67f3): _global_impure_ptr
    <ecc>   DW_AT_decl_file   : 13
    <ecd>   DW_AT_decl_line   : 820
    <ecf>   DW_AT_decl_column : 29
    <ed0>   DW_AT_type        : <0xa93>
    <ed4>   DW_AT_external    : 1
    <ed4>   DW_AT_declaration : 1
 <1><ed4>: Abbrev Number: 7 (DW_TAG_variable)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x3dde): _global_atexit
    <ed9>   DW_AT_decl_file   : 13
    <eda>   DW_AT_decl_line   : 838
    <edc>   DW_AT_decl_column : 24
    <edd>   DW_AT_type        : <0x888>
    <ee1>   DW_AT_external    : 1
    <ee1>   DW_AT_declaration : 1
 <1><ee1>: Abbrev Number: 8 (DW_TAG_variable)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x7db59): hdac
    <ee6>   DW_AT_decl_file   : 1
    <ee7>   DW_AT_decl_line   : 15
    <ee8>   DW_AT_decl_column : 26
    <ee9>   DW_AT_type        : <0x5e5>
    <eed>   DW_AT_external    : 1
    <eed>   DW_AT_declaration : 1
 <1><eed>: Abbrev Number: 21 (DW_TAG_structure_type)
    <eee>   DW_AT_name        : (indirect string, offset: 0x220de): dataPacket
    <ef2>   DW_AT_byte_size   : 16
    <ef3>   DW_AT_decl_file   : 1
    <ef4>   DW_AT_decl_line   : 23
    <ef5>   DW_AT_decl_column : 16
    <ef6>   DW_AT_sibling     : <0xf2f>
 <2><efa>: Abbrev Number: 20 (DW_TAG_member)
    <efb>   DW_AT_name        : (indirect string, offset: 0xaaf3e): timestap
    <eff>   DW_AT_decl_file   : 1
    <f00>   DW_AT_decl_line   : 24
    <f01>   DW_AT_decl_column : 6
    <f02>   DW_AT_type        : <0x91>
    <f06>   DW_AT_data_member_location: 0
 <2><f07>: Abbrev Number: 20 (DW_TAG_member)
    <f08>   DW_AT_name        : (indirect string, offset: 0x9157c): oil_temp
    <f0c>   DW_AT_decl_file   : 1
    <f0d>   DW_AT_decl_line   : 25
    <f0e>   DW_AT_decl_column : 6
    <f0f>   DW_AT_type        : <0x91>
    <f13>   DW_AT_data_member_location: 4
 <2><f14>: Abbrev Number: 20 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0xd6a79): water_temp
    <f19>   DW_AT_decl_file   : 1
    <f1a>   DW_AT_decl_line   : 26
    <f1b>   DW_AT_decl_column : 6
    <f1c>   DW_AT_type        : <0x91>
    <f20>   DW_AT_data_member_location: 8
 <2><f21>: Abbrev Number: 20 (DW_TAG_member)
    <f22>   DW_AT_name        : (indirect string, offset: 0x6e0ca): OverWrittable
    <f26>   DW_AT_decl_file   : 1
    <f27>   DW_AT_decl_line   : 27
    <f28>   DW_AT_decl_column : 6
    <f29>   DW_AT_type        : <0x91>
    <f2d>   DW_AT_data_member_location: 12
 <2><f2e>: Abbrev Number: 0
 <1><f2f>: Abbrev Number: 3 (DW_TAG_typedef)
    <f30>   DW_AT_name        : (indirect string, offset: 0x220de): dataPacket
    <f34>   DW_AT_decl_file   : 1
    <f35>   DW_AT_decl_line   : 29
    <f36>   DW_AT_decl_column : 3
    <f37>   DW_AT_type        : <0xeed>
 <1><f3b>: Abbrev Number: 33 (DW_TAG_variable)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x84999): dataTABLE
    <f40>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 31
    <f42>   DW_AT_decl_column : 13
    <f43>   DW_AT_type        : <0xf4d>
    <f47>   DW_AT_external    : 1
    <f47>   DW_AT_location    : 5 byte block: 3 d4 42 0 20 	(DW_OP_addr: 200042d4)
 <1><f4d>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <f4e>   DW_AT_byte_size   : 4
    <f4f>   DW_AT_type        : <0xf2f>
 <1><f53>: Abbrev Number: 34 (DW_TAG_subprogram)
    <f54>   DW_AT_external    : 1
    <f54>   DW_AT_name        : (indirect string, offset: 0x74930): SecondMain
    <f58>   DW_AT_decl_file   : 1
    <f59>   DW_AT_decl_line   : 67
    <f5a>   DW_AT_decl_column : 5
    <f5b>   DW_AT_prototyped  : 1
    <f5b>   DW_AT_type        : <0x91>
    <f5f>   DW_AT_low_pc      : 0x8001040
    <f63>   DW_AT_high_pc     : 0x84
    <f67>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f69>   DW_AT_GNU_all_tail_call_sites: 1
    <f69>   DW_AT_sibling     : <0xfa9>
 <2><f6d>: Abbrev Number: 35 (DW_TAG_subprogram)
    <f6e>   DW_AT_external    : 1
    <f6e>   DW_AT_name        : (indirect string, offset: 0x771c2): malloc
    <f72>   DW_AT_decl_file   : 15
    <f73>   DW_AT_decl_line   : 0
    <f74>   DW_AT_prototyped  : 1
    <f74>   DW_AT_type        : <0x51e>
    <f78>   DW_AT_declaration : 1
    <f78>   DW_AT_sibling     : <0xf82>
 <3><f7c>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <f7d>   DW_AT_type        : <0x98>
 <3><f81>: Abbrev Number: 0
 <2><f82>: Abbrev Number: 36 (DW_TAG_variable)
    <f83>   DW_AT_name        : (indirect string, offset: 0x49c6a): empty
    <f87>   DW_AT_decl_file   : 1
    <f88>   DW_AT_decl_line   : 76
    <f89>   DW_AT_decl_column : 13
    <f8a>   DW_AT_type        : <0xf2f>
    <f8e>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36) [without DW_AT_frame_base]
 <2><f91>: Abbrev Number: 37 (DW_TAG_lexical_block)
    <f92>   DW_AT_low_pc      : 0x800106e
    <f96>   DW_AT_high_pc     : 0x28
 <3><f9a>: Abbrev Number: 38 (DW_TAG_variable)
    <f9b>   DW_AT_name        : i
    <f9d>   DW_AT_decl_file   : 1
    <f9e>   DW_AT_decl_line   : 77
    <f9f>   DW_AT_decl_column : 11
    <fa0>   DW_AT_type        : <0x91>
    <fa4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20) [without DW_AT_frame_base]
 <3><fa7>: Abbrev Number: 0
 <2><fa8>: Abbrev Number: 0
 <1><fa9>: Abbrev Number: 39 (DW_TAG_subprogram)
    <faa>   DW_AT_external    : 1
    <faa>   DW_AT_name        : (indirect string, offset: 0x1e8fc): BlinkTask
    <fae>   DW_AT_decl_file   : 1
    <faf>   DW_AT_decl_line   : 47
    <fb0>   DW_AT_decl_column : 6
    <fb1>   DW_AT_prototyped  : 1
    <fb1>   DW_AT_low_pc      : 0x8000fec
    <fb5>   DW_AT_high_pc     : 0x54
    <fb9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fbb>   DW_AT_GNU_all_tail_call_sites: 1
    <fbb>   DW_AT_sibling     : <0xff8>
 <2><fbf>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x70446): pvParams
    <fc4>   DW_AT_decl_file   : 1
    <fc5>   DW_AT_decl_line   : 47
    <fc6>   DW_AT_decl_column : 23
    <fc7>   DW_AT_type        : <0x51e>
    <fcb>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><fce>: Abbrev Number: 38 (DW_TAG_variable)
    <fcf>   DW_AT_name        : i
    <fd1>   DW_AT_decl_file   : 1
    <fd2>   DW_AT_decl_line   : 48
    <fd3>   DW_AT_decl_column : 10
    <fd4>   DW_AT_type        : <0xbc>
    <fd8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fdb>: Abbrev Number: 37 (DW_TAG_lexical_block)
    <fdc>   DW_AT_low_pc      : 0x8000ff8
    <fe0>   DW_AT_high_pc     : 0x3e
 <3><fe4>: Abbrev Number: 41 (DW_TAG_subprogram)
    <fe5>   DW_AT_external    : 1
    <fe5>   DW_AT_name        : (indirect string, offset: 0x789e): printf
    <fe9>   DW_AT_decl_file   : 15
    <fea>   DW_AT_decl_line   : 0
    <feb>   DW_AT_prototyped  : 1
    <feb>   DW_AT_type        : <0x91>
    <fef>   DW_AT_declaration : 1
 <4><fef>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <ff0>   DW_AT_type        : <0xc2f>
 <4><ff4>: Abbrev Number: 42 (DW_TAG_unspecified_parameters)
 <4><ff5>: Abbrev Number: 0
 <3><ff6>: Abbrev Number: 0
 <2><ff7>: Abbrev Number: 0
 <1><ff8>: Abbrev Number: 43 (DW_TAG_subprogram)
    <ff9>   DW_AT_external    : 1
    <ff9>   DW_AT_name        : (indirect string, offset: 0xb5eb5): SendPacketsTask
    <ffd>   DW_AT_decl_file   : 1
    <ffe>   DW_AT_decl_line   : 41
    <fff>   DW_AT_decl_column : 6
    <1000>   DW_AT_prototyped  : 1
    <1000>   DW_AT_low_pc      : 0x0
    <1004>   DW_AT_high_pc     : 0x14
    <1008>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <100a>   DW_AT_GNU_all_call_sites: 1
    <100a>   DW_AT_sibling     : <0x101e>
 <2><100e>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <100f>   DW_AT_name        : (indirect string, offset: 0x70446): pvParams
    <1013>   DW_AT_decl_file   : 1
    <1014>   DW_AT_decl_line   : 41
    <1015>   DW_AT_decl_column : 29
    <1016>   DW_AT_type        : <0x51e>
    <101a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><101d>: Abbrev Number: 0
 <1><101e>: Abbrev Number: 44 (DW_TAG_subprogram)
    <101f>   DW_AT_external    : 1
    <101f>   DW_AT_name        : (indirect string, offset: 0xd7239): producePacketsTask
    <1023>   DW_AT_decl_file   : 1
    <1024>   DW_AT_decl_line   : 34
    <1025>   DW_AT_decl_column : 6
    <1026>   DW_AT_prototyped  : 1
    <1026>   DW_AT_low_pc      : 0x0
    <102a>   DW_AT_high_pc     : 0x14
    <102e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1030>   DW_AT_GNU_all_call_sites: 1
 <2><1030>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <1031>   DW_AT_name        : (indirect string, offset: 0x70446): pvParams
    <1035>   DW_AT_decl_file   : 1
    <1036>   DW_AT_decl_line   : 34
    <1037>   DW_AT_decl_column : 32
    <1038>   DW_AT_type        : <0x51e>
    <103c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><103f>: Abbrev Number: 0
 <1><1040>: Abbrev Number: 0
  Compilation Unit @ offset 0x1041:
   Length:        0x6c5 (32-bit)
   Version:       4
   Abbrev Offset: 0x298
   Pointer Size:  4
 <0><104c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <104d>   DW_AT_producer    : (indirect string, offset: 0x26eec): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <1051>   DW_AT_language    : 12	(ANSI C99)
    <1052>   DW_AT_name        : (indirect string, offset: 0xdc1d8): ../Core/Src/UMLib.c
    <1056>   DW_AT_comp_dir    : (indirect string, offset: 0xd6e34): /home/anivia/STM32CubeIDE/workspace_1.8.0/UJIMotorsport/Debug
    <105a>   DW_AT_ranges      : 0x28
    <105e>   DW_AT_low_pc      : 0x0
    <1062>   DW_AT_stmt_list   : 0xa72
    <1066>   DW_AT_GNU_macros  : 0x21889
 <1><106a>: Abbrev Number: 2 (DW_TAG_base_type)
    <106b>   DW_AT_byte_size   : 1
    <106c>   DW_AT_encoding    : 6	(signed char)
    <106d>   DW_AT_name        : (indirect string, offset: 0x6d8e9): signed char
 <1><1071>: Abbrev Number: 3 (DW_TAG_typedef)
    <1072>   DW_AT_name        : (indirect string, offset: 0x3fff5): __uint8_t
    <1076>   DW_AT_decl_file   : 2
    <1077>   DW_AT_decl_line   : 43
    <1078>   DW_AT_decl_column : 24
    <1079>   DW_AT_type        : <0x107d>
 <1><107d>: Abbrev Number: 2 (DW_TAG_base_type)
    <107e>   DW_AT_byte_size   : 1
    <107f>   DW_AT_encoding    : 8	(unsigned char)
    <1080>   DW_AT_name        : (indirect string, offset: 0xd3b26): unsigned char
 <1><1084>: Abbrev Number: 2 (DW_TAG_base_type)
    <1085>   DW_AT_byte_size   : 2
    <1086>   DW_AT_encoding    : 5	(signed)
    <1087>   DW_AT_name        : (indirect string, offset: 0xa34c9): short int
 <1><108b>: Abbrev Number: 3 (DW_TAG_typedef)
    <108c>   DW_AT_name        : (indirect string, offset: 0xb2db5): __uint16_t
    <1090>   DW_AT_decl_file   : 2
    <1091>   DW_AT_decl_line   : 57
    <1092>   DW_AT_decl_column : 25
    <1093>   DW_AT_type        : <0x1097>
 <1><1097>: Abbrev Number: 2 (DW_TAG_base_type)
    <1098>   DW_AT_byte_size   : 2
    <1099>   DW_AT_encoding    : 7	(unsigned)
    <109a>   DW_AT_name        : (indirect string, offset: 0xd2099): short unsigned int
 <1><109e>: Abbrev Number: 3 (DW_TAG_typedef)
    <109f>   DW_AT_name        : (indirect string, offset: 0x86a7b): __int32_t
    <10a3>   DW_AT_decl_file   : 2
    <10a4>   DW_AT_decl_line   : 77
    <10a5>   DW_AT_decl_column : 24
    <10a6>   DW_AT_type        : <0x10aa>
 <1><10aa>: Abbrev Number: 2 (DW_TAG_base_type)
    <10ab>   DW_AT_byte_size   : 4
    <10ac>   DW_AT_encoding    : 5	(signed)
    <10ad>   DW_AT_name        : (indirect string, offset: 0x11fa7): long int
 <1><10b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x8b406): __uint32_t
    <10b6>   DW_AT_decl_file   : 2
    <10b7>   DW_AT_decl_line   : 79
    <10b8>   DW_AT_decl_column : 25
    <10b9>   DW_AT_type        : <0x10bd>
 <1><10bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <10be>   DW_AT_byte_size   : 4
    <10bf>   DW_AT_encoding    : 7	(unsigned)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x53a7e): long unsigned int
 <1><10c4>: Abbrev Number: 2 (DW_TAG_base_type)
    <10c5>   DW_AT_byte_size   : 8
    <10c6>   DW_AT_encoding    : 5	(signed)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x639dd): long long int
 <1><10cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <10cc>   DW_AT_byte_size   : 8
    <10cd>   DW_AT_encoding    : 7	(unsigned)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x2e0e4): long long unsigned int
 <1><10d2>: Abbrev Number: 4 (DW_TAG_base_type)
    <10d3>   DW_AT_byte_size   : 4
    <10d4>   DW_AT_encoding    : 5	(signed)
    <10d5>   DW_AT_name        : int
 <1><10d9>: Abbrev Number: 2 (DW_TAG_base_type)
    <10da>   DW_AT_byte_size   : 4
    <10db>   DW_AT_encoding    : 7	(unsigned)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x11501): unsigned int
 <1><10e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <10e1>   DW_AT_name        : (indirect string, offset: 0x3fff7): uint8_t
    <10e5>   DW_AT_decl_file   : 3
    <10e6>   DW_AT_decl_line   : 24
    <10e7>   DW_AT_decl_column : 19
    <10e8>   DW_AT_type        : <0x1071>
 <1><10ec>: Abbrev Number: 5 (DW_TAG_const_type)
    <10ed>   DW_AT_type        : <0x10e0>
 <1><10f1>: Abbrev Number: 3 (DW_TAG_typedef)
    <10f2>   DW_AT_name        : (indirect string, offset: 0x9fae4): uint16_t
    <10f6>   DW_AT_decl_file   : 3
    <10f7>   DW_AT_decl_line   : 36
    <10f8>   DW_AT_decl_column : 20
    <10f9>   DW_AT_type        : <0x108b>
 <1><10fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x86a7d): int32_t
    <1102>   DW_AT_decl_file   : 3
    <1103>   DW_AT_decl_line   : 44
    <1104>   DW_AT_decl_column : 19
    <1105>   DW_AT_type        : <0x109e>
 <1><1109>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <110a>   DW_AT_type        : <0x10fd>
 <1><110e>: Abbrev Number: 3 (DW_TAG_typedef)
    <110f>   DW_AT_name        : (indirect string, offset: 0xb828c): uint32_t
    <1113>   DW_AT_decl_file   : 3
    <1114>   DW_AT_decl_line   : 48
    <1115>   DW_AT_decl_column : 20
    <1116>   DW_AT_type        : <0x10b1>
 <1><111a>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <111b>   DW_AT_type        : <0x110e>
