Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x13dd (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x26985): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xd9f52): ../Core/Src/SecondMain.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xd7105): /home/anivia/STM32CubeIDE/workspace_1.8.0/UJIMotorsport/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x6d40e): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x3fa31): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xb2d72): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xd1f0f): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x866af): __int32_t
    <62>   DW_AT_decl_file   : 2
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x11ed6): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x8b081): __uint32_t
    <75>   DW_AT_decl_file   : 2
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x5352a): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x63545): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x2daa6): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x11430): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x3fa33): uint8_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x9f750): uint16_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x866b1): int32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 44
    <c3>   DW_AT_decl_column : 19
    <c4>   DW_AT_type        : <0x5d>
 <1><c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0xb8253): uint32_t
    <d2>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x70>
 <1><d9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 7 (DW_TAG_variable)
    <df>   DW_AT_name        : (indirect string, offset: 0x47eb): ITM_RxBuffer
    <e3>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 2052
    <e6>   DW_AT_decl_column : 25
    <e7>   DW_AT_type        : <0xc8>
    <eb>   DW_AT_external    : 1
    <eb>   DW_AT_declaration : 1
 <1><eb>: Abbrev Number: 8 (DW_TAG_variable)
    <ec>   DW_AT_name        : (indirect string, offset: 0xa4db6): SystemCoreClock
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 74
    <f2>   DW_AT_decl_column : 17
    <f3>   DW_AT_type        : <0xcd>
    <f7>   DW_AT_external    : 1
    <f7>   DW_AT_declaration : 1
 <1><f7>: Abbrev Number: 9 (DW_TAG_array_type)
    <f8>   DW_AT_type        : <0xab>
    <fc>   DW_AT_sibling     : <0x107>
 <2><100>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <101>   DW_AT_type        : <0x98>
    <105>   DW_AT_upper_bound : 15
 <2><106>: Abbrev Number: 0
 <1><107>: Abbrev Number: 5 (DW_TAG_const_type)
    <108>   DW_AT_type        : <0xf7>
 <1><10c>: Abbrev Number: 8 (DW_TAG_variable)
    <10d>   DW_AT_name        : (indirect string, offset: 0xc6a7a): AHBPrescTable
    <111>   DW_AT_decl_file   : 5
    <112>   DW_AT_decl_line   : 76
    <113>   DW_AT_decl_column : 23
    <114>   DW_AT_type        : <0x107>
    <118>   DW_AT_external    : 1
    <118>   DW_AT_declaration : 1
 <1><118>: Abbrev Number: 9 (DW_TAG_array_type)
    <119>   DW_AT_type        : <0xab>
    <11d>   DW_AT_sibling     : <0x128>
 <2><121>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <122>   DW_AT_type        : <0x98>
    <126>   DW_AT_upper_bound : 7
 <2><127>: Abbrev Number: 0
 <1><128>: Abbrev Number: 5 (DW_TAG_const_type)
    <129>   DW_AT_type        : <0x118>
 <1><12d>: Abbrev Number: 8 (DW_TAG_variable)
    <12e>   DW_AT_name        : (indirect string, offset: 0x8bdfb): APBPrescTable
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 77
    <134>   DW_AT_decl_column : 23
    <135>   DW_AT_type        : <0x128>
    <139>   DW_AT_external    : 1
    <139>   DW_AT_declaration : 1
 <1><139>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13a>   DW_AT_byte_size   : 80
    <13b>   DW_AT_decl_file   : 6
    <13c>   DW_AT_decl_line   : 179
    <13d>   DW_AT_decl_column : 9
    <13e>   DW_AT_sibling     : <0x245>
 <2><142>: Abbrev Number: 12 (DW_TAG_member)
    <143>   DW_AT_name        : SR
    <146>   DW_AT_decl_file   : 6
    <147>   DW_AT_decl_line   : 181
    <148>   DW_AT_decl_column : 17
    <149>   DW_AT_type        : <0xd9>
    <14d>   DW_AT_data_member_location: 0
 <2><14e>: Abbrev Number: 12 (DW_TAG_member)
    <14f>   DW_AT_name        : CR1
    <153>   DW_AT_decl_file   : 6
    <154>   DW_AT_decl_line   : 182
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xd9>
    <15a>   DW_AT_data_member_location: 4
 <2><15b>: Abbrev Number: 12 (DW_TAG_member)
    <15c>   DW_AT_name        : CR2
    <160>   DW_AT_decl_file   : 6
    <161>   DW_AT_decl_line   : 183
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xd9>
    <167>   DW_AT_data_member_location: 8
 <2><168>: Abbrev Number: 13 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0xba105): SMPR1
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 184
    <16f>   DW_AT_decl_column : 17
    <170>   DW_AT_type        : <0xd9>
    <174>   DW_AT_data_member_location: 12
 <2><175>: Abbrev Number: 13 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x4e41d): SMPR2
    <17a>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 185
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xd9>
    <181>   DW_AT_data_member_location: 16
 <2><182>: Abbrev Number: 13 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x4b863): JOFR1
    <187>   DW_AT_decl_file   : 6
    <188>   DW_AT_decl_line   : 186
    <189>   DW_AT_decl_column : 17
    <18a>   DW_AT_type        : <0xd9>
    <18e>   DW_AT_data_member_location: 20
 <2><18f>: Abbrev Number: 13 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x4b869): JOFR2
    <194>   DW_AT_decl_file   : 6
    <195>   DW_AT_decl_line   : 187
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xd9>
    <19b>   DW_AT_data_member_location: 24
 <2><19c>: Abbrev Number: 13 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x4b86f): JOFR3
    <1a1>   DW_AT_decl_file   : 6
    <1a2>   DW_AT_decl_line   : 188
    <1a3>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xd9>
    <1a8>   DW_AT_data_member_location: 28
 <2><1a9>: Abbrev Number: 13 (DW_TAG_member)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x4b875): JOFR4
    <1ae>   DW_AT_decl_file   : 6
    <1af>   DW_AT_decl_line   : 189
    <1b0>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0xd9>
    <1b5>   DW_AT_data_member_location: 32
 <2><1b6>: Abbrev Number: 12 (DW_TAG_member)
    <1b7>   DW_AT_name        : HTR
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 190
    <1bd>   DW_AT_decl_column : 17
    <1be>   DW_AT_type        : <0xd9>
    <1c2>   DW_AT_data_member_location: 36
 <2><1c3>: Abbrev Number: 12 (DW_TAG_member)
    <1c4>   DW_AT_name        : LTR
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 191
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xd9>
    <1cf>   DW_AT_data_member_location: 40
 <2><1d0>: Abbrev Number: 13 (DW_TAG_member)
    <1d1>   DW_AT_name        : (indirect string, offset: 0x979c7): SQR1
    <1d5>   DW_AT_decl_file   : 6
    <1d6>   DW_AT_decl_line   : 192
    <1d7>   DW_AT_decl_column : 17
    <1d8>   DW_AT_type        : <0xd9>
    <1dc>   DW_AT_data_member_location: 44
 <2><1dd>: Abbrev Number: 13 (DW_TAG_member)
    <1de>   DW_AT_name        : (indirect string, offset: 0x10054): SQR2
    <1e2>   DW_AT_decl_file   : 6
    <1e3>   DW_AT_decl_line   : 193
    <1e4>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xd9>
    <1e9>   DW_AT_data_member_location: 48
 <2><1ea>: Abbrev Number: 13 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x10059): SQR3
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 194
    <1f1>   DW_AT_decl_column : 17
    <1f2>   DW_AT_type        : <0xd9>
    <1f6>   DW_AT_data_member_location: 52
 <2><1f7>: Abbrev Number: 13 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x46ca6): JSQR
    <1fc>   DW_AT_decl_file   : 6
    <1fd>   DW_AT_decl_line   : 195
    <1fe>   DW_AT_decl_column : 17
    <1ff>   DW_AT_type        : <0xd9>
    <203>   DW_AT_data_member_location: 56
 <2><204>: Abbrev Number: 13 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x8be4f): JDR1
    <209>   DW_AT_decl_file   : 6
    <20a>   DW_AT_decl_line   : 196
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0xd9>
    <210>   DW_AT_data_member_location: 60
 <2><211>: Abbrev Number: 13 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0x8be54): JDR2
    <216>   DW_AT_decl_file   : 6
    <217>   DW_AT_decl_line   : 197
    <218>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xd9>
    <21d>   DW_AT_data_member_location: 64
 <2><21e>: Abbrev Number: 13 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x8be59): JDR3
    <223>   DW_AT_decl_file   : 6
    <224>   DW_AT_decl_line   : 198
    <225>   DW_AT_decl_column : 17
    <226>   DW_AT_type        : <0xd9>
    <22a>   DW_AT_data_member_location: 68
 <2><22b>: Abbrev Number: 13 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0x3a3cf): JDR4
    <230>   DW_AT_decl_file   : 6
    <231>   DW_AT_decl_line   : 199
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xd9>
    <237>   DW_AT_data_member_location: 72
 <2><238>: Abbrev Number: 12 (DW_TAG_member)
    <239>   DW_AT_name        : DR
    <23c>   DW_AT_decl_file   : 6
    <23d>   DW_AT_decl_line   : 200
    <23e>   DW_AT_decl_column : 17
    <23f>   DW_AT_type        : <0xd9>
    <243>   DW_AT_data_member_location: 76
 <2><244>: Abbrev Number: 0
 <1><245>: Abbrev Number: 3 (DW_TAG_typedef)
    <246>   DW_AT_name        : (indirect string, offset: 0x481): ADC_TypeDef
    <24a>   DW_AT_decl_file   : 6
    <24b>   DW_AT_decl_line   : 201
    <24c>   DW_AT_decl_column : 3
    <24d>   DW_AT_type        : <0x139>
 <1><251>: Abbrev Number: 14 (DW_TAG_structure_type)
    <252>   DW_AT_byte_size   : 56
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 293
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_sibling     : <0x31e>
 <2><25b>: Abbrev Number: 15 (DW_TAG_member)
    <25c>   DW_AT_name        : CR
    <25f>   DW_AT_decl_file   : 6
    <260>   DW_AT_decl_line   : 295
    <262>   DW_AT_decl_column : 17
    <263>   DW_AT_type        : <0xd9>
    <267>   DW_AT_data_member_location: 0
 <2><268>: Abbrev Number: 16 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x7685f): SWTRIGR
    <26d>   DW_AT_decl_file   : 6
    <26e>   DW_AT_decl_line   : 296
    <270>   DW_AT_decl_column : 17
    <271>   DW_AT_type        : <0xd9>
    <275>   DW_AT_data_member_location: 4
 <2><276>: Abbrev Number: 16 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x2e0ae): DHR12R1
    <27b>   DW_AT_decl_file   : 6
    <27c>   DW_AT_decl_line   : 297
    <27e>   DW_AT_decl_column : 17
    <27f>   DW_AT_type        : <0xd9>
    <283>   DW_AT_data_member_location: 8
 <2><284>: Abbrev Number: 16 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xb2266): DHR12L1
    <289>   DW_AT_decl_file   : 6
    <28a>   DW_AT_decl_line   : 298
    <28c>   DW_AT_decl_column : 17
    <28d>   DW_AT_type        : <0xd9>
    <291>   DW_AT_data_member_location: 12
 <2><292>: Abbrev Number: 16 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x7d259): DHR8R1
    <297>   DW_AT_decl_file   : 6
    <298>   DW_AT_decl_line   : 299
    <29a>   DW_AT_decl_column : 17
    <29b>   DW_AT_type        : <0xd9>
    <29f>   DW_AT_data_member_location: 16
 <2><2a0>: Abbrev Number: 16 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0xb4d75): DHR12R2
    <2a5>   DW_AT_decl_file   : 6
    <2a6>   DW_AT_decl_line   : 300
    <2a8>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xd9>
    <2ad>   DW_AT_data_member_location: 20
 <2><2ae>: Abbrev Number: 16 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0xb226e): DHR12L2
    <2b3>   DW_AT_decl_file   : 6
    <2b4>   DW_AT_decl_line   : 301
    <2b6>   DW_AT_decl_column : 17
    <2b7>   DW_AT_type        : <0xd9>
    <2bb>   DW_AT_data_member_location: 24
 <2><2bc>: Abbrev Number: 16 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x7d260): DHR8R2
    <2c1>   DW_AT_decl_file   : 6
    <2c2>   DW_AT_decl_line   : 302
    <2c4>   DW_AT_decl_column : 17
    <2c5>   DW_AT_type        : <0xd9>
    <2c9>   DW_AT_data_member_location: 28
 <2><2ca>: Abbrev Number: 16 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xb4e97): DHR12RD
    <2cf>   DW_AT_decl_file   : 6
    <2d0>   DW_AT_decl_line   : 303
    <2d2>   DW_AT_decl_column : 17
    <2d3>   DW_AT_type        : <0xd9>
    <2d7>   DW_AT_data_member_location: 32
 <2><2d8>: Abbrev Number: 16 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xb24b7): DHR12LD
    <2dd>   DW_AT_decl_file   : 6
    <2de>   DW_AT_decl_line   : 304
    <2e0>   DW_AT_decl_column : 17
    <2e1>   DW_AT_type        : <0xd9>
    <2e5>   DW_AT_data_member_location: 36
 <2><2e6>: Abbrev Number: 16 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x7d42e): DHR8RD
    <2eb>   DW_AT_decl_file   : 6
    <2ec>   DW_AT_decl_line   : 305
    <2ee>   DW_AT_decl_column : 17
    <2ef>   DW_AT_type        : <0xd9>
    <2f3>   DW_AT_data_member_location: 40
 <2><2f4>: Abbrev Number: 16 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x92c0): DOR1
    <2f9>   DW_AT_decl_file   : 6
    <2fa>   DW_AT_decl_line   : 306
    <2fc>   DW_AT_decl_column : 17
    <2fd>   DW_AT_type        : <0xd9>
    <301>   DW_AT_data_member_location: 44
 <2><302>: Abbrev Number: 16 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x92c5): DOR2
    <307>   DW_AT_decl_file   : 6
    <308>   DW_AT_decl_line   : 307
    <30a>   DW_AT_decl_column : 17
    <30b>   DW_AT_type        : <0xd9>
    <30f>   DW_AT_data_member_location: 48
 <2><310>: Abbrev Number: 15 (DW_TAG_member)
    <311>   DW_AT_name        : SR
    <314>   DW_AT_decl_file   : 6
    <315>   DW_AT_decl_line   : 308
    <317>   DW_AT_decl_column : 17
    <318>   DW_AT_type        : <0xd9>
    <31c>   DW_AT_data_member_location: 52
 <2><31d>: Abbrev Number: 0
 <1><31e>: Abbrev Number: 17 (DW_TAG_typedef)
    <31f>   DW_AT_name        : (indirect string, offset: 0x4c4a8): DAC_TypeDef
    <323>   DW_AT_decl_file   : 6
    <324>   DW_AT_decl_line   : 309
    <326>   DW_AT_decl_column : 3
    <327>   DW_AT_type        : <0x251>
 <1><32b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <32c>   DW_AT_byte_size   : 24
    <32d>   DW_AT_decl_file   : 6
    <32e>   DW_AT_decl_line   : 346
    <330>   DW_AT_decl_column : 9
    <331>   DW_AT_sibling     : <0x389>
 <2><335>: Abbrev Number: 15 (DW_TAG_member)
    <336>   DW_AT_name        : CR
    <339>   DW_AT_decl_file   : 6
    <33a>   DW_AT_decl_line   : 348
    <33c>   DW_AT_decl_column : 17
    <33d>   DW_AT_type        : <0xd9>
    <341>   DW_AT_data_member_location: 0
 <2><342>: Abbrev Number: 16 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x52d0e): NDTR
    <347>   DW_AT_decl_file   : 6
    <348>   DW_AT_decl_line   : 349
    <34a>   DW_AT_decl_column : 17
    <34b>   DW_AT_type        : <0xd9>
    <34f>   DW_AT_data_member_location: 4
 <2><350>: Abbrev Number: 15 (DW_TAG_member)
    <351>   DW_AT_name        : PAR
    <355>   DW_AT_decl_file   : 6
    <356>   DW_AT_decl_line   : 350
    <358>   DW_AT_decl_column : 17
    <359>   DW_AT_type        : <0xd9>
    <35d>   DW_AT_data_member_location: 8
 <2><35e>: Abbrev Number: 16 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x5a6b1): M0AR
    <363>   DW_AT_decl_file   : 6
    <364>   DW_AT_decl_line   : 351
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0xd9>
    <36b>   DW_AT_data_member_location: 12
 <2><36c>: Abbrev Number: 16 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x78ab6): M1AR
    <371>   DW_AT_decl_file   : 6
    <372>   DW_AT_decl_line   : 352
    <374>   DW_AT_decl_column : 17
    <375>   DW_AT_type        : <0xd9>
    <379>   DW_AT_data_member_location: 16
 <2><37a>: Abbrev Number: 15 (DW_TAG_member)
    <37b>   DW_AT_name        : FCR
    <37f>   DW_AT_decl_file   : 6
    <380>   DW_AT_decl_line   : 353
    <382>   DW_AT_decl_column : 17
    <383>   DW_AT_type        : <0xd9>
    <387>   DW_AT_data_member_location: 20
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 17 (DW_TAG_typedef)
    <38a>   DW_AT_name        : (indirect string, offset: 0xc6d16): DMA_Stream_TypeDef
    <38e>   DW_AT_decl_file   : 6
    <38f>   DW_AT_decl_line   : 354
    <391>   DW_AT_decl_column : 3
    <392>   DW_AT_type        : <0x32b>
 <1><396>: Abbrev Number: 14 (DW_TAG_structure_type)
    <397>   DW_AT_byte_size   : 40
    <398>   DW_AT_decl_file   : 6
    <399>   DW_AT_decl_line   : 527
    <39b>   DW_AT_decl_column : 9
    <39c>   DW_AT_sibling     : <0x41f>
 <2><3a0>: Abbrev Number: 16 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x8dcc1): MODER
    <3a5>   DW_AT_decl_file   : 6
    <3a6>   DW_AT_decl_line   : 529
    <3a8>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xd9>
    <3ad>   DW_AT_data_member_location: 0
 <2><3ae>: Abbrev Number: 16 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0xa97bd): OTYPER
    <3b3>   DW_AT_decl_file   : 6
    <3b4>   DW_AT_decl_line   : 530
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xd9>
    <3bb>   DW_AT_data_member_location: 4
 <2><3bc>: Abbrev Number: 16 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xbe999): OSPEEDR
    <3c1>   DW_AT_decl_file   : 6
    <3c2>   DW_AT_decl_line   : 531
    <3c4>   DW_AT_decl_column : 17
    <3c5>   DW_AT_type        : <0xd9>
    <3c9>   DW_AT_data_member_location: 8
 <2><3ca>: Abbrev Number: 16 (DW_TAG_member)
    <3cb>   DW_AT_name        : (indirect string, offset: 0x7e132): PUPDR
    <3cf>   DW_AT_decl_file   : 6
    <3d0>   DW_AT_decl_line   : 532
    <3d2>   DW_AT_decl_column : 17
    <3d3>   DW_AT_type        : <0xd9>
    <3d7>   DW_AT_data_member_location: 12
 <2><3d8>: Abbrev Number: 15 (DW_TAG_member)
    <3d9>   DW_AT_name        : IDR
    <3dd>   DW_AT_decl_file   : 6
    <3de>   DW_AT_decl_line   : 533
    <3e0>   DW_AT_decl_column : 17
    <3e1>   DW_AT_type        : <0xd9>
    <3e5>   DW_AT_data_member_location: 16
 <2><3e6>: Abbrev Number: 15 (DW_TAG_member)
    <3e7>   DW_AT_name        : ODR
    <3eb>   DW_AT_decl_file   : 6
    <3ec>   DW_AT_decl_line   : 534
    <3ee>   DW_AT_decl_column : 17
    <3ef>   DW_AT_type        : <0xd9>
    <3f3>   DW_AT_data_member_location: 20
 <2><3f4>: Abbrev Number: 16 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x3173d): BSRR
    <3f9>   DW_AT_decl_file   : 6
    <3fa>   DW_AT_decl_line   : 535
    <3fc>   DW_AT_decl_column : 17
    <3fd>   DW_AT_type        : <0xd9>
    <401>   DW_AT_data_member_location: 24
 <2><402>: Abbrev Number: 16 (DW_TAG_member)
    <403>   DW_AT_name        : (indirect string, offset: 0xbbb7e): LCKR
    <407>   DW_AT_decl_file   : 6
    <408>   DW_AT_decl_line   : 536
    <40a>   DW_AT_decl_column : 17
    <40b>   DW_AT_type        : <0xd9>
    <40f>   DW_AT_data_member_location: 28
 <2><410>: Abbrev Number: 15 (DW_TAG_member)
    <411>   DW_AT_name        : AFR
    <415>   DW_AT_decl_file   : 6
    <416>   DW_AT_decl_line   : 537
    <418>   DW_AT_decl_column : 17
    <419>   DW_AT_type        : <0x42f>
    <41d>   DW_AT_data_member_location: 32
 <2><41e>: Abbrev Number: 0
 <1><41f>: Abbrev Number: 9 (DW_TAG_array_type)
    <420>   DW_AT_type        : <0xd9>
    <424>   DW_AT_sibling     : <0x42f>
 <2><428>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <429>   DW_AT_type        : <0x98>
    <42d>   DW_AT_upper_bound : 1
 <2><42e>: Abbrev Number: 0
 <1><42f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <430>   DW_AT_type        : <0x41f>
 <1><434>: Abbrev Number: 17 (DW_TAG_typedef)
    <435>   DW_AT_name        : (indirect string, offset: 0xd4dbd): GPIO_TypeDef
    <439>   DW_AT_decl_file   : 6
    <43a>   DW_AT_decl_line   : 538
    <43c>   DW_AT_decl_column : 3
    <43d>   DW_AT_type        : <0x396>
 <1><441>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <442>   DW_AT_encoding    : 7	(unsigned)
    <443>   DW_AT_byte_size   : 1
    <444>   DW_AT_type        : <0x3c>
    <448>   DW_AT_decl_file   : 7
    <449>   DW_AT_decl_line   : 192
    <44a>   DW_AT_decl_column : 1
    <44b>   DW_AT_sibling     : <0x45c>
 <2><44f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <450>   DW_AT_name        : (indirect string, offset: 0x67530): DISABLE
    <454>   DW_AT_const_value : 0
 <2><455>: Abbrev Number: 19 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0x747a7): ENABLE
    <45a>   DW_AT_const_value : 1
 <2><45b>: Abbrev Number: 0
 <1><45c>: Abbrev Number: 3 (DW_TAG_typedef)
    <45d>   DW_AT_name        : (indirect string, offset: 0xda4d5): FunctionalState
    <461>   DW_AT_decl_file   : 7
    <462>   DW_AT_decl_line   : 195
    <463>   DW_AT_decl_column : 3
    <464>   DW_AT_type        : <0x441>
 <1><468>: Abbrev Number: 2 (DW_TAG_base_type)
    <469>   DW_AT_byte_size   : 8
    <46a>   DW_AT_encoding    : 4	(float)
    <46b>   DW_AT_name        : (indirect string, offset: 0x282d3): long double
 <1><46f>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <470>   DW_AT_encoding    : 7	(unsigned)
    <471>   DW_AT_byte_size   : 1
    <472>   DW_AT_type        : <0x3c>
    <476>   DW_AT_decl_file   : 8
    <477>   DW_AT_decl_line   : 51
    <478>   DW_AT_decl_column : 1
    <479>   DW_AT_sibling     : <0x48a>
 <2><47d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <47e>   DW_AT_name        : (indirect string, offset: 0xa1d5a): HAL_UNLOCKED
    <482>   DW_AT_const_value : 0
 <2><483>: Abbrev Number: 19 (DW_TAG_enumerator)
    <484>   DW_AT_name        : (indirect string, offset: 0xdb4ab): HAL_LOCKED
    <488>   DW_AT_const_value : 1
 <2><489>: Abbrev Number: 0
 <1><48a>: Abbrev Number: 3 (DW_TAG_typedef)
    <48b>   DW_AT_name        : (indirect string, offset: 0x80dab): HAL_LockTypeDef
    <48f>   DW_AT_decl_file   : 8
    <490>   DW_AT_decl_line   : 54
    <491>   DW_AT_decl_column : 3
    <492>   DW_AT_type        : <0x46f>
 <1><496>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <497>   DW_AT_prototyped  : 1
 <1><497>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <498>   DW_AT_byte_size   : 4
    <499>   DW_AT_type        : <0x496>
 <1><49d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <49e>   DW_AT_byte_size   : 48
    <49f>   DW_AT_decl_file   : 9
    <4a0>   DW_AT_decl_line   : 49
    <4a1>   DW_AT_decl_column : 9
    <4a2>   DW_AT_sibling     : <0x543>
 <2><4a6>: Abbrev Number: 13 (DW_TAG_member)
    <4a7>   DW_AT_name        : (indirect string, offset: 0xe17f3): Channel
    <4ab>   DW_AT_decl_file   : 9
    <4ac>   DW_AT_decl_line   : 51
    <4ad>   DW_AT_decl_column : 12
    <4ae>   DW_AT_type        : <0xcd>
    <4b2>   DW_AT_data_member_location: 0
 <2><4b3>: Abbrev Number: 13 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x50fe2): Direction
    <4b8>   DW_AT_decl_file   : 9
    <4b9>   DW_AT_decl_line   : 54
    <4ba>   DW_AT_decl_column : 12
    <4bb>   DW_AT_type        : <0xcd>
    <4bf>   DW_AT_data_member_location: 4
 <2><4c0>: Abbrev Number: 13 (DW_TAG_member)
    <4c1>   DW_AT_name        : (indirect string, offset: 0xdf55): PeriphInc
    <4c5>   DW_AT_decl_file   : 9
    <4c6>   DW_AT_decl_line   : 58
    <4c7>   DW_AT_decl_column : 12
    <4c8>   DW_AT_type        : <0xcd>
    <4cc>   DW_AT_data_member_location: 8
 <2><4cd>: Abbrev Number: 13 (DW_TAG_member)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x22179): MemInc
    <4d2>   DW_AT_decl_file   : 9
    <4d3>   DW_AT_decl_line   : 61
    <4d4>   DW_AT_decl_column : 12
    <4d5>   DW_AT_type        : <0xcd>
    <4d9>   DW_AT_data_member_location: 12
 <2><4da>: Abbrev Number: 13 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0x6c667): PeriphDataAlignment
    <4df>   DW_AT_decl_file   : 9
    <4e0>   DW_AT_decl_line   : 64
    <4e1>   DW_AT_decl_column : 12
    <4e2>   DW_AT_type        : <0xcd>
    <4e6>   DW_AT_data_member_location: 16
 <2><4e7>: Abbrev Number: 13 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xc5d8a): MemDataAlignment
    <4ec>   DW_AT_decl_file   : 9
    <4ed>   DW_AT_decl_line   : 67
    <4ee>   DW_AT_decl_column : 12
    <4ef>   DW_AT_type        : <0xcd>
    <4f3>   DW_AT_data_member_location: 20
 <2><4f4>: Abbrev Number: 13 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0xe35de): Mode
    <4f9>   DW_AT_decl_file   : 9
    <4fa>   DW_AT_decl_line   : 70
    <4fb>   DW_AT_decl_column : 12
    <4fc>   DW_AT_type        : <0xcd>
    <500>   DW_AT_data_member_location: 24
 <2><501>: Abbrev Number: 13 (DW_TAG_member)
    <502>   DW_AT_name        : (indirect string, offset: 0xe2183): Priority
    <506>   DW_AT_decl_file   : 9
    <507>   DW_AT_decl_line   : 75
    <508>   DW_AT_decl_column : 12
    <509>   DW_AT_type        : <0xcd>
    <50d>   DW_AT_data_member_location: 28
 <2><50e>: Abbrev Number: 13 (DW_TAG_member)
    <50f>   DW_AT_name        : (indirect string, offset: 0x5dce2): FIFOMode
    <513>   DW_AT_decl_file   : 9
    <514>   DW_AT_decl_line   : 78
    <515>   DW_AT_decl_column : 12
    <516>   DW_AT_type        : <0xcd>
    <51a>   DW_AT_data_member_location: 32
 <2><51b>: Abbrev Number: 13 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0xa691e): FIFOThreshold
    <520>   DW_AT_decl_file   : 9
    <521>   DW_AT_decl_line   : 83
    <522>   DW_AT_decl_column : 12
    <523>   DW_AT_type        : <0xcd>
    <527>   DW_AT_data_member_location: 36
 <2><528>: Abbrev Number: 13 (DW_TAG_member)
    <529>   DW_AT_name        : (indirect string, offset: 0xa471f): MemBurst
    <52d>   DW_AT_decl_file   : 9
    <52e>   DW_AT_decl_line   : 86
    <52f>   DW_AT_decl_column : 12
    <530>   DW_AT_type        : <0xcd>
    <534>   DW_AT_data_member_location: 40
 <2><535>: Abbrev Number: 13 (DW_TAG_member)
    <536>   DW_AT_name        : (indirect string, offset: 0x4ad91): PeriphBurst
    <53a>   DW_AT_decl_file   : 9
    <53b>   DW_AT_decl_line   : 92
    <53c>   DW_AT_decl_column : 12
    <53d>   DW_AT_type        : <0xcd>
    <541>   DW_AT_data_member_location: 44
 <2><542>: Abbrev Number: 0
 <1><543>: Abbrev Number: 3 (DW_TAG_typedef)
    <544>   DW_AT_name        : (indirect string, offset: 0x3ae23): DMA_InitTypeDef
    <548>   DW_AT_decl_file   : 9
    <549>   DW_AT_decl_line   : 97
    <54a>   DW_AT_decl_column : 2
    <54b>   DW_AT_type        : <0x49d>
 <1><54f>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <550>   DW_AT_encoding    : 7	(unsigned)
    <551>   DW_AT_byte_size   : 1
    <552>   DW_AT_type        : <0x3c>
    <556>   DW_AT_decl_file   : 9
    <557>   DW_AT_decl_line   : 104
    <558>   DW_AT_decl_column : 1
    <559>   DW_AT_sibling     : <0x582>
 <2><55d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <55e>   DW_AT_name        : (indirect string, offset: 0xda79): HAL_DMA_STATE_RESET
    <562>   DW_AT_const_value : 0
 <2><563>: Abbrev Number: 19 (DW_TAG_enumerator)
    <564>   DW_AT_name        : (indirect string, offset: 0x3c2da): HAL_DMA_STATE_READY
    <568>   DW_AT_const_value : 1
 <2><569>: Abbrev Number: 19 (DW_TAG_enumerator)
    <56a>   DW_AT_name        : (indirect string, offset: 0x96cdb): HAL_DMA_STATE_BUSY
    <56e>   DW_AT_const_value : 2
 <2><56f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <570>   DW_AT_name        : (indirect string, offset: 0xd7d44): HAL_DMA_STATE_TIMEOUT
    <574>   DW_AT_const_value : 3
 <2><575>: Abbrev Number: 19 (DW_TAG_enumerator)
    <576>   DW_AT_name        : (indirect string, offset: 0xa6310): HAL_DMA_STATE_ERROR
    <57a>   DW_AT_const_value : 4
 <2><57b>: Abbrev Number: 19 (DW_TAG_enumerator)
    <57c>   DW_AT_name        : (indirect string, offset: 0x5522d): HAL_DMA_STATE_ABORT
    <580>   DW_AT_const_value : 5
 <2><581>: Abbrev Number: 0
 <1><582>: Abbrev Number: 3 (DW_TAG_typedef)
    <583>   DW_AT_name        : (indirect string, offset: 0x784b2): HAL_DMA_StateTypeDef
    <587>   DW_AT_decl_file   : 9
    <588>   DW_AT_decl_line   : 111
    <589>   DW_AT_decl_column : 2
    <58a>   DW_AT_type        : <0x54f>
 <1><58e>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <58f>   DW_AT_type        : <0x582>
 <1><593>: Abbrev Number: 22 (DW_TAG_structure_type)
    <594>   DW_AT_name        : (indirect string, offset: 0xba638): __DMA_HandleTypeDef
    <598>   DW_AT_byte_size   : 96
    <599>   DW_AT_decl_file   : 9
    <59a>   DW_AT_decl_line   : 139
    <59b>   DW_AT_decl_column : 16
    <59c>   DW_AT_sibling     : <0x657>
 <2><5a0>: Abbrev Number: 13 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0xd3e78): Instance
    <5a5>   DW_AT_decl_file   : 9
    <5a6>   DW_AT_decl_line   : 141
    <5a7>   DW_AT_decl_column : 31
    <5a8>   DW_AT_type        : <0x657>
    <5ac>   DW_AT_data_member_location: 0
 <2><5ad>: Abbrev Number: 13 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0xdcb92): Init
    <5b2>   DW_AT_decl_file   : 9
    <5b3>   DW_AT_decl_line   : 143
    <5b4>   DW_AT_decl_column : 30
    <5b5>   DW_AT_type        : <0x543>
    <5b9>   DW_AT_data_member_location: 4
 <2><5ba>: Abbrev Number: 13 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x9b9a0): Lock
    <5bf>   DW_AT_decl_file   : 9
    <5c0>   DW_AT_decl_line   : 145
    <5c1>   DW_AT_decl_column : 30
    <5c2>   DW_AT_type        : <0x48a>
    <5c6>   DW_AT_data_member_location: 52
 <2><5c7>: Abbrev Number: 13 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0xdd7e3): State
    <5cc>   DW_AT_decl_file   : 9
    <5cd>   DW_AT_decl_line   : 147
    <5ce>   DW_AT_decl_column : 30
    <5cf>   DW_AT_type        : <0x58e>
    <5d3>   DW_AT_data_member_location: 53
 <2><5d4>: Abbrev Number: 13 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0xd04d7): Parent
    <5d9>   DW_AT_decl_file   : 9
    <5da>   DW_AT_decl_line   : 149
    <5db>   DW_AT_decl_column : 31
    <5dc>   DW_AT_type        : <0x65d>
    <5e0>   DW_AT_data_member_location: 56
 <2><5e1>: Abbrev Number: 13 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0xda795): XferCpltCallback
    <5e6>   DW_AT_decl_file   : 9
    <5e7>   DW_AT_decl_line   : 151
    <5e8>   DW_AT_decl_column : 33
    <5e9>   DW_AT_type        : <0x670>
    <5ed>   DW_AT_data_member_location: 60
 <2><5ee>: Abbrev Number: 13 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0xaa4a2): XferHalfCpltCallback
    <5f3>   DW_AT_decl_file   : 9
    <5f4>   DW_AT_decl_line   : 153
    <5f5>   DW_AT_decl_column : 33
    <5f6>   DW_AT_type        : <0x670>
    <5fa>   DW_AT_data_member_location: 64
 <2><5fb>: Abbrev Number: 13 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x8028d): XferM1CpltCallback
    <600>   DW_AT_decl_file   : 9
    <601>   DW_AT_decl_line   : 155
    <602>   DW_AT_decl_column : 33
    <603>   DW_AT_type        : <0x670>
    <607>   DW_AT_data_member_location: 68
 <2><608>: Abbrev Number: 13 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x68f8b): XferM1HalfCpltCallback
    <60d>   DW_AT_decl_file   : 9
    <60e>   DW_AT_decl_line   : 157
    <60f>   DW_AT_decl_column : 33
    <610>   DW_AT_type        : <0x670>
    <614>   DW_AT_data_member_location: 72
 <2><615>: Abbrev Number: 13 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x1f4d1): XferErrorCallback
    <61a>   DW_AT_decl_file   : 9
    <61b>   DW_AT_decl_line   : 159
    <61c>   DW_AT_decl_column : 33
    <61d>   DW_AT_type        : <0x670>
    <621>   DW_AT_data_member_location: 76
 <2><622>: Abbrev Number: 13 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0xcc59f): XferAbortCallback
    <627>   DW_AT_decl_file   : 9
    <628>   DW_AT_decl_line   : 161
    <629>   DW_AT_decl_column : 33
    <62a>   DW_AT_type        : <0x670>
    <62e>   DW_AT_data_member_location: 80
 <2><62f>: Abbrev Number: 13 (DW_TAG_member)
    <630>   DW_AT_name        : (indirect string, offset: 0xd6428): ErrorCode
    <634>   DW_AT_decl_file   : 9
    <635>   DW_AT_decl_line   : 163
    <636>   DW_AT_decl_column : 30
    <637>   DW_AT_type        : <0xd9>
    <63b>   DW_AT_data_member_location: 84
 <2><63c>: Abbrev Number: 13 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x61521): StreamBaseAddress
    <641>   DW_AT_decl_file   : 9
    <642>   DW_AT_decl_line   : 165
    <643>   DW_AT_decl_column : 30
    <644>   DW_AT_type        : <0xcd>
    <648>   DW_AT_data_member_location: 88
 <2><649>: Abbrev Number: 13 (DW_TAG_member)
    <64a>   DW_AT_name        : (indirect string, offset: 0xb8231): StreamIndex
    <64e>   DW_AT_decl_file   : 9
    <64f>   DW_AT_decl_line   : 167
    <650>   DW_AT_decl_column : 30
    <651>   DW_AT_type        : <0xcd>
    <655>   DW_AT_data_member_location: 92
 <2><656>: Abbrev Number: 0
 <1><657>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <658>   DW_AT_byte_size   : 4
    <659>   DW_AT_type        : <0x389>
 <1><65d>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <65e>   DW_AT_byte_size   : 4
 <1><65f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <660>   DW_AT_prototyped  : 1
    <660>   DW_AT_sibling     : <0x66a>
 <2><664>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <665>   DW_AT_type        : <0x66a>
 <2><669>: Abbrev Number: 0
 <1><66a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <66b>   DW_AT_byte_size   : 4
    <66c>   DW_AT_type        : <0x593>
 <1><670>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <671>   DW_AT_byte_size   : 4
    <672>   DW_AT_type        : <0x65f>
 <1><676>: Abbrev Number: 3 (DW_TAG_typedef)
    <677>   DW_AT_name        : (indirect string, offset: 0xba63a): DMA_HandleTypeDef
    <67b>   DW_AT_decl_file   : 9
    <67c>   DW_AT_decl_line   : 169
    <67d>   DW_AT_decl_column : 2
    <67e>   DW_AT_type        : <0x593>
 <1><682>: Abbrev Number: 11 (DW_TAG_structure_type)
    <683>   DW_AT_byte_size   : 48
    <684>   DW_AT_decl_file   : 10
    <685>   DW_AT_decl_line   : 60
    <686>   DW_AT_decl_column : 9
    <687>   DW_AT_sibling     : <0x728>
 <2><68b>: Abbrev Number: 13 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0xc143a): ClockPrescaler
    <690>   DW_AT_decl_file   : 10
    <691>   DW_AT_decl_line   : 62
    <692>   DW_AT_decl_column : 12
    <693>   DW_AT_type        : <0xcd>
    <697>   DW_AT_data_member_location: 0
 <2><698>: Abbrev Number: 13 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0x110b6): Resolution
    <69d>   DW_AT_decl_file   : 10
    <69e>   DW_AT_decl_line   : 65
    <69f>   DW_AT_decl_column : 12
    <6a0>   DW_AT_type        : <0xcd>
    <6a4>   DW_AT_data_member_location: 4
 <2><6a5>: Abbrev Number: 13 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x2fedc): DataAlign
    <6aa>   DW_AT_decl_file   : 10
    <6ab>   DW_AT_decl_line   : 67
    <6ac>   DW_AT_decl_column : 12
    <6ad>   DW_AT_type        : <0xcd>
    <6b1>   DW_AT_data_member_location: 8
 <2><6b2>: Abbrev Number: 13 (DW_TAG_member)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x83803): ScanConvMode
    <6b7>   DW_AT_decl_file   : 10
    <6b8>   DW_AT_decl_line   : 70
    <6b9>   DW_AT_decl_column : 12
    <6ba>   DW_AT_type        : <0xcd>
    <6be>   DW_AT_data_member_location: 12
 <2><6bf>: Abbrev Number: 13 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x7c2e): EOCSelection
    <6c4>   DW_AT_decl_file   : 10
    <6c5>   DW_AT_decl_line   : 77
    <6c6>   DW_AT_decl_column : 12
    <6c7>   DW_AT_type        : <0xcd>
    <6cb>   DW_AT_data_member_location: 16
 <2><6cc>: Abbrev Number: 13 (DW_TAG_member)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x5b328): ContinuousConvMode
    <6d1>   DW_AT_decl_file   : 10
    <6d2>   DW_AT_decl_line   : 84
    <6d3>   DW_AT_decl_column : 19
    <6d4>   DW_AT_type        : <0x45c>
    <6d8>   DW_AT_data_member_location: 20
 <2><6d9>: Abbrev Number: 13 (DW_TAG_member)
    <6da>   DW_AT_name        : (indirect string, offset: 0xe183c): NbrOfConversion
    <6de>   DW_AT_decl_file   : 10
    <6df>   DW_AT_decl_line   : 87
    <6e0>   DW_AT_decl_column : 12
    <6e1>   DW_AT_type        : <0xcd>
    <6e5>   DW_AT_data_member_location: 24
 <2><6e6>: Abbrev Number: 13 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xe1929): DiscontinuousConvMode
    <6eb>   DW_AT_decl_file   : 10
    <6ec>   DW_AT_decl_line   : 90
    <6ed>   DW_AT_decl_column : 19
    <6ee>   DW_AT_type        : <0x45c>
    <6f2>   DW_AT_data_member_location: 28
 <2><6f3>: Abbrev Number: 13 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0x1f2ff): NbrOfDiscConversion
    <6f8>   DW_AT_decl_file   : 10
    <6f9>   DW_AT_decl_line   : 94
    <6fa>   DW_AT_decl_column : 12
    <6fb>   DW_AT_type        : <0xcd>
    <6ff>   DW_AT_data_member_location: 32
 <2><700>: Abbrev Number: 13 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0x9798d): ExternalTrigConv
    <705>   DW_AT_decl_file   : 10
    <706>   DW_AT_decl_line   : 97
    <707>   DW_AT_decl_column : 12
    <708>   DW_AT_type        : <0xcd>
    <70c>   DW_AT_data_member_location: 36
 <2><70d>: Abbrev Number: 13 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x3bdbb): ExternalTrigConvEdge
    <712>   DW_AT_decl_file   : 10
    <713>   DW_AT_decl_line   : 101
    <714>   DW_AT_decl_column : 12
    <715>   DW_AT_type        : <0xcd>
    <719>   DW_AT_data_member_location: 40
 <2><71a>: Abbrev Number: 13 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0x9a392): DMAContinuousRequests
    <71f>   DW_AT_decl_file   : 10
    <720>   DW_AT_decl_line   : 104
    <721>   DW_AT_decl_column : 19
    <722>   DW_AT_type        : <0x45c>
    <726>   DW_AT_data_member_location: 44
 <2><727>: Abbrev Number: 0
 <1><728>: Abbrev Number: 3 (DW_TAG_typedef)
    <729>   DW_AT_name        : (indirect string, offset: 0x29e4c): ADC_InitTypeDef
    <72d>   DW_AT_decl_file   : 10
    <72e>   DW_AT_decl_line   : 109
    <72f>   DW_AT_decl_column : 2
    <730>   DW_AT_type        : <0x682>
 <1><734>: Abbrev Number: 11 (DW_TAG_structure_type)
    <735>   DW_AT_byte_size   : 72
    <736>   DW_AT_decl_file   : 10
    <737>   DW_AT_decl_line   : 196
    <738>   DW_AT_decl_column : 9
    <739>   DW_AT_sibling     : <0x799>
 <2><73d>: Abbrev Number: 13 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0xd3e78): Instance
    <742>   DW_AT_decl_file   : 10
    <743>   DW_AT_decl_line   : 199
    <744>   DW_AT_decl_column : 34
    <745>   DW_AT_type        : <0x799>
    <749>   DW_AT_data_member_location: 0
 <2><74a>: Abbrev Number: 13 (DW_TAG_member)
    <74b>   DW_AT_name        : (indirect string, offset: 0xdcb92): Init
    <74f>   DW_AT_decl_file   : 10
    <750>   DW_AT_decl_line   : 201
    <751>   DW_AT_decl_column : 33
    <752>   DW_AT_type        : <0x728>
    <756>   DW_AT_data_member_location: 4
 <2><757>: Abbrev Number: 13 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x389f8): NbrOfCurrentConversionRank
    <75c>   DW_AT_decl_file   : 10
    <75d>   DW_AT_decl_line   : 203
    <75e>   DW_AT_decl_column : 33
    <75f>   DW_AT_type        : <0xd9>
    <763>   DW_AT_data_member_location: 52
 <2><764>: Abbrev Number: 13 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0x780ea): DMA_Handle
    <769>   DW_AT_decl_file   : 10
    <76a>   DW_AT_decl_line   : 205
    <76b>   DW_AT_decl_column : 34
    <76c>   DW_AT_type        : <0x79f>
    <770>   DW_AT_data_member_location: 56
 <2><771>: Abbrev Number: 13 (DW_TAG_member)
    <772>   DW_AT_name        : (indirect string, offset: 0x9b9a0): Lock
    <776>   DW_AT_decl_file   : 10
    <777>   DW_AT_decl_line   : 207
    <778>   DW_AT_decl_column : 33
    <779>   DW_AT_type        : <0x48a>
    <77d>   DW_AT_data_member_location: 60
 <2><77e>: Abbrev Number: 13 (DW_TAG_member)
    <77f>   DW_AT_name        : (indirect string, offset: 0xdd7e3): State
    <783>   DW_AT_decl_file   : 10
    <784>   DW_AT_decl_line   : 209
    <785>   DW_AT_decl_column : 33
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 64
 <2><78b>: Abbrev Number: 13 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0xd6428): ErrorCode
    <790>   DW_AT_decl_file   : 10
    <791>   DW_AT_decl_line   : 211
    <792>   DW_AT_decl_column : 33
    <793>   DW_AT_type        : <0xd9>
    <797>   DW_AT_data_member_location: 68
 <2><798>: Abbrev Number: 0
 <1><799>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <79a>   DW_AT_byte_size   : 4
    <79b>   DW_AT_type        : <0x245>
 <1><79f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <7a0>   DW_AT_byte_size   : 4
    <7a1>   DW_AT_type        : <0x676>
 <1><7a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x2be46): ADC_HandleTypeDef
    <7aa>   DW_AT_decl_file   : 10
    <7ab>   DW_AT_decl_line   : 221
    <7ac>   DW_AT_decl_column : 2
    <7ad>   DW_AT_type        : <0x734>
 <1><7b1>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <7b2>   DW_AT_encoding    : 7	(unsigned)
    <7b3>   DW_AT_byte_size   : 1
    <7b4>   DW_AT_type        : <0x3c>
    <7b8>   DW_AT_decl_file   : 11
    <7b9>   DW_AT_decl_line   : 51
    <7ba>   DW_AT_decl_column : 1
    <7bb>   DW_AT_sibling     : <0x7de>
 <2><7bf>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x1ee19): HAL_DAC_STATE_RESET
    <7c4>   DW_AT_const_value : 0
 <2><7c5>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x103a6): HAL_DAC_STATE_READY
    <7ca>   DW_AT_const_value : 1
 <2><7cb>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7cc>   DW_AT_name        : (indirect string, offset: 0xa0824): HAL_DAC_STATE_BUSY
    <7d0>   DW_AT_const_value : 2
 <2><7d1>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7d2>   DW_AT_name        : (indirect string, offset: 0xc5fb7): HAL_DAC_STATE_TIMEOUT
    <7d6>   DW_AT_const_value : 3
 <2><7d7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x371ff): HAL_DAC_STATE_ERROR
    <7dc>   DW_AT_const_value : 4
 <2><7dd>: Abbrev Number: 0
 <1><7de>: Abbrev Number: 3 (DW_TAG_typedef)
    <7df>   DW_AT_name        : (indirect string, offset: 0xa3530): HAL_DAC_StateTypeDef
    <7e3>   DW_AT_decl_file   : 11
    <7e4>   DW_AT_decl_line   : 58
    <7e5>   DW_AT_decl_column : 3
    <7e6>   DW_AT_type        : <0x7b1>
 <1><7ea>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <7eb>   DW_AT_type        : <0x7de>
 <1><7ef>: Abbrev Number: 11 (DW_TAG_structure_type)
    <7f0>   DW_AT_byte_size   : 20
    <7f1>   DW_AT_decl_file   : 11
    <7f2>   DW_AT_decl_line   : 66
    <7f3>   DW_AT_decl_column : 9
    <7f4>   DW_AT_sibling     : <0x847>
 <2><7f8>: Abbrev Number: 13 (DW_TAG_member)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xd3e78): Instance
    <7fd>   DW_AT_decl_file   : 11
    <7fe>   DW_AT_decl_line   : 69
    <7ff>   DW_AT_decl_column : 32
    <800>   DW_AT_type        : <0x847>
    <804>   DW_AT_data_member_location: 0
 <2><805>: Abbrev Number: 13 (DW_TAG_member)
    <806>   DW_AT_name        : (indirect string, offset: 0xdd7e3): State
    <80a>   DW_AT_decl_file   : 11
    <80b>   DW_AT_decl_line   : 71
    <80c>   DW_AT_decl_column : 31
    <80d>   DW_AT_type        : <0x7ea>
    <811>   DW_AT_data_member_location: 4
 <2><812>: Abbrev Number: 13 (DW_TAG_member)
    <813>   DW_AT_name        : (indirect string, offset: 0x9b9a0): Lock
    <817>   DW_AT_decl_file   : 11
    <818>   DW_AT_decl_line   : 73
    <819>   DW_AT_decl_column : 31
    <81a>   DW_AT_type        : <0x48a>
    <81e>   DW_AT_data_member_location: 5
 <2><81f>: Abbrev Number: 13 (DW_TAG_member)
    <820>   DW_AT_name        : (indirect string, offset: 0x642ec): DMA_Handle1
    <824>   DW_AT_decl_file   : 11
    <825>   DW_AT_decl_line   : 75
    <826>   DW_AT_decl_column : 32
    <827>   DW_AT_type        : <0x79f>
    <82b>   DW_AT_data_member_location: 8
 <2><82c>: Abbrev Number: 13 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x642f8): DMA_Handle2
    <831>   DW_AT_decl_file   : 11
    <832>   DW_AT_decl_line   : 77
    <833>   DW_AT_decl_column : 32
    <834>   DW_AT_type        : <0x79f>
    <838>   DW_AT_data_member_location: 12
 <2><839>: Abbrev Number: 13 (DW_TAG_member)
    <83a>   DW_AT_name        : (indirect string, offset: 0xd6428): ErrorCode
    <83e>   DW_AT_decl_file   : 11
    <83f>   DW_AT_decl_line   : 79
    <840>   DW_AT_decl_column : 31
    <841>   DW_AT_type        : <0xd9>
    <845>   DW_AT_data_member_location: 16
 <2><846>: Abbrev Number: 0
 <1><847>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <848>   DW_AT_byte_size   : 4
    <849>   DW_AT_type        : <0x31e>
 <1><84d>: Abbrev Number: 3 (DW_TAG_typedef)
    <84e>   DW_AT_name        : (indirect string, offset: 0x7754d): DAC_HandleTypeDef
    <852>   DW_AT_decl_file   : 11
    <853>   DW_AT_decl_line   : 97
    <854>   DW_AT_decl_column : 3
    <855>   DW_AT_type        : <0x7ef>
 <1><859>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <85a>   DW_AT_encoding    : 7	(unsigned)
    <85b>   DW_AT_byte_size   : 1
    <85c>   DW_AT_type        : <0x3c>
    <860>   DW_AT_decl_file   : 12
    <861>   DW_AT_decl_line   : 51
    <862>   DW_AT_decl_column : 1
    <863>   DW_AT_sibling     : <0x880>
 <2><867>: Abbrev Number: 19 (DW_TAG_enumerator)
    <868>   DW_AT_name        : (indirect string, offset: 0x6fe37): HAL_TICK_FREQ_10HZ
    <86c>   DW_AT_const_value : 100
 <2><86d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <86e>   DW_AT_name        : (indirect string, offset: 0x50f48): HAL_TICK_FREQ_100HZ
    <872>   DW_AT_const_value : 10
 <2><873>: Abbrev Number: 19 (DW_TAG_enumerator)
    <874>   DW_AT_name        : (indirect string, offset: 0x65ba8): HAL_TICK_FREQ_1KHZ
    <878>   DW_AT_const_value : 1
 <2><879>: Abbrev Number: 19 (DW_TAG_enumerator)
    <87a>   DW_AT_name        : (indirect string, offset: 0x4e9e9): HAL_TICK_FREQ_DEFAULT
    <87e>   DW_AT_const_value : 1
 <2><87f>: Abbrev Number: 0
 <1><880>: Abbrev Number: 3 (DW_TAG_typedef)
    <881>   DW_AT_name        : (indirect string, offset: 0xac9e3): HAL_TickFreqTypeDef
    <885>   DW_AT_decl_file   : 12
    <886>   DW_AT_decl_line   : 56
    <887>   DW_AT_decl_column : 3
    <888>   DW_AT_type        : <0x859>
 <1><88c>: Abbrev Number: 8 (DW_TAG_variable)
    <88d>   DW_AT_name        : (indirect string, offset: 0x32bc2): uwTick
    <891>   DW_AT_decl_file   : 12
    <892>   DW_AT_decl_line   : 205
    <893>   DW_AT_decl_column : 22
    <894>   DW_AT_type        : <0xd9>
    <898>   DW_AT_external    : 1
    <898>   DW_AT_declaration : 1
 <1><898>: Abbrev Number: 8 (DW_TAG_variable)
    <899>   DW_AT_name        : (indirect string, offset: 0x8bbdc): uwTickPrio
    <89d>   DW_AT_decl_file   : 12
    <89e>   DW_AT_decl_line   : 206
    <89f>   DW_AT_decl_column : 17
    <8a0>   DW_AT_type        : <0xcd>
    <8a4>   DW_AT_external    : 1
    <8a4>   DW_AT_declaration : 1
 <1><8a4>: Abbrev Number: 8 (DW_TAG_variable)
    <8a5>   DW_AT_name        : (indirect string, offset: 0xce55a): uwTickFreq
    <8a9>   DW_AT_decl_file   : 12
    <8aa>   DW_AT_decl_line   : 207
    <8ab>   DW_AT_decl_column : 28
    <8ac>   DW_AT_type        : <0x880>
    <8b0>   DW_AT_external    : 1
    <8b0>   DW_AT_declaration : 1
 <1><8b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xdc4b3): BaseType_t
    <8b5>   DW_AT_decl_file   : 13
    <8b6>   DW_AT_decl_line   : 56
    <8b7>   DW_AT_decl_column : 14
    <8b8>   DW_AT_type        : <0x69>
 <1><8bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x2a72e): TickType_t
    <8c1>   DW_AT_decl_file   : 13
    <8c2>   DW_AT_decl_line   : 63
    <8c3>   DW_AT_decl_column : 19
    <8c4>   DW_AT_type        : <0xcd>
 <1><8c8>: Abbrev Number: 17 (DW_TAG_typedef)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x389b8): wint_t
    <8cd>   DW_AT_decl_file   : 14
    <8ce>   DW_AT_decl_line   : 350
    <8d0>   DW_AT_decl_column : 23
    <8d1>   DW_AT_type        : <0x98>
 <1><8d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xc6ae8): _off_t
    <8da>   DW_AT_decl_file   : 15
    <8db>   DW_AT_decl_line   : 46
    <8dc>   DW_AT_decl_column : 14
    <8dd>   DW_AT_type        : <0x69>
 <1><8e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x30b11): _fpos_t
    <8e6>   DW_AT_decl_file   : 15
    <8e7>   DW_AT_decl_line   : 116
    <8e8>   DW_AT_decl_column : 14
    <8e9>   DW_AT_type        : <0x69>
 <1><8ed>: Abbrev Number: 26 (DW_TAG_union_type)
    <8ee>   DW_AT_byte_size   : 4
    <8ef>   DW_AT_decl_file   : 15
    <8f0>   DW_AT_decl_line   : 165
    <8f1>   DW_AT_decl_column : 3
    <8f2>   DW_AT_sibling     : <0x90f>
 <2><8f6>: Abbrev Number: 27 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xa7b4f): __wch
    <8fb>   DW_AT_decl_file   : 15
    <8fc>   DW_AT_decl_line   : 167
    <8fd>   DW_AT_decl_column : 12
    <8fe>   DW_AT_type        : <0x8c8>
 <2><902>: Abbrev Number: 27 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0x703cf): __wchb
    <907>   DW_AT_decl_file   : 15
    <908>   DW_AT_decl_line   : 168
    <909>   DW_AT_decl_column : 19
    <90a>   DW_AT_type        : <0x90f>
 <2><90e>: Abbrev Number: 0
 <1><90f>: Abbrev Number: 9 (DW_TAG_array_type)
    <910>   DW_AT_type        : <0x3c>
    <914>   DW_AT_sibling     : <0x91f>
 <2><918>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <919>   DW_AT_type        : <0x98>
    <91d>   DW_AT_upper_bound : 3
 <2><91e>: Abbrev Number: 0
 <1><91f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <920>   DW_AT_byte_size   : 8
    <921>   DW_AT_decl_file   : 15
    <922>   DW_AT_decl_line   : 162
    <923>   DW_AT_decl_column : 9
    <924>   DW_AT_sibling     : <0x943>
 <2><928>: Abbrev Number: 13 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0x3d83f): __count
    <92d>   DW_AT_decl_file   : 15
    <92e>   DW_AT_decl_line   : 164
    <92f>   DW_AT_decl_column : 7
    <930>   DW_AT_type        : <0x91>
    <934>   DW_AT_data_member_location: 0
 <2><935>: Abbrev Number: 13 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0x7ccd1): __value
    <93a>   DW_AT_decl_file   : 15
    <93b>   DW_AT_decl_line   : 169
    <93c>   DW_AT_decl_column : 5
    <93d>   DW_AT_type        : <0x8ed>
    <941>   DW_AT_data_member_location: 4
 <2><942>: Abbrev Number: 0
 <1><943>: Abbrev Number: 3 (DW_TAG_typedef)
    <944>   DW_AT_name        : (indirect string, offset: 0x720cf): _mbstate_t
    <948>   DW_AT_decl_file   : 15
    <949>   DW_AT_decl_line   : 170
    <94a>   DW_AT_decl_column : 3
    <94b>   DW_AT_type        : <0x91f>
 <1><94f>: Abbrev Number: 3 (DW_TAG_typedef)
    <950>   DW_AT_name        : (indirect string, offset: 0x7601f): __ULong
    <954>   DW_AT_decl_file   : 16
    <955>   DW_AT_decl_line   : 22
    <956>   DW_AT_decl_column : 25
    <957>   DW_AT_type        : <0x7c>
 <1><95b>: Abbrev Number: 3 (DW_TAG_typedef)
    <95c>   DW_AT_name        : (indirect string, offset: 0x78bd4): _LOCK_T
    <960>   DW_AT_decl_file   : 17
    <961>   DW_AT_decl_line   : 34
    <962>   DW_AT_decl_column : 25
    <963>   DW_AT_type        : <0x967>
 <1><967>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <968>   DW_AT_byte_size   : 4
    <969>   DW_AT_type        : <0x96d>
 <1><96d>: Abbrev Number: 28 (DW_TAG_structure_type)
    <96e>   DW_AT_name        : (indirect string, offset: 0x1be46): __lock
    <972>   DW_AT_declaration : 1
 <1><972>: Abbrev Number: 3 (DW_TAG_typedef)
    <973>   DW_AT_name        : (indirect string, offset: 0x6b965): _flock_t
    <977>   DW_AT_decl_file   : 16
    <978>   DW_AT_decl_line   : 35
    <979>   DW_AT_decl_column : 27
    <97a>   DW_AT_type        : <0x95b>
 <1><97e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <97f>   DW_AT_name        : (indirect string, offset: 0x4c3ff): _Bigint
    <983>   DW_AT_byte_size   : 24
    <984>   DW_AT_decl_file   : 16
    <985>   DW_AT_decl_line   : 52
    <986>   DW_AT_decl_column : 8
    <987>   DW_AT_sibling     : <0x9d8>
 <2><98b>: Abbrev Number: 13 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x81e32): _next
    <990>   DW_AT_decl_file   : 16
    <991>   DW_AT_decl_line   : 54
    <992>   DW_AT_decl_column : 19
    <993>   DW_AT_type        : <0x9d8>
    <997>   DW_AT_data_member_location: 0
 <2><998>: Abbrev Number: 12 (DW_TAG_member)
    <999>   DW_AT_name        : _k
    <99c>   DW_AT_decl_file   : 16
    <99d>   DW_AT_decl_line   : 55
    <99e>   DW_AT_decl_column : 7
    <99f>   DW_AT_type        : <0x91>
    <9a3>   DW_AT_data_member_location: 4
 <2><9a4>: Abbrev Number: 13 (DW_TAG_member)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x9c676): _maxwds
    <9a9>   DW_AT_decl_file   : 16
    <9aa>   DW_AT_decl_line   : 55
    <9ab>   DW_AT_decl_column : 11
    <9ac>   DW_AT_type        : <0x91>
    <9b0>   DW_AT_data_member_location: 8
 <2><9b1>: Abbrev Number: 13 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x740a6): _sign
    <9b6>   DW_AT_decl_file   : 16
    <9b7>   DW_AT_decl_line   : 55
    <9b8>   DW_AT_decl_column : 20
    <9b9>   DW_AT_type        : <0x91>
    <9bd>   DW_AT_data_member_location: 12
 <2><9be>: Abbrev Number: 13 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x73ac5): _wds
    <9c3>   DW_AT_decl_file   : 16
    <9c4>   DW_AT_decl_line   : 55
    <9c5>   DW_AT_decl_column : 27
    <9c6>   DW_AT_type        : <0x91>
    <9ca>   DW_AT_data_member_location: 16
 <2><9cb>: Abbrev Number: 12 (DW_TAG_member)
    <9cc>   DW_AT_name        : _x
    <9cf>   DW_AT_decl_file   : 16
    <9d0>   DW_AT_decl_line   : 56
    <9d1>   DW_AT_decl_column : 11
    <9d2>   DW_AT_type        : <0x9de>
    <9d6>   DW_AT_data_member_location: 20
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <9d9>   DW_AT_byte_size   : 4
    <9da>   DW_AT_type        : <0x97e>
 <1><9de>: Abbrev Number: 9 (DW_TAG_array_type)
    <9df>   DW_AT_type        : <0x94f>
    <9e3>   DW_AT_sibling     : <0x9ee>
 <2><9e7>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9e8>   DW_AT_type        : <0x98>
    <9ec>   DW_AT_upper_bound : 0
 <2><9ed>: Abbrev Number: 0
 <1><9ee>: Abbrev Number: 22 (DW_TAG_structure_type)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x772d4): __tm
    <9f3>   DW_AT_byte_size   : 36
    <9f4>   DW_AT_decl_file   : 16
    <9f5>   DW_AT_decl_line   : 60
    <9f6>   DW_AT_decl_column : 8
    <9f7>   DW_AT_sibling     : <0xa71>
 <2><9fb>: Abbrev Number: 13 (DW_TAG_member)
    <9fc>   DW_AT_name        : (indirect string, offset: 0xb3482): __tm_sec
    <a00>   DW_AT_decl_file   : 16
    <a01>   DW_AT_decl_line   : 62
    <a02>   DW_AT_decl_column : 9
    <a03>   DW_AT_type        : <0x91>
    <a07>   DW_AT_data_member_location: 0
 <2><a08>: Abbrev Number: 13 (DW_TAG_member)
    <a09>   DW_AT_name        : (indirect string, offset: 0xe02): __tm_min
    <a0d>   DW_AT_decl_file   : 16
    <a0e>   DW_AT_decl_line   : 63
    <a0f>   DW_AT_decl_column : 9
    <a10>   DW_AT_type        : <0x91>
    <a14>   DW_AT_data_member_location: 4
 <2><a15>: Abbrev Number: 13 (DW_TAG_member)
    <a16>   DW_AT_name        : (indirect string, offset: 0x2eb75): __tm_hour
    <a1a>   DW_AT_decl_file   : 16
    <a1b>   DW_AT_decl_line   : 64
    <a1c>   DW_AT_decl_column : 9
    <a1d>   DW_AT_type        : <0x91>
    <a21>   DW_AT_data_member_location: 8
 <2><a22>: Abbrev Number: 13 (DW_TAG_member)
    <a23>   DW_AT_name        : (indirect string, offset: 0x7fb8e): __tm_mday
    <a27>   DW_AT_decl_file   : 16
    <a28>   DW_AT_decl_line   : 65
    <a29>   DW_AT_decl_column : 9
    <a2a>   DW_AT_type        : <0x91>
    <a2e>   DW_AT_data_member_location: 12
 <2><a2f>: Abbrev Number: 13 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0x3a6b): __tm_mon
    <a34>   DW_AT_decl_file   : 16
    <a35>   DW_AT_decl_line   : 66
    <a36>   DW_AT_decl_column : 9
    <a37>   DW_AT_type        : <0x91>
    <a3b>   DW_AT_data_member_location: 16
 <2><a3c>: Abbrev Number: 13 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xcbb9b): __tm_year
    <a41>   DW_AT_decl_file   : 16
    <a42>   DW_AT_decl_line   : 67
    <a43>   DW_AT_decl_column : 9
    <a44>   DW_AT_type        : <0x91>
    <a48>   DW_AT_data_member_location: 20
 <2><a49>: Abbrev Number: 13 (DW_TAG_member)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x5bd2f): __tm_wday
    <a4e>   DW_AT_decl_file   : 16
    <a4f>   DW_AT_decl_line   : 68
    <a50>   DW_AT_decl_column : 9
    <a51>   DW_AT_type        : <0x91>
    <a55>   DW_AT_data_member_location: 24
 <2><a56>: Abbrev Number: 13 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0xad4f7): __tm_yday
    <a5b>   DW_AT_decl_file   : 16
    <a5c>   DW_AT_decl_line   : 69
    <a5d>   DW_AT_decl_column : 9
    <a5e>   DW_AT_type        : <0x91>
    <a62>   DW_AT_data_member_location: 28
 <2><a63>: Abbrev Number: 13 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xc5054): __tm_isdst
    <a68>   DW_AT_decl_file   : 16
    <a69>   DW_AT_decl_line   : 70
    <a6a>   DW_AT_decl_column : 9
    <a6b>   DW_AT_type        : <0x91>
    <a6f>   DW_AT_data_member_location: 32
 <2><a70>: Abbrev Number: 0
 <1><a71>: Abbrev Number: 29 (DW_TAG_structure_type)
    <a72>   DW_AT_name        : (indirect string, offset: 0x80d35): _on_exit_args
    <a76>   DW_AT_byte_size   : 264
    <a78>   DW_AT_decl_file   : 16
    <a79>   DW_AT_decl_line   : 79
    <a7a>   DW_AT_decl_column : 8
    <a7b>   DW_AT_sibling     : <0xab6>
 <2><a7f>: Abbrev Number: 13 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0xc2cbf): _fnargs
    <a84>   DW_AT_decl_file   : 16
    <a85>   DW_AT_decl_line   : 80
    <a86>   DW_AT_decl_column : 10
    <a87>   DW_AT_type        : <0xab6>
    <a8b>   DW_AT_data_member_location: 0
 <2><a8c>: Abbrev Number: 13 (DW_TAG_member)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xb6f12): _dso_handle
    <a91>   DW_AT_decl_file   : 16
    <a92>   DW_AT_decl_line   : 81
    <a93>   DW_AT_decl_column : 9
    <a94>   DW_AT_type        : <0xab6>
    <a98>   DW_AT_data_member_location: 128
 <2><a99>: Abbrev Number: 30 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x980a9): _fntypes
    <a9e>   DW_AT_decl_file   : 16
    <a9f>   DW_AT_decl_line   : 83
    <aa0>   DW_AT_decl_column : 10
    <aa1>   DW_AT_type        : <0x94f>
    <aa5>   DW_AT_data_member_location: 256
 <2><aa7>: Abbrev Number: 30 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x59bef): _is_cxa
    <aac>   DW_AT_decl_file   : 16
    <aad>   DW_AT_decl_line   : 86
    <aae>   DW_AT_decl_column : 10
    <aaf>   DW_AT_type        : <0x94f>
    <ab3>   DW_AT_data_member_location: 260
 <2><ab5>: Abbrev Number: 0
 <1><ab6>: Abbrev Number: 9 (DW_TAG_array_type)
    <ab7>   DW_AT_type        : <0x65d>
    <abb>   DW_AT_sibling     : <0xac6>
 <2><abf>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ac0>   DW_AT_type        : <0x98>
    <ac4>   DW_AT_upper_bound : 31
 <2><ac5>: Abbrev Number: 0
 <1><ac6>: Abbrev Number: 22 (DW_TAG_structure_type)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x3dfa): _atexit
    <acb>   DW_AT_byte_size   : 140
    <acc>   DW_AT_decl_file   : 16
    <acd>   DW_AT_decl_line   : 90
    <ace>   DW_AT_decl_column : 8
    <acf>   DW_AT_sibling     : <0xb08>
 <2><ad3>: Abbrev Number: 13 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x81e32): _next
    <ad8>   DW_AT_decl_file   : 16
    <ad9>   DW_AT_decl_line   : 91
    <ada>   DW_AT_decl_column : 18
    <adb>   DW_AT_type        : <0xb08>
    <adf>   DW_AT_data_member_location: 0
 <2><ae0>: Abbrev Number: 13 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x8a261): _ind
    <ae5>   DW_AT_decl_file   : 16
    <ae6>   DW_AT_decl_line   : 92
    <ae7>   DW_AT_decl_column : 6
    <ae8>   DW_AT_type        : <0x91>
    <aec>   DW_AT_data_member_location: 4
 <2><aed>: Abbrev Number: 13 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x30803): _fns
    <af2>   DW_AT_decl_file   : 16
    <af3>   DW_AT_decl_line   : 93
    <af4>   DW_AT_decl_column : 9
    <af5>   DW_AT_type        : <0xb0e>
    <af9>   DW_AT_data_member_location: 8
 <2><afa>: Abbrev Number: 13 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0xb0349): _on_exit_args_ptr
    <aff>   DW_AT_decl_file   : 16
    <b00>   DW_AT_decl_line   : 94
    <b01>   DW_AT_decl_column : 32
    <b02>   DW_AT_type        : <0xb1e>
    <b06>   DW_AT_data_member_location: 136
 <2><b07>: Abbrev Number: 0
 <1><b08>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b09>   DW_AT_byte_size   : 4
    <b0a>   DW_AT_type        : <0xac6>
 <1><b0e>: Abbrev Number: 9 (DW_TAG_array_type)
    <b0f>   DW_AT_type        : <0x497>
    <b13>   DW_AT_sibling     : <0xb1e>
 <2><b17>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <b18>   DW_AT_type        : <0x98>
    <b1c>   DW_AT_upper_bound : 31
 <2><b1d>: Abbrev Number: 0
 <1><b1e>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b1f>   DW_AT_byte_size   : 4
    <b20>   DW_AT_type        : <0xa71>
 <1><b24>: Abbrev Number: 22 (DW_TAG_structure_type)
    <b25>   DW_AT_name        : (indirect string, offset: 0x918d1): __sbuf
    <b29>   DW_AT_byte_size   : 8
    <b2a>   DW_AT_decl_file   : 16
    <b2b>   DW_AT_decl_line   : 122
    <b2c>   DW_AT_decl_column : 8
    <b2d>   DW_AT_sibling     : <0xb4c>
 <2><b31>: Abbrev Number: 13 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0xda048): _base
    <b36>   DW_AT_decl_file   : 16
    <b37>   DW_AT_decl_line   : 123
    <b38>   DW_AT_decl_column : 17
    <b39>   DW_AT_type        : <0xb4c>
    <b3d>   DW_AT_data_member_location: 0
 <2><b3e>: Abbrev Number: 13 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x67866): _size
    <b43>   DW_AT_decl_file   : 16
    <b44>   DW_AT_decl_line   : 124
    <b45>   DW_AT_decl_column : 6
    <b46>   DW_AT_type        : <0x91>
    <b4a>   DW_AT_data_member_location: 4
 <2><b4b>: Abbrev Number: 0
 <1><b4c>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b4d>   DW_AT_byte_size   : 4
    <b4e>   DW_AT_type        : <0x3c>
 <1><b52>: Abbrev Number: 22 (DW_TAG_structure_type)
    <b53>   DW_AT_name        : (indirect string, offset: 0x28d1f): __sFILE_fake
    <b57>   DW_AT_byte_size   : 32
    <b58>   DW_AT_decl_file   : 16
    <b59>   DW_AT_decl_line   : 158
    <b5a>   DW_AT_decl_column : 8
    <b5b>   DW_AT_sibling     : <0xbc5>
 <2><b5f>: Abbrev Number: 12 (DW_TAG_member)
    <b60>   DW_AT_name        : _p
    <b63>   DW_AT_decl_file   : 16
    <b64>   DW_AT_decl_line   : 159
    <b65>   DW_AT_decl_column : 18
    <b66>   DW_AT_type        : <0xb4c>
    <b6a>   DW_AT_data_member_location: 0
 <2><b6b>: Abbrev Number: 12 (DW_TAG_member)
    <b6c>   DW_AT_name        : _r
    <b6f>   DW_AT_decl_file   : 16
    <b70>   DW_AT_decl_line   : 160
    <b71>   DW_AT_decl_column : 7
    <b72>   DW_AT_type        : <0x91>
    <b76>   DW_AT_data_member_location: 4
 <2><b77>: Abbrev Number: 12 (DW_TAG_member)
    <b78>   DW_AT_name        : _w
    <b7b>   DW_AT_decl_file   : 16
    <b7c>   DW_AT_decl_line   : 161
    <b7d>   DW_AT_decl_column : 7
    <b7e>   DW_AT_type        : <0x91>
    <b82>   DW_AT_data_member_location: 8
 <2><b83>: Abbrev Number: 13 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0x63679): _flags
    <b88>   DW_AT_decl_file   : 16
    <b89>   DW_AT_decl_line   : 162
    <b8a>   DW_AT_decl_column : 9
    <b8b>   DW_AT_type        : <0x43>
    <b8f>   DW_AT_data_member_location: 12
 <2><b90>: Abbrev Number: 13 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0x20ed3): _file
    <b95>   DW_AT_decl_file   : 16
    <b96>   DW_AT_decl_line   : 163
    <b97>   DW_AT_decl_column : 9
    <b98>   DW_AT_type        : <0x43>
    <b9c>   DW_AT_data_member_location: 14
 <2><b9d>: Abbrev Number: 12 (DW_TAG_member)
    <b9e>   DW_AT_name        : _bf
    <ba2>   DW_AT_decl_file   : 16
    <ba3>   DW_AT_decl_line   : 164
    <ba4>   DW_AT_decl_column : 17
    <ba5>   DW_AT_type        : <0xb24>
    <ba9>   DW_AT_data_member_location: 16
 <2><baa>: Abbrev Number: 13 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x63c50): _lbfsize
    <baf>   DW_AT_decl_file   : 16
    <bb0>   DW_AT_decl_line   : 165
    <bb1>   DW_AT_decl_column : 7
    <bb2>   DW_AT_type        : <0x91>
    <bb6>   DW_AT_data_member_location: 24
 <2><bb7>: Abbrev Number: 13 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0xe0cc9): _data
    <bbc>   DW_AT_decl_file   : 16
    <bbd>   DW_AT_decl_line   : 167
    <bbe>   DW_AT_decl_column : 18
    <bbf>   DW_AT_type        : <0xd0d>
    <bc3>   DW_AT_data_member_location: 28
 <2><bc4>: Abbrev Number: 0
 <1><bc5>: Abbrev Number: 5 (DW_TAG_const_type)
    <bc6>   DW_AT_type        : <0xb52>
 <1><bca>: Abbrev Number: 31 (DW_TAG_structure_type)
    <bcb>   DW_AT_name        : (indirect string, offset: 0xe6c59): _reent
    <bcf>   DW_AT_byte_size   : 96
    <bd0>   DW_AT_decl_file   : 16
    <bd1>   DW_AT_decl_line   : 377
    <bd3>   DW_AT_decl_column : 8
    <bd4>   DW_AT_sibling     : <0xd0d>
 <2><bd8>: Abbrev Number: 16 (DW_TAG_member)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x62fa7): _errno
    <bdd>   DW_AT_decl_file   : 16
    <bde>   DW_AT_decl_line   : 381
    <be0>   DW_AT_decl_column : 7
    <be1>   DW_AT_type        : <0x91>
    <be5>   DW_AT_data_member_location: 0
 <2><be6>: Abbrev Number: 16 (DW_TAG_member)
    <be7>   DW_AT_name        : (indirect string, offset: 0x681ee): _stdin
    <beb>   DW_AT_decl_file   : 16
    <bec>   DW_AT_decl_line   : 386
    <bee>   DW_AT_decl_column : 11
    <bef>   DW_AT_type        : <0xf65>
    <bf3>   DW_AT_data_member_location: 4
 <2><bf4>: Abbrev Number: 16 (DW_TAG_member)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x4fd52): _stdout
    <bf9>   DW_AT_decl_file   : 16
    <bfa>   DW_AT_decl_line   : 386
    <bfc>   DW_AT_decl_column : 20
    <bfd>   DW_AT_type        : <0xf65>
    <c01>   DW_AT_data_member_location: 8
 <2><c02>: Abbrev Number: 16 (DW_TAG_member)
    <c03>   DW_AT_name        : (indirect string, offset: 0xd9a38): _stderr
    <c07>   DW_AT_decl_file   : 16
    <c08>   DW_AT_decl_line   : 386
    <c0a>   DW_AT_decl_column : 30
    <c0b>   DW_AT_type        : <0xf65>
    <c0f>   DW_AT_data_member_location: 12
 <2><c10>: Abbrev Number: 16 (DW_TAG_member)
    <c11>   DW_AT_name        : (indirect string, offset: 0x8a25c): _inc
    <c15>   DW_AT_decl_file   : 16
    <c16>   DW_AT_decl_line   : 388
    <c18>   DW_AT_decl_column : 8
    <c19>   DW_AT_type        : <0x91>
    <c1d>   DW_AT_data_member_location: 16
 <2><c1e>: Abbrev Number: 16 (DW_TAG_member)
    <c1f>   DW_AT_name        : (indirect string, offset: 0xacc73): _emergency
    <c23>   DW_AT_decl_file   : 16
    <c24>   DW_AT_decl_line   : 390
    <c26>   DW_AT_decl_column : 9
    <c27>   DW_AT_type        : <0xe79>
    <c2b>   DW_AT_data_member_location: 20
 <2><c2c>: Abbrev Number: 16 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x5e3e3): __sdidinit
    <c31>   DW_AT_decl_file   : 16
    <c32>   DW_AT_decl_line   : 392
    <c34>   DW_AT_decl_column : 7
    <c35>   DW_AT_type        : <0x91>
    <c39>   DW_AT_data_member_location: 24
 <2><c3a>: Abbrev Number: 16 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x13058): _unspecified_locale_info
    <c3f>   DW_AT_decl_file   : 16
    <c40>   DW_AT_decl_line   : 394
    <c42>   DW_AT_decl_column : 7
    <c43>   DW_AT_type        : <0x91>
    <c47>   DW_AT_data_member_location: 28
 <2><c48>: Abbrev Number: 16 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xc22f4): _locale
    <c4d>   DW_AT_decl_file   : 16
    <c4e>   DW_AT_decl_line   : 395
    <c50>   DW_AT_decl_column : 22
    <c51>   DW_AT_type        : <0x10cd>
    <c55>   DW_AT_data_member_location: 32
 <2><c56>: Abbrev Number: 15 (DW_TAG_member)
    <c57>   DW_AT_name        : _mp
    <c5b>   DW_AT_decl_file   : 16
    <c5c>   DW_AT_decl_line   : 397
    <c5e>   DW_AT_decl_column : 18
    <c5f>   DW_AT_type        : <0x10d3>
    <c63>   DW_AT_data_member_location: 36
 <2><c64>: Abbrev Number: 16 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x21adc): __cleanup
    <c69>   DW_AT_decl_file   : 16
    <c6a>   DW_AT_decl_line   : 399
    <c6c>   DW_AT_decl_column : 10
    <c6d>   DW_AT_type        : <0x10e4>
    <c71>   DW_AT_data_member_location: 40
 <2><c72>: Abbrev Number: 16 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x86b96): _gamma_signgam
    <c77>   DW_AT_decl_file   : 16
    <c78>   DW_AT_decl_line   : 401
    <c7a>   DW_AT_decl_column : 7
    <c7b>   DW_AT_type        : <0x91>
    <c7f>   DW_AT_data_member_location: 44
 <2><c80>: Abbrev Number: 16 (DW_TAG_member)
    <c81>   DW_AT_name        : (indirect string, offset: 0xa0aea): _cvtlen
    <c85>   DW_AT_decl_file   : 16
    <c86>   DW_AT_decl_line   : 404
    <c88>   DW_AT_decl_column : 7
    <c89>   DW_AT_type        : <0x91>
    <c8d>   DW_AT_data_member_location: 48
 <2><c8e>: Abbrev Number: 16 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x647ed): _cvtbuf
    <c93>   DW_AT_decl_file   : 16
    <c94>   DW_AT_decl_line   : 405
    <c96>   DW_AT_decl_column : 9
    <c97>   DW_AT_type        : <0xe79>
    <c9b>   DW_AT_data_member_location: 52
 <2><c9c>: Abbrev Number: 16 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xa3853): _r48
    <ca1>   DW_AT_decl_file   : 16
    <ca2>   DW_AT_decl_line   : 407
    <ca4>   DW_AT_decl_column : 19
    <ca5>   DW_AT_type        : <0x10ea>
    <ca9>   DW_AT_data_member_location: 56
 <2><caa>: Abbrev Number: 16 (DW_TAG_member)
    <cab>   DW_AT_name        : (indirect string, offset: 0xb6004): _localtime_buf
    <caf>   DW_AT_decl_file   : 16
    <cb0>   DW_AT_decl_line   : 408
    <cb2>   DW_AT_decl_column : 16
    <cb3>   DW_AT_type        : <0x10f0>
    <cb7>   DW_AT_data_member_location: 60
 <2><cb8>: Abbrev Number: 16 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x33dff): _asctime_buf
    <cbd>   DW_AT_decl_file   : 16
    <cbe>   DW_AT_decl_line   : 409
    <cc0>   DW_AT_decl_column : 9
    <cc1>   DW_AT_type        : <0xe79>
    <cc5>   DW_AT_data_member_location: 64
 <2><cc6>: Abbrev Number: 16 (DW_TAG_member)
    <cc7>   DW_AT_name        : (indirect string, offset: 0xb3a69): _sig_func
    <ccb>   DW_AT_decl_file   : 16
    <ccc>   DW_AT_decl_line   : 412
    <cce>   DW_AT_decl_column : 12
    <ccf>   DW_AT_type        : <0x1101>
    <cd3>   DW_AT_data_member_location: 68
 <2><cd4>: Abbrev Number: 16 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x9c44e): __sglue
    <cd9>   DW_AT_decl_file   : 16
    <cda>   DW_AT_decl_line   : 420
    <cdc>   DW_AT_decl_column : 16
    <cdd>   DW_AT_type        : <0xf26>
    <ce1>   DW_AT_data_member_location: 72
 <2><ce2>: Abbrev Number: 16 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x3b4f9): __sf
    <ce7>   DW_AT_decl_file   : 16
    <ce8>   DW_AT_decl_line   : 421
    <cea>   DW_AT_decl_column : 11
    <ceb>   DW_AT_type        : <0xf65>
    <cef>   DW_AT_data_member_location: 84
 <2><cf0>: Abbrev Number: 16 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x6246a): _misc
    <cf5>   DW_AT_decl_file   : 16
    <cf6>   DW_AT_decl_line   : 422
    <cf8>   DW_AT_decl_column : 23
    <cf9>   DW_AT_type        : <0x110d>
    <cfd>   DW_AT_data_member_location: 88
 <2><cfe>: Abbrev Number: 16 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x8814a): _signal_buf
    <d03>   DW_AT_decl_file   : 16
    <d04>   DW_AT_decl_line   : 423
    <d06>   DW_AT_decl_column : 9
    <d07>   DW_AT_type        : <0xe79>
    <d0b>   DW_AT_data_member_location: 92
 <2><d0c>: Abbrev Number: 0
 <1><d0d>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <d0e>   DW_AT_byte_size   : 4
    <d0f>   DW_AT_type        : <0xbca>
 <1><d13>: Abbrev Number: 5 (DW_TAG_const_type)
    <d14>   DW_AT_type        : <0xd0d>
 <1><d18>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d19>   DW_AT_name        : (indirect string, offset: 0xa77ed): __sFILE
    <d1d>   DW_AT_byte_size   : 104
    <d1e>   DW_AT_decl_file   : 16
    <d1f>   DW_AT_decl_line   : 186
    <d20>   DW_AT_decl_column : 8
    <d21>   DW_AT_sibling     : <0xe5b>
 <2><d25>: Abbrev Number: 12 (DW_TAG_member)
    <d26>   DW_AT_name        : _p
    <d29>   DW_AT_decl_file   : 16
    <d2a>   DW_AT_decl_line   : 187
    <d2b>   DW_AT_decl_column : 18
    <d2c>   DW_AT_type        : <0xb4c>
    <d30>   DW_AT_data_member_location: 0
 <2><d31>: Abbrev Number: 12 (DW_TAG_member)
    <d32>   DW_AT_name        : _r
    <d35>   DW_AT_decl_file   : 16
    <d36>   DW_AT_decl_line   : 188
    <d37>   DW_AT_decl_column : 7
    <d38>   DW_AT_type        : <0x91>
    <d3c>   DW_AT_data_member_location: 4
 <2><d3d>: Abbrev Number: 12 (DW_TAG_member)
    <d3e>   DW_AT_name        : _w
    <d41>   DW_AT_decl_file   : 16
    <d42>   DW_AT_decl_line   : 189
    <d43>   DW_AT_decl_column : 7
    <d44>   DW_AT_type        : <0x91>
    <d48>   DW_AT_data_member_location: 8
 <2><d49>: Abbrev Number: 13 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x63679): _flags
    <d4e>   DW_AT_decl_file   : 16
    <d4f>   DW_AT_decl_line   : 190
    <d50>   DW_AT_decl_column : 9
    <d51>   DW_AT_type        : <0x43>
    <d55>   DW_AT_data_member_location: 12
 <2><d56>: Abbrev Number: 13 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x20ed3): _file
    <d5b>   DW_AT_decl_file   : 16
    <d5c>   DW_AT_decl_line   : 191
    <d5d>   DW_AT_decl_column : 9
    <d5e>   DW_AT_type        : <0x43>
    <d62>   DW_AT_data_member_location: 14
 <2><d63>: Abbrev Number: 12 (DW_TAG_member)
    <d64>   DW_AT_name        : _bf
    <d68>   DW_AT_decl_file   : 16
    <d69>   DW_AT_decl_line   : 192
    <d6a>   DW_AT_decl_column : 17
    <d6b>   DW_AT_type        : <0xb24>
    <d6f>   DW_AT_data_member_location: 16
 <2><d70>: Abbrev Number: 13 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0x63c50): _lbfsize
    <d75>   DW_AT_decl_file   : 16
    <d76>   DW_AT_decl_line   : 193
    <d77>   DW_AT_decl_column : 7
    <d78>   DW_AT_type        : <0x91>
    <d7c>   DW_AT_data_member_location: 24
 <2><d7d>: Abbrev Number: 13 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0xe0cc9): _data
    <d82>   DW_AT_decl_file   : 16
    <d83>   DW_AT_decl_line   : 196
    <d84>   DW_AT_decl_column : 18
    <d85>   DW_AT_type        : <0xd0d>
    <d89>   DW_AT_data_member_location: 28
 <2><d8a>: Abbrev Number: 13 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x3a1f8): _cookie
    <d8f>   DW_AT_decl_file   : 16
    <d90>   DW_AT_decl_line   : 200
    <d91>   DW_AT_decl_column : 10
    <d92>   DW_AT_type        : <0x65d>
    <d96>   DW_AT_data_member_location: 32
 <2><d97>: Abbrev Number: 13 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0xac8ea): _read
    <d9c>   DW_AT_decl_file   : 16
    <d9d>   DW_AT_decl_line   : 202
    <d9e>   DW_AT_decl_column : 29
    <d9f>   DW_AT_type        : <0xe8b>
    <da3>   DW_AT_data_member_location: 36
 <2><da4>: Abbrev Number: 13 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x1be7c): _write
    <da9>   DW_AT_decl_file   : 16
    <daa>   DW_AT_decl_line   : 204
    <dab>   DW_AT_decl_column : 29
    <dac>   DW_AT_type        : <0xeb5>
    <db0>   DW_AT_data_member_location: 40
 <2><db1>: Abbrev Number: 13 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0xd7633): _seek
    <db6>   DW_AT_decl_file   : 16
    <db7>   DW_AT_decl_line   : 207
    <db8>   DW_AT_decl_column : 13
    <db9>   DW_AT_type        : <0xed9>
    <dbd>   DW_AT_data_member_location: 44
 <2><dbe>: Abbrev Number: 13 (DW_TAG_member)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xdf04c): _close
    <dc3>   DW_AT_decl_file   : 16
    <dc4>   DW_AT_decl_line   : 208
    <dc5>   DW_AT_decl_column : 9
    <dc6>   DW_AT_type        : <0xef3>
    <dca>   DW_AT_data_member_location: 48
 <2><dcb>: Abbrev Number: 12 (DW_TAG_member)
    <dcc>   DW_AT_name        : _ub
    <dd0>   DW_AT_decl_file   : 16
    <dd1>   DW_AT_decl_line   : 211
    <dd2>   DW_AT_decl_column : 17
    <dd3>   DW_AT_type        : <0xb24>
    <dd7>   DW_AT_data_member_location: 52
 <2><dd8>: Abbrev Number: 12 (DW_TAG_member)
    <dd9>   DW_AT_name        : _up
    <ddd>   DW_AT_decl_file   : 16
    <dde>   DW_AT_decl_line   : 212
    <ddf>   DW_AT_decl_column : 18
    <de0>   DW_AT_type        : <0xb4c>
    <de4>   DW_AT_data_member_location: 60
 <2><de5>: Abbrev Number: 12 (DW_TAG_member)
    <de6>   DW_AT_name        : _ur
    <dea>   DW_AT_decl_file   : 16
    <deb>   DW_AT_decl_line   : 213
    <dec>   DW_AT_decl_column : 7
    <ded>   DW_AT_type        : <0x91>
    <df1>   DW_AT_data_member_location: 64
 <2><df2>: Abbrev Number: 13 (DW_TAG_member)
    <df3>   DW_AT_name        : (indirect string, offset: 0xd4d8f): _ubuf
    <df7>   DW_AT_decl_file   : 16
    <df8>   DW_AT_decl_line   : 216
    <df9>   DW_AT_decl_column : 17
    <dfa>   DW_AT_type        : <0xef9>
    <dfe>   DW_AT_data_member_location: 68
 <2><dff>: Abbrev Number: 13 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0x940c2): _nbuf
    <e04>   DW_AT_decl_file   : 16
    <e05>   DW_AT_decl_line   : 217
    <e06>   DW_AT_decl_column : 17
    <e07>   DW_AT_type        : <0xf09>
    <e0b>   DW_AT_data_member_location: 71
 <2><e0c>: Abbrev Number: 12 (DW_TAG_member)
    <e0d>   DW_AT_name        : _lb
    <e11>   DW_AT_decl_file   : 16
    <e12>   DW_AT_decl_line   : 220
    <e13>   DW_AT_decl_column : 17
    <e14>   DW_AT_type        : <0xb24>
    <e18>   DW_AT_data_member_location: 72
 <2><e19>: Abbrev Number: 13 (DW_TAG_member)
    <e1a>   DW_AT_name        : (indirect string, offset: 0x3773f): _blksize
    <e1e>   DW_AT_decl_file   : 16
    <e1f>   DW_AT_decl_line   : 223
    <e20>   DW_AT_decl_column : 7
    <e21>   DW_AT_type        : <0x91>
    <e25>   DW_AT_data_member_location: 80
 <2><e26>: Abbrev Number: 13 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0x4674b): _offset
    <e2b>   DW_AT_decl_file   : 16
    <e2c>   DW_AT_decl_line   : 224
    <e2d>   DW_AT_decl_column : 10
    <e2e>   DW_AT_type        : <0x8d5>
    <e32>   DW_AT_data_member_location: 84
 <2><e33>: Abbrev Number: 13 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x1be47): _lock
    <e38>   DW_AT_decl_file   : 16
    <e39>   DW_AT_decl_line   : 231
    <e3a>   DW_AT_decl_column : 12
    <e3b>   DW_AT_type        : <0x972>
    <e3f>   DW_AT_data_member_location: 88
 <2><e40>: Abbrev Number: 13 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x5edc1): _mbstate
    <e45>   DW_AT_decl_file   : 16
    <e46>   DW_AT_decl_line   : 233
    <e47>   DW_AT_decl_column : 14
    <e48>   DW_AT_type        : <0x943>
    <e4c>   DW_AT_data_member_location: 92
 <2><e4d>: Abbrev Number: 13 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0xb20c2): _flags2
    <e52>   DW_AT_decl_file   : 16
    <e53>   DW_AT_decl_line   : 234
    <e54>   DW_AT_decl_column : 9
    <e55>   DW_AT_type        : <0x91>
    <e59>   DW_AT_data_member_location: 100
 <2><e5a>: Abbrev Number: 0
 <1><e5b>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <e5c>   DW_AT_prototyped  : 1
    <e5c>   DW_AT_type        : <0x91>
    <e60>   DW_AT_sibling     : <0xe79>
 <2><e64>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e65>   DW_AT_type        : <0xd0d>
 <2><e69>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e6a>   DW_AT_type        : <0x65d>
 <2><e6e>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e6f>   DW_AT_type        : <0xe79>
 <2><e73>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e74>   DW_AT_type        : <0x91>
 <2><e78>: Abbrev Number: 0
 <1><e79>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_type        : <0xe7f>
 <1><e7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <e80>   DW_AT_byte_size   : 1
    <e81>   DW_AT_encoding    : 8	(unsigned char)
    <e82>   DW_AT_name        : (indirect string, offset: 0x46b6b): char
 <1><e86>: Abbrev Number: 5 (DW_TAG_const_type)
    <e87>   DW_AT_type        : <0xe7f>
 <1><e8b>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0xe5b>
 <1><e91>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <e92>   DW_AT_prototyped  : 1
    <e92>   DW_AT_type        : <0x91>
    <e96>   DW_AT_sibling     : <0xeaf>
 <2><e9a>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <e9b>   DW_AT_type        : <0xd0d>
 <2><e9f>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ea0>   DW_AT_type        : <0x65d>
 <2><ea4>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ea5>   DW_AT_type        : <0xeaf>
 <2><ea9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <eaa>   DW_AT_type        : <0x91>
 <2><eae>: Abbrev Number: 0
 <1><eaf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <eb0>   DW_AT_byte_size   : 4
    <eb1>   DW_AT_type        : <0xe86>
 <1><eb5>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <eb6>   DW_AT_byte_size   : 4
    <eb7>   DW_AT_type        : <0xe91>
 <1><ebb>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <ebc>   DW_AT_prototyped  : 1
    <ebc>   DW_AT_type        : <0x8e1>
    <ec0>   DW_AT_sibling     : <0xed9>
 <2><ec4>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ec5>   DW_AT_type        : <0xd0d>
 <2><ec9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <eca>   DW_AT_type        : <0x65d>
 <2><ece>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ecf>   DW_AT_type        : <0x8e1>
 <2><ed3>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ed4>   DW_AT_type        : <0x91>
 <2><ed8>: Abbrev Number: 0
 <1><ed9>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <eda>   DW_AT_byte_size   : 4
    <edb>   DW_AT_type        : <0xebb>
 <1><edf>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <ee0>   DW_AT_prototyped  : 1
    <ee0>   DW_AT_type        : <0x91>
    <ee4>   DW_AT_sibling     : <0xef3>
 <2><ee8>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <ee9>   DW_AT_type        : <0xd0d>
 <2><eed>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <eee>   DW_AT_type        : <0x65d>
 <2><ef2>: Abbrev Number: 0
 <1><ef3>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <ef4>   DW_AT_byte_size   : 4
    <ef5>   DW_AT_type        : <0xedf>
 <1><ef9>: Abbrev Number: 9 (DW_TAG_array_type)
    <efa>   DW_AT_type        : <0x3c>
    <efe>   DW_AT_sibling     : <0xf09>
 <2><f02>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f03>   DW_AT_type        : <0x98>
    <f07>   DW_AT_upper_bound : 2
 <2><f08>: Abbrev Number: 0
 <1><f09>: Abbrev Number: 9 (DW_TAG_array_type)
    <f0a>   DW_AT_type        : <0x3c>
    <f0e>   DW_AT_sibling     : <0xf19>
 <2><f12>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f13>   DW_AT_type        : <0x98>
    <f17>   DW_AT_upper_bound : 0
 <2><f18>: Abbrev Number: 0
 <1><f19>: Abbrev Number: 17 (DW_TAG_typedef)
    <f1a>   DW_AT_name        : (indirect string, offset: 0xc1edb): __FILE
    <f1e>   DW_AT_decl_file   : 16
    <f1f>   DW_AT_decl_line   : 292
    <f21>   DW_AT_decl_column : 26
    <f22>   DW_AT_type        : <0xd18>
 <1><f26>: Abbrev Number: 31 (DW_TAG_structure_type)
    <f27>   DW_AT_name        : (indirect string, offset: 0xbbb1a): _glue
    <f2b>   DW_AT_byte_size   : 12
    <f2c>   DW_AT_decl_file   : 16
    <f2d>   DW_AT_decl_line   : 296
    <f2f>   DW_AT_decl_column : 8
    <f30>   DW_AT_sibling     : <0xf5f>
 <2><f34>: Abbrev Number: 16 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0x81e32): _next
    <f39>   DW_AT_decl_file   : 16
    <f3a>   DW_AT_decl_line   : 298
    <f3c>   DW_AT_decl_column : 17
    <f3d>   DW_AT_type        : <0xf5f>
    <f41>   DW_AT_data_member_location: 0
 <2><f42>: Abbrev Number: 16 (DW_TAG_member)
    <f43>   DW_AT_name        : (indirect string, offset: 0x51f24): _niobs
    <f47>   DW_AT_decl_file   : 16
    <f48>   DW_AT_decl_line   : 299
    <f4a>   DW_AT_decl_column : 7
    <f4b>   DW_AT_type        : <0x91>
    <f4f>   DW_AT_data_member_location: 4
 <2><f50>: Abbrev Number: 16 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x6e281): _iobs
    <f55>   DW_AT_decl_file   : 16
    <f56>   DW_AT_decl_line   : 300
    <f58>   DW_AT_decl_column : 11
    <f59>   DW_AT_type        : <0xf65>
    <f5d>   DW_AT_data_member_location: 8
 <2><f5e>: Abbrev Number: 0
 <1><f5f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <f60>   DW_AT_byte_size   : 4
    <f61>   DW_AT_type        : <0xf26>
 <1><f65>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <f66>   DW_AT_byte_size   : 4
    <f67>   DW_AT_type        : <0xf19>
 <1><f6b>: Abbrev Number: 31 (DW_TAG_structure_type)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x4c088): _rand48
    <f70>   DW_AT_byte_size   : 24
    <f71>   DW_AT_decl_file   : 16
    <f72>   DW_AT_decl_line   : 324
    <f74>   DW_AT_decl_column : 8
    <f75>   DW_AT_sibling     : <0xfb2>
 <2><f79>: Abbrev Number: 16 (DW_TAG_member)
    <f7a>   DW_AT_name        : (indirect string, offset: 0xd75b2): _seed
    <f7e>   DW_AT_decl_file   : 16
    <f7f>   DW_AT_decl_line   : 325
    <f81>   DW_AT_decl_column : 18
    <f82>   DW_AT_type        : <0xfb2>
    <f86>   DW_AT_data_member_location: 0
 <2><f87>: Abbrev Number: 16 (DW_TAG_member)
    <f88>   DW_AT_name        : (indirect string, offset: 0xc8559): _mult
    <f8c>   DW_AT_decl_file   : 16
    <f8d>   DW_AT_decl_line   : 326
    <f8f>   DW_AT_decl_column : 18
    <f90>   DW_AT_type        : <0xfb2>
    <f94>   DW_AT_data_member_location: 6
 <2><f95>: Abbrev Number: 16 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x704ad): _add
    <f9a>   DW_AT_decl_file   : 16
    <f9b>   DW_AT_decl_line   : 327
    <f9d>   DW_AT_decl_column : 18
    <f9e>   DW_AT_type        : <0x56>
    <fa2>   DW_AT_data_member_location: 12
 <2><fa3>: Abbrev Number: 16 (DW_TAG_member)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x81e2d): _rand_next
    <fa8>   DW_AT_decl_file   : 16
    <fa9>   DW_AT_decl_line   : 330
    <fab>   DW_AT_decl_column : 36
    <fac>   DW_AT_type        : <0x8a>
    <fb0>   DW_AT_data_member_location: 16
 <2><fb1>: Abbrev Number: 0
 <1><fb2>: Abbrev Number: 9 (DW_TAG_array_type)
    <fb3>   DW_AT_type        : <0x56>
    <fb7>   DW_AT_sibling     : <0xfc2>
 <2><fbb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fbc>   DW_AT_type        : <0x98>
    <fc0>   DW_AT_upper_bound : 2
 <2><fc1>: Abbrev Number: 0
 <1><fc2>: Abbrev Number: 31 (DW_TAG_structure_type)
    <fc3>   DW_AT_name        : (indirect string, offset: 0xa68ef): _mprec
    <fc7>   DW_AT_byte_size   : 16
    <fc8>   DW_AT_decl_file   : 16
    <fc9>   DW_AT_decl_line   : 349
    <fcb>   DW_AT_decl_column : 8
    <fcc>   DW_AT_sibling     : <0x1009>
 <2><fd0>: Abbrev Number: 16 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0xdadbe): _result
    <fd5>   DW_AT_decl_file   : 16
    <fd6>   DW_AT_decl_line   : 352
    <fd8>   DW_AT_decl_column : 19
    <fd9>   DW_AT_type        : <0x9d8>
    <fdd>   DW_AT_data_member_location: 0
 <2><fde>: Abbrev Number: 16 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x8816f): _result_k
    <fe3>   DW_AT_decl_file   : 16
    <fe4>   DW_AT_decl_line   : 353
    <fe6>   DW_AT_decl_column : 7
    <fe7>   DW_AT_type        : <0x91>
    <feb>   DW_AT_data_member_location: 4
 <2><fec>: Abbrev Number: 16 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x67950): _p5s
    <ff1>   DW_AT_decl_file   : 16
    <ff2>   DW_AT_decl_line   : 354
    <ff4>   DW_AT_decl_column : 19
    <ff5>   DW_AT_type        : <0x9d8>
    <ff9>   DW_AT_data_member_location: 8
 <2><ffa>: Abbrev Number: 16 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x7dc61): _freelist
    <fff>   DW_AT_decl_file   : 16
    <1000>   DW_AT_decl_line   : 355
    <1002>   DW_AT_decl_column : 20
    <1003>   DW_AT_type        : <0x1009>
    <1007>   DW_AT_data_member_location: 12
 <2><1008>: Abbrev Number: 0
 <1><1009>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <100a>   DW_AT_byte_size   : 4
    <100b>   DW_AT_type        : <0x9d8>
 <1><100f>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1010>   DW_AT_name        : (indirect string, offset: 0x678f4): _misc_reent
    <1014>   DW_AT_byte_size   : 80
    <1015>   DW_AT_decl_file   : 16
    <1016>   DW_AT_decl_line   : 359
    <1018>   DW_AT_decl_column : 8
    <1019>   DW_AT_sibling     : <0x10b8>
 <2><101d>: Abbrev Number: 16 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xc823f): _strtok_last
    <1022>   DW_AT_decl_file   : 16
    <1023>   DW_AT_decl_line   : 362
    <1025>   DW_AT_decl_column : 9
    <1026>   DW_AT_type        : <0xe79>
    <102a>   DW_AT_data_member_location: 0
 <2><102b>: Abbrev Number: 16 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x5eb34): _mblen_state
    <1030>   DW_AT_decl_file   : 16
    <1031>   DW_AT_decl_line   : 363
    <1033>   DW_AT_decl_column : 14
    <1034>   DW_AT_type        : <0x943>
    <1038>   DW_AT_data_member_location: 4
 <2><1039>: Abbrev Number: 16 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0xc826e): _wctomb_state
    <103e>   DW_AT_decl_file   : 16
    <103f>   DW_AT_decl_line   : 364
    <1041>   DW_AT_decl_column : 14
    <1042>   DW_AT_type        : <0x943>
    <1046>   DW_AT_data_member_location: 12
 <2><1047>: Abbrev Number: 16 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0xbad5a): _mbtowc_state
    <104c>   DW_AT_decl_file   : 16
    <104d>   DW_AT_decl_line   : 365
    <104f>   DW_AT_decl_column : 14
    <1050>   DW_AT_type        : <0x943>
    <1054>   DW_AT_data_member_location: 20
 <2><1055>: Abbrev Number: 16 (DW_TAG_member)
    <1056>   DW_AT_name        : (indirect string, offset: 0xc1280): _l64a_buf
    <105a>   DW_AT_decl_file   : 16
    <105b>   DW_AT_decl_line   : 366
    <105d>   DW_AT_decl_column : 8
    <105e>   DW_AT_type        : <0x10b8>
    <1062>   DW_AT_data_member_location: 28
 <2><1063>: Abbrev Number: 16 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0xc6adb): _getdate_err
    <1068>   DW_AT_decl_file   : 16
    <1069>   DW_AT_decl_line   : 367
    <106b>   DW_AT_decl_column : 7
    <106c>   DW_AT_type        : <0x91>
    <1070>   DW_AT_data_member_location: 36
 <2><1071>: Abbrev Number: 16 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0x6927a): _mbrlen_state
    <1076>   DW_AT_decl_file   : 16
    <1077>   DW_AT_decl_line   : 368
    <1079>   DW_AT_decl_column : 14
    <107a>   DW_AT_type        : <0x943>
    <107e>   DW_AT_data_member_location: 40
 <2><107f>: Abbrev Number: 16 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0xc70a5): _mbrtowc_state
    <1084>   DW_AT_decl_file   : 16
    <1085>   DW_AT_decl_line   : 369
    <1087>   DW_AT_decl_column : 14
    <1088>   DW_AT_type        : <0x943>
    <108c>   DW_AT_data_member_location: 48
 <2><108d>: Abbrev Number: 16 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x3db60): _mbsrtowcs_state
    <1092>   DW_AT_decl_file   : 16
    <1093>   DW_AT_decl_line   : 370
    <1095>   DW_AT_decl_column : 14
    <1096>   DW_AT_type        : <0x943>
    <109a>   DW_AT_data_member_location: 56
 <2><109b>: Abbrev Number: 16 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x437fc): _wcrtomb_state
    <10a0>   DW_AT_decl_file   : 16
    <10a1>   DW_AT_decl_line   : 371
    <10a3>   DW_AT_decl_column : 14
    <10a4>   DW_AT_type        : <0x943>
    <10a8>   DW_AT_data_member_location: 64
 <2><10a9>: Abbrev Number: 16 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x7ba64): _wcsrtombs_state
    <10ae>   DW_AT_decl_file   : 16
    <10af>   DW_AT_decl_line   : 372
    <10b1>   DW_AT_decl_column : 14
    <10b2>   DW_AT_type        : <0x943>
    <10b6>   DW_AT_data_member_location: 72
 <2><10b7>: Abbrev Number: 0
 <1><10b8>: Abbrev Number: 9 (DW_TAG_array_type)
    <10b9>   DW_AT_type        : <0xe7f>
    <10bd>   DW_AT_sibling     : <0x10c8>
 <2><10c1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <10c2>   DW_AT_type        : <0x98>
    <10c6>   DW_AT_upper_bound : 7
 <2><10c7>: Abbrev Number: 0
 <1><10c8>: Abbrev Number: 28 (DW_TAG_structure_type)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xbbb73): __locale_t
    <10cd>   DW_AT_declaration : 1
 <1><10cd>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10ce>   DW_AT_byte_size   : 4
    <10cf>   DW_AT_type        : <0x10c8>
 <1><10d3>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10d4>   DW_AT_byte_size   : 4
    <10d5>   DW_AT_type        : <0xfc2>
 <1><10d9>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <10da>   DW_AT_prototyped  : 1
    <10da>   DW_AT_sibling     : <0x10e4>
 <2><10de>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <10df>   DW_AT_type        : <0xd0d>
 <2><10e3>: Abbrev Number: 0
 <1><10e4>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10e5>   DW_AT_byte_size   : 4
    <10e6>   DW_AT_type        : <0x10d9>
 <1><10ea>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10eb>   DW_AT_byte_size   : 4
    <10ec>   DW_AT_type        : <0xf6b>
 <1><10f0>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <10f1>   DW_AT_byte_size   : 4
    <10f2>   DW_AT_type        : <0x9ee>
 <1><10f6>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <10f7>   DW_AT_prototyped  : 1
    <10f7>   DW_AT_sibling     : <0x1101>
 <2><10fb>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <10fc>   DW_AT_type        : <0x91>
 <2><1100>: Abbrev Number: 0
 <1><1101>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1102>   DW_AT_byte_size   : 4
    <1103>   DW_AT_type        : <0x1107>
 <1><1107>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <1108>   DW_AT_byte_size   : 4
    <1109>   DW_AT_type        : <0x10f6>
 <1><110d>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <110e>   DW_AT_byte_size   : 4
    <110f>   DW_AT_type        : <0x100f>
 <1><1113>: Abbrev Number: 7 (DW_TAG_variable)
    <1114>   DW_AT_name        : (indirect string, offset: 0x681e5): __sf_fake_stdin
    <1118>   DW_AT_decl_file   : 16
    <1119>   DW_AT_decl_line   : 463
    <111b>   DW_AT_decl_column : 34
    <111c>   DW_AT_type        : <0xbc5>
    <1120>   DW_AT_external    : 1
    <1120>   DW_AT_declaration : 1
 <1><1120>: Abbrev Number: 7 (DW_TAG_variable)
    <1121>   DW_AT_name        : (indirect string, offset: 0x4fd49): __sf_fake_stdout
    <1125>   DW_AT_decl_file   : 16
    <1126>   DW_AT_decl_line   : 464
    <1128>   DW_AT_decl_column : 34
